{"url": "https://es.wikipedia.org/wiki/Epilepsia", "title": "Epilepsia", "summary": "\nLa epilepsia (del latín epilepsĭa, a su vez del griego ἐπιληψία, 'intercepción') es una enfermedad provocada por un desequilibrio en la actividad eléctrica de las neuronas de alguna zona del cerebro. Se caracteriza por uno o varios trastornos neurológicos que dejan una predisposición en el cerebro a padecer convulsiones recurrentes, que suelen dar lugar a consecuencias neurobiológicas, cognitivas y psicológicas.[1]​\n\nUna convulsión, crisis epiléptica o comicial es un evento súbito y de corta duración, caracterizado por una actividad neuronal anormal y excesiva o bien sincrónica en el cerebro. Las crisis epilépticas suelen ser transitorias, con o sin disminución del nivel de conciencia, con o sin movimientos convulsivos y otras manifestaciones clínicas.\n\nLa epilepsia puede tener muchas causas. Puede tener origen en lesiones cerebrales de cualquier tipo (traumatismos craneales, secuelas de meningitis, tumores, etc.), pero en muchos casos no hay ninguna lesión, sino únicamente una predisposición de origen genético a padecer las crisis. Cuando no hay una causa genética o traumática identificada, se le llama epilepsia idiopática, y los genes desempeñan un papel de modulación del riesgo de que ocurra un episodio y también en la respuesta al tratamiento.[2]​\n\nPara diagnosticar la epilepsia se requiere conocer los antecedentes personales y familiares y, por lo general, se corrobora con un electroencefalograma (EEG). También forman parte del diagnóstico estudios de imagenología, mientras que se reservan los procedimientos diagnósticos más especializados para casos muy puntuales. El tratamiento consiste en la administración de medicamentos anticonvulsivos. En los casos refractarios (es decir, que no responden a estos tratamientos, sobre todo en los que se presentan series de convulsiones, y se pone por ello en peligro la vida), se apela a otros métodos, entre los cuales se incluye la cirugía.[cita requerida] La epilepsia causa múltiples efectos en la vida cotidiana del paciente, de manera que el tratamiento debe incluir el abordaje de estas consecuencias.\n\nLa epilepsia también afecta a los animales, especialmente a los domésticos: tanto en gatos como en perros, los síntomas son los mismos que se han descrito para el ser humano.[3]​\n\n", "sections": [{"name": "Terminología", "text": "El término epilepsia puede resultar confuso, ya que en el ámbito coloquial se suele utilizar indiscriminadamente para toda aquella persona que presenta una convulsión, de tal manera que un individuo puede haber tenido una convulsión por niveles bajos de azúcar en la sangre o un niño con una fiebre alta. No obstante, la epilepsia describe un trastorno en el que una persona tiene convulsiones recurrentes en el tiempo debido a un proceso crónico subyacente, de causa desconocida o no.[4]​\n\nNo todas las personas que padecen una convulsión se diagnostican de epilepsia. Habitualmente es necesario haber presentado al menos dos episodios de crisis epilépticas o un episodio asociado a hallazgos patológicos en el electroencefalograma interictal, es decir, entre una convulsión y la otra, que no está precedida por una causa identificable, por ejemplo, una inflamación aguda, una descarga eléctrica o envenenamiento, tumores o hemorragias intracraneales.\n\n", "subsections": [{"name": "Otros nombres", "text": "La epilepsia ha sido conocida con varios nombres a lo largo de la historia: “mal caduco”, “morbus herculeum”, porque según Aristóteles, Hércules padecía de epilepsia. Otras denominaciones entre griegos y romanos fueron “morbus sacer” y “morbus deificus”, que significa “enfermedad sagrada”, que aparece en los textos de Heráclito y Heródoto. Platón refiere que la parte más divina del alma se encuentra en la cabeza, y que cuando la flema blanca se encuentra con la negra, se produce la “enfermedad sagrada”. Algunos médicos llegaron a atribuir a quienes la padecían el don de la clarividencia y emplearon el nombre de Divinatio, o sea divina acción. Los Incas la denominaban “aya huayra” o “huanuy oncuy” viento de la muerte o enfermedad de la muerte.[5]​\n\n"}]}, {"name": "Epilepsia y genética", "text": "Las epilepsias que no son debidas a un accidente, tumor, malformación o problema inducido por un problema orgánico, pueden ser genéticas. Los avances recientes hacen que se busque la causa genética en esos casos. Los investigadores han encontrado una mutación causante de la epilepsia entre un 12,5 % y el 49 % cuando se hace un exoma dirigido a un amplio número de genes relacionados con la epilepsia. Estos estudios ya demuestran la correlación entre el diagnóstico y la reducción directa de la hospitalización. La búsqueda, por lo tanto, justificaría tanto clínica, como económicamente la realización de las técnicas genéticas de secuenciación masiva, a mayor número de genes, mayor eficiencia diagnóstica. En un estudio en el que se analizaron 862 genes relacionados con la epilepsia a 86 pacientes, la eficiencia diagnóstica fue de un 49 % (42 pacientes diagnosticados genéticamente).[6]​[7]​[8]​\n\nEn EE. UU. y Canadá, en 2017 se puso un programa para ofrecer gratuitamente un exoma dirigido a detectar epilepsias infantiles, para ello se sacó un programa \"Behind The Seizure\" que ofrece esta prueba a cualquier niño que haya tenido una crisis convulsiva no debida a accidente o tumor antes de cumplir los 60 meses.\n\nLa identificación temprana de la alteración genética causal subyacente utilizando el enfoque la secuenciación masiva que proporciona información pronóstica, influirá en las decisiones terapéuticas y conducirá al diseño de nuevos fármacos dirigidos a defectos específicos de genes.[9]​\n\n", "subsections": []}, {"name": "Clasificación", "text": "Las crisis epilépticas se clasifican en función de la sintomatología que presentan, y cada tipo/subtipo se cree que representa un único mecanismo fisiopatológico y sustrato anatómico. Esto significa que la caracterización del tipo de crisis epiléptica no solo tiene implicaciones descriptivas en cuanto a cómo es la crisis, sino que es una entidad diagnóstica en sí misma, con implicaciones etiológicas, terapéuticas y pronósticas peculiares.\n\nCada tipo de epilepsia tiene diferentes manifestaciones que se determinan a través del tipo de crisis epiléptica, así como a través de la etiología, del curso de la enfermedad, de su pronóstico (desenlace probable de la enfermedad) y por último a través de un diagnóstico EEG (“curva de corriente en el cerebro”). El estudio del electroencefalograma no siempre informa que haya indicios de epilepsia porque muchas veces algunos cambios eléctricos se producen en zonas tan profundas dentro del cerebro que el electroencefalograma no los puede detectar. Igualmente hay que acotar que las descargas sub-clínicas no solo se generan en niños con epilepsia, sino también en aquellos que no la presentan.[10]​ Todos estos factores pueden ser muy diversos, según cada una de las diferentes formas de la epilepsia.\n\nLo mismo que en las convulsiones, se diferencia también en las epilepsias entre formas generalizadas y focales, dependiendo de si están acompañadas de convulsiones generalizadas o focales.\n\nSegún la Comisión Internacional de la Liga Internacional contra la Epilepsia (ILAE), las crisis epilépticas se clasifican en:\n\nSólo con pérdida de la conciencia\nComplejas: con movimientos clónicos, tónicos o automáticos breves\nMotoras originadas en el lóbulo frontal (tónicas, clónicas, tónico-clónicas: jacksonianas; epilepsia benigna de la infancia; epilepsia parcial continua)\nSomatosensoriales o sensoriales especiales (visuales, auditivas, olfatorias, gustativas, vertiginosas)\nVegetativas\nPsíquicas puras\nInician como crisis parciales simples y progresan hasta afectar el estado de conciencia\nCon trastorno de la conciencia desde el principio\nUna segunda clasificación planteada por la ILAE plantea la posibilidad de clasificarla en idiopática, criptogénica y sintomática. Las causas de los diferentes tipos de epilepsias pueden ser de índole diversa.[12]​\n\n\nLa mayor parte de las epilepsias, según su etiología, son epilepsias residuales, esto es epilepsias como secuela, como “residuo”, de un trastorno cerebral anterior ya concluido. Estas epilepsias residuales o de defecto pueden ser consecuencia de una enfermedad infecciosa durante el embarazo (por ej., la rubeola), por falta de oxígeno durante el nacimiento, por una encefalitis o meningitis padecida durante la niñez o por una contusión cerebral sufrida a causa de un accidente. Estas son las denominadas epilepsias sintomáticas.\n\nPor un proceso de epilepsia se entiende por el contrario una enfermedad-epilepsia, consecuencia de una enfermedad neurológica progresiva (proceso en continuación, no concluido).\nEl ejemplo más importante y común en un proceso de epilepsia es el tumor cerebral, aunque también pueden conducir a una epilepsia los trastornos vasculares o enfermedades metabólicas. Puede ser una manifestación de la enfermedad de Wernicke.\n\nLas epilepsias en las que se presume un origen orgánico, pero que aún no puede ser probado, se denominan epilepsias criptógenas (criptógena = origen oculto), mientras que las epilepsias idiopáticas son aquellas que tienen un origen hereditario y su cuadro clínico y hallazgos electroencefalográficos siguen un patrón rígido.[13]​\nEstas últimas pueden aparecer en varios miembros de una familia debido a que, como en muchas otras enfermedades (por ej., diabetes, reumatismo) no la enfermedad misma, sino la predisposición a ésta se transmite a la descendencia.\n\nVéase también:\n", "subsections": [{"name": "Síndromes epilépticos", "text": "Existen centenares de diferentes tipos de epilepsias. Síndrome epiléptico es el nombre de un conjunto de signos y síntomas específicos, que incluyen uno o más tipos de crisis epiléptica junto con sintomatología no necesariamente convulsiva, como por ejemplo, discapacidad intelectual o psicomotor, y que pese a constituir una entidad diferenciable clínicamente, puede tener diversas causas.\n\nExisten también enfermedades epilépticas, que por razón de sus características, específicas y bien definidas, cursan con convulsiones repetitivas. Habitualmente tiene nombre propio, como la enfermedad de Unverricht-Lundborg o el síndrome de Lennox-Gastaut. Otros síndromes epilépticos son:\n\nEncefalopatía epiléptica: en la cual se cree que las propias crisis convulsivas contribuyen al establecimiento de un trastorno progresivo de la función cerebral.\nSíndrome epiléptico benigno: se considera benigno aquel síndrome epiléptico que es fácilmente tratable o no necesita tratamiento por ser autolimitado en el tiempo y remitir sin secuelas.\nSíndrome epiléptico/epilepsia refleja: son aquellos síndromes epilépticos en los que todas las crisis comiciales se desencadenan por un estímulo sensorial, por ejemplo la epilepsia fotosensible y la epilepsia musicógena.\nSíndrome epiléptico/epilepsia reactiva: son aquellas epilepsias relacionadas con una situación previa, como las crisis convulsivas por deprivación alcohólica.\nEpilepsia de ausencia infantil: es una epilepsia idiopática generalizada que afecta a niños entre las edades de cuatro y doce años. Las crisis de ausencia se manifiestan con disminución o pérdida del estado de conciencia, a veces con características motoras de menor importancia, tales como parpadeos o movimientos de la mandíbula.[14]​\nSíndrome de epilepsia en sin/con retraso mental PCDH19: es una epilepsia genética que es más común en niñas dentro de los tres primeros años de vida. Las crisis pueden ser de distinto tipo, pero las más frecuentes son las crisis tónico-clónicas generalizadas o unilaterales. Habitualmente comienzan con convulsiones en serie o encadenadas, y suelen confundirse con otros síndromes, como el síndrome de Dravet. En las niñas de entre 14 y 36 meses que sufren este mal, hay un tercio con coeficiente intelectual normal, pero las dos terceras partes restantes presentan retraso de algún tipo. Las crisis pueden comenzar con fiebre, sin fiebre y/o tras la vacunación (aunque es importante señalar que las vacunas no son la causa, son el detonante) como ocurre con el síndrome de Dravet. En 2008 se encontró la mutación causante de la enfermedad, el gen PCDH19.[15]​ Esta epilepsia también se llama síndrome de Juberg y Hellman.\nEpilepsia catamenial: es aquella en la que varía la frecuencia de las crisis en función de la fase del ciclo menstrual en la que se encuentre la mujer. La mayoría presentan crisis epilépticas inmediatamente antes o durante la menstruación, o bien un incremento de estas.[16]​\nEpilepsia nocturna del lóbulo frontal autosómica dominante (ADNFLE): trastorno hereditario que causa convulsiones durante el sueño que duran entre cinco segundos y cinco minutos. Estos ataques surgen de los lóbulos frontales, y consisten en movimientos motores complejos. Es causada por una mutación en uno de los varios genes que codifican para los receptores nicotínicos.[cita requerida]\nEpilepsia frontal nocturna (NFLE[17]​, Nocturnal Frontal Lobe Epilepsy aunque actualmente se denomina en inglés como \"SHE\"[18]​ por sus siglas en inglés \"Sleep-related Hypermotor Epilepsy\"). Al igual que el anterior son crisis epilépticas que surgen durante el sueño profundo (etapas I y II). La principal diferencia con la anterior es que esta no tiene origen genético. El origen de esta enfermedad es más complicado de conocer que ADNFLE lo que provoca que su diagnóstico sea tardío. El diagnóstico diferencial se realiza mediante una polisomnografía nocturna. Para esta enfermedad y todas con origen focal se ha demostrado científicamente que los mejores medicamentos son[19]​: Topiramato, Lacosamida y Carbamazepina.\nEpilepsia occipital benigna de la infancia: la mayoría de las autoridades incluyen dos subtipos: un subtipo de inicio temprano con entre tres y cinco años, y uno de inicio tardío, entre los siete y los diez años. Los pacientes más jóvenes suelen experimentar síntomas similares a la migraña con náuseas y dolor de cabeza, mientras que los pacientes mayores suelen quejarse de alteraciones visuales como escorotomas o amaurosis.\nEpilepsia primaria de la lectura: en los individuos susceptibles, la lectura provoca crisis parciales típicas, y afecta los músculos de la masticación y la vista. El desarrollo suele darse durante la postpubertad. Las crisis las provoca independientemente cualquier texto y las induce con una mayor frecuencia la lectura en voz alta.[12]​\nEpilepsia rolándica: también conocida como epilepsia benigna de la infancia con puntas centrotemporales, es el síndrome epiléptico más común en niños, y desaparece en la adolescencia. Habitualmente consiste en crisis parciales, junto a salivación y disartria durante el sueño. En la mayoría de los casos no es necesario tratamiento alguno.[20]​\nEncefalitis de Rasmussen: enfermedad rara, de etiología desconocida, que aparece con una mayor frecuencia en niños de edades comprendidas entre los tres y los doce años. Aparte de la encefalitis, el deterioro neurológico y los anticuerpos autoinmunes, se caracteriza por crisis epilépticas, generalmente parciales continuas.[21]​\nEsclerosis tuberosa (TSC): es un trastorno genético que causa tumores que se forman en multitud de órganos diferentes, como en cerebro, ojos, corazón, riñón, piel y pulmones. Las lesiones cerebrales que puede causar suelen desencadenar trastornos epilépticos.\nSíndrome de Dravet: las crisis epilépticas comienzan como crisis clónicas generalizadas o unilaterales, durante el primer año de vida del paciente. Suelen ser prolongadas (hasta 20 minutos).[22]​\nSíndrome de Ohtahara: es una forma rara de síndrome epiléptico combinado con parálisis cerebral. Se caracteriza con crisis frecuentes, que suelen comenzar en los pocos primeros días de vida.[23]​\nSíndrome de West: crisis breves durante el primer año de vida del enfermo, bilaterales y simétricas. Se acompaña de retraso psicomotor.[24]​\n"}]}, {"name": "Etiología", "text": "Las crisis epilépticas pueden aparecer por múltiples causas, pero según la edad de inicio de las crisis es más frecuente que sea por unas que por otras, tal y como se refleja en el siguiente listado de mayor a menor frecuencia en cada grupo de edad:\n\nDe origen genético:\nEpilepsia genética poligénica: hay varios genes implicados en la genética de esa epilepsia.\nEpilepsia monogénica: se trata de que una sola mutación en un gen genera la epilepsia. No todos los genes que la provocan están identificados. Se estima que hay más de 800 genes involucrados en la epilepsia y no todos están descubiertos.\nPor duplicación o falta de material genético (duplicaciones o delecciones).\nContinuamente se están descubriendo tipos de epilepsia de origen genético que hasta ahora no tenían etiqueta.\n\nCausas posibles:\n\na) En neonatos menores de 1 mes:\n\nhipoxia perinatal;\nhemorragia intracraneal, golpes, caídas;\ninfecciones del SNC: meningitis, encefalitis, abscesos cerebrales;\nalteraciones genéticas, metabólicas o del desarrollo;\ntrastornos metabólicos: hipoglucemia, hipocalcemia, hipomagnesemia, déficit de piridoxina;\nsíndrome de abstinencia;\ntraumatismos craneoencefálicos (TCE).\nb) En niños de 1 mes a 12 años:\n\ncrisis febriles;\nalteraciones genéticas y enfermedades degenerativas cerebrales;\ninfecciones del SNC;\ntraumatismos craneoencefálicos (TCE);\ntóxicos y defectos metabólicos;\nidiopáticas.\nc) En adolescentes de 12 a 18 años:\n\ntraumatismos;\nidiopáticas;\ngenéticas y enfermedades degenerativas cerebrales;\ntumores;\nconsumo de tóxicos, incluido alcohol;\ninfecciones.\nd) En adultos de 18 a 35 años:\n\ntraumatismos;\nabstinencia del alcohol;\nconsumo de tóxicos;\ntumores;\nidiopáticas.\ne) En mayores de 35 años:\n\nenfermedad cerebrovascular (ictus previo), primera causa en mayores de 50 años;\ntumores, primera causa entre los 35 y 50 años;\nabstinencia alcohólica;\nuremia, enfermedad hepática, hipoglucemia, alteraciones electrolíticas.\naccidente vascular cerebral.\nf) En mayores de 50 años: accidente cerebrovascular (como secuela).\n\nTanto en la edad pediátrica como en la edad adulta, en una parte de los casos la epilepsia es secundaria a una enfermedad celíaca o una sensibilidad al gluten no celíaca subyacentes, y puede tratarse de la única manifestación de dichas enfermedades, en ausencia de síntomas digestivos o de otro tipo.[25]​[26]​[27]​[28]​[29]​ El cuadro clínico generalmente incluye calcificaciones occipitales y convulsiones procedentes de varias localizaciones cerebrales, si bien también se han documentado casos de epilepsia del lóbulo temporal.[28]​ El riesgo de desarrollar epilpesia es mayor cuanto más tiempo pase la enfermedad celíaca o la sensibilidad al gluten sin reconocer y sin tratar, puesto que se relaciona con el tiempo de exposición al gluten.[29]​\n\n", "subsections": []}, {"name": "Cuadro clínico", "text": "Una crisis epiléptica o convulsión ocurre cuando una actividad anormal eléctrica en el cerebro causa un cambio involuntario de movimiento o función del cuerpo, de sensación, de la capacidad de estar alerta o de comportamiento. La crisis puede durar desde unos segundos hasta varios minutos, e incluso en algunas crisis parciales pueden llegar a ser continuas, durando días, semanas o meses.\n\nLos síntomas que experimenta una persona durante una crisis epiléptica dependen del lugar en el cerebro en el cual ocurre la alteración de la actividad eléctrica. Por lo tanto, el cuadro clínico varía dependiendo del tipo de síndrome epiléptico causante de las crisis. Se denominan crisis tonico-clónicas (también llamada de grand mal) a aquellas en el que el paciente pierde el sentido y se desploma, se pone rígido y tiene espasmos musculares. En las crisis parciales complejas, el paciente puede parecer confundido o aturdido y no podrá responder a preguntas ni a instrucciones.\n\nSin embargo, no todas las crisis son tan notables. Existen ataques muy leves (petit mal), los cuales apenas pueden ser percibidos por las personas de alrededor, siendo la única manifestación de la crisis epiléptica un parpadeo rápido o algunos segundos de mirada perdida con desconexión del medio; a este tipo de crisis epilépticas se les denomina ausencias y son relativamente frecuentes durante la infancia.\n\nLas pruebas diagnósticas fundamentales en las personas con epilepsia son el electroencefalograma (EEG), que es de mayor utilidad cuando se realiza con una duración mayor a 6 horas,[30]​ la resonancia magnética de cerebro y los estudios genéticos.[31]​ Ambos deben ser repetidos en la evolución en algunas ocasiones para observar la evolución o confirmar la causa o el síndrome epiléptico, o incluso para tomar decisiones de tratamiento.[32]​\n\n", "subsections": []}, {"name": "Tratamiento", "text": "La epilepsia así como las crisis epilépticas pueden en la actualidad recibir un tratamiento con resultados aceptables. En la mayoría de los casos, las epilepsias de la infancia se curan en la pubertad.[33]​ Cuando la epilepsia se debe a una lesión claramente visible y esa lesión es eliminada quirúrgicamente, se reduce la intensidad y frecuencia o bien, en muchos casos, se cura la epilepsia.[34]​ Por lo tanto, al comienzo del tratamiento se examina al individuo, en busca de causas de la epilepsia que se puedan eliminar, por ejemplo, la operación de un tumor cerebral o la supresión o mitigación de un trastorno metabólico.\n\nEn otros casos esto no es posible, ya sea porque no se ha encontrado ninguna causa o porque ésta no pueda ser eliminada, como es el caso de cicatrices, malformaciones en el cerebro o una predisposición inherente a las convulsiones. El objetivo en estos casos es la eliminación de los ataques por medio de medicamentos u operaciones quirúrgicas.[35]​\n\nEn algunos casos un tratamiento quirúrgico puede ser más ventajoso que el farmacológico; esto sucede normalmente sólo en el caso de epilepsias focales y de momento afecta a menos de un 5 % de todos los enfermos epilépticos.\n\n", "subsections": [{"name": "Farmacológico", "text": "La terapia “clásica” que se realiza en más del 90 % de todos los enfermos epilépticos es a través de medicamentos inhibitorios de crisis: los antiepilépticos. Normalmente esta terapia medicamentosa se realiza a lo largo de muchos años. Gracias a ello muchos de los pacientes tratados (un 60 % aproximadamente) reducen de manera importante la frecuencia de las crisis y en más del 20 % de los casos se consigue alguna mejora. La tolerancia de los fármacos antiepilépticos (AED, por sus siglas en inglés) no es muy buena en general. En algunos casos, estos medicamentos pueden tener efectos secundarios adversos debido a la alta dosis requerida para el control de las crisis, siendo absolutamente necesaria una vigilancia facultativa regular de la terapia. Los efectos secundarios pueden ser agudos (reacción alérgica cutánea) o crónicos (vértigo, letargo, náuseas, alteraciones del comportamiento...).[36]​\n\nAdemás, se calcula que la respuesta a los fármacos puede estar condicionada hasta en un 85 % por factores genéticos, por lo que ya existen en el mercado pruebas que recogen la información farmacogenética del paciente para que el médico pueda valorar qué tratamiento va a funcionar mejor en el paciente con epilepsia, en función de sus características genéticas. Así el médico puede escoger el tipo de fármaco y la dosis más adecuada que evite al máximo posible los efectos secundarios.[37]​\n\nEl fármaco antiepiléptico concreto debe ser individualizado en función del síndrome epiléptico, tipo de crisis, edad del paciente, otras patologías que sufra el paciente, interacción con otros medicamentos, características específicas del paciente (mujer en edad gestacional, embarazo, peso, etc.) y preferencias del paciente (perfil de efectos secundarios, número de tomas al día, etc.).[36]​\n\nNo es aconsejable el cambio entre genéricos porque puede variar la biodisponibilidad así como los perfiles farmacocinéticos con lo que se puede modificar el efecto deseado o aumentar los efectos secundarios.\n\nLa monoterapia, cuando sea posible, debe ser la elección y si esta fracasa, una vez se ha asegurado que se han alcanzado niveles terapéuticos, se debe cambiar a otro fármaco bajo estricta supervisión médica.\n\nLa combinación de dos fármacos solo debe ser considerada cuando hayan fracasado varios intentos de control de las crisis en monoterapia. Si a pesar de ello no se controlan, se deberá valorar con qué terapia estaba mejor controlado el paciente, teniendo en cuenta la frecuencia de aparición de crisis así como los efectos secundarios.\n\nEl tratamiento con un AED se debe iniciar ante una segunda crisis epiléptica. Ante un primer ataque epiléptico se debe considerar el inicio del tratamiento con AED si:\n\nExiste déficit neurológico.\nEl EEG demuestra actividad epiléptica inequívoca.\nLa familia no quiere correr el riesgo de un segundo ataque epiléptico.\nEn las pruebas de imagen se observa alteración estructural.\nPara optimizar la adherencia al tratamiento se debe:\n\nProporcionar educación sanitaria a paciente y familia.\nDisminuir el estigma que supone la enfermedad.\nUtilizar prescripciones sencillas de cumplir.\nMantener buena relación entre los distintos niveles sanitarios y estos con la familia o cuidadores.\nEl control analítico de rutina no está recomendado, salvo indicación clínica. Se debe realizar control analítico en caso de:\n\nAusencia de adherencia al tratamiento.\nSospecha de toxicidad.\nTratamiento de las interacciones farmacocinéticas.\nSituaciones clínicas específicas como estatus epiléptico, embarazo, fallo orgánico.\nLa decisión para retirar la medicación se debe hacer en consenso con el paciente, la familia o cuidadores una vez que hayan comprendido el riesgo de un posible nuevo ataque, una vez tenido en cuenta el tipo de epilepsia, pronóstico y calidad de vida siempre y cuando hayan pasado dos años sin ningún ataque. La retirada debe realizarse lentamente, a lo largo de 2-3 meses.\n\nLa intervención psicológica puede ser utilizada conjuntamente con el AED, si no realiza un control adecuado de la epilepsia, aunque no debe ser una alternativa a los AED. Los ataques convulsivos que duran más de 5 minutos o que se repiten por tres ocasiones en una hora deben recibir tratamiento urgente y como primera elección se debe escoger el diazepam rectal, que es seguro y eficaz.\n\n"}, {"name": "Dietético", "text": "En aquellos pacientes en los que la epilepsia aparece asociada a una enfermedad celíaca o a una sensibilidad al gluten no celíaca, la dieta sin gluten estricta y mantenida puede permitir el control de la epilepsia, con una mejora en la frecuencia e intensidad de las convulsiones. Los resultados son mejores cuanto antes se retiren los alimentos que contienen gluten de la alimentación, desde el comienzo de las primeras manifestaciones de la epilepsia.[27]​[28]​\n\nAproximadamente la mitad de los pacientes con epilepsia refractaria a los tratamientos convencionales que inician una dieta cetogénica, consiguen una mejora superior al 50 % en la reducción de las crisis epilépticas.[38]​ No obstante, esta dieta es muy restrictiva, difícil de aplicar y cumplir, y puede provocar graves efectos negativos sobre la salud.[39]​\n\n"}, {"name": "Quirúrgico", "text": "La neurocirugía está indicada cuando la epilepsia es resistente a los AEDs. La cirugía puede ser paliativa o curativa. La paliativa se realiza en los casos de epilepsias catastróficas. La valoración de realizar una cirugía resectiva, que pueda ser curativa, debe realizarse antes del planteamiento de realizar tratamientos paliativos como la estimulación del nervio vago. Esta valoración tiene dos fases: una no invasiva y una invasiva; la no invasiva consiste en realizar estudios clínicos que no necesitan de una intervención quirúrgica. Estos estudios son: EEG basal, un video monitoreo, una IRM de cerebro con características especiales, de acuerdo con el tipo de epilepsia que se esté investigando. Pueden sumarse estudios de S.P.E.C.T. o de P.E.T. Siempre incluye además una valoración neurosicológica.[40]​\n\nLos estudios de Fase 2, que necesitan de una cirugía son: la colocación de electrodos subdurales o la estimulación cortical transoperatoria. A esta fase se llega en los casos de difícil diagnóstico, o en los que no hay una lesión visible en las imágenes.\n\nHay que tomar en cuenta además, que la cirugía de epilepsia no consiste en sacar una lesión, sino en delimitar una zona desde donde se originan las crisis convulsivas. Es por esto que se necesitan todos estos estudios, antes de decidirse por un tratamiento quirúrgico.\nLa estimulación del nervio vago es una alternativa en aquellos pacientes en los que no hay control completo de los ataques y donde la cirugía está contraindicada. Está indicada en crisis parciales (incluyendo las secundariamente generalizadas) y las crisis generalizadas.\n\nEn casos severos, una opción quirúrgica es realizar una escisión cerebral. Esta operación consta de un corte en el cerebro que imposibilita que los hemisferios cerebrales se comuniquen. Esta falta de comunicación genera que coexistan dos mentes en un cerebro, ya que puede haber información que es conocida por un hemisferio y desconocida por el otro, así como puede haber conductas generadas o monitoreadas por un hemisferio y desconocidas por el otro. A pesar de que esta operación genera una lesión cerebral que conlleva efectos colaterales indeseados, los pacientes logran controlar las crisis epilépticas, lo que implica un gran avance a su calidad de vida.\n\nMagnetoencefalografía\nLa magnetoencefalografía es una tecnología avanzada que se utiliza para localizar y mapear de una manera no invasiva las áreas del cerebro que presentan y las que no presentan trastornos. Para registrar con precisión los campos magnéticos del cerebro, la MEG debe llevarse a cabo en una habitación magnéticamente blindada. Esta sala especial bloquea todos los demás campos magnéticos del entorno, a fin de que el médico pueda grabar sólo los campos magnéticos del cerebro. Esta técnica podría resultar de utilidad en la evaluación de la cirugía de la epilepsia.[41]​\n\n"}, {"name": "Durante el embarazo", "text": "La epilepsia si está controlada no es un problema en el embarazo, sin embargo, es un momento crítico y de gran importancia, pues existe un cambio hormonal importante que puede afectar en la enfermedad, existen guías médicas sobre cuidados para las embarazadas en el embarazo,[42]​ tiene gran importancia: el control de las crisis, prevención de golpes al feto, y el uso de medicamentos. Los fármacos no se deben interrumpir, sin embargo, se aconseja que se utilice un único fármaco antiepiléptico y que se use en la mínima dosis posible, estudios indican que algunos antiepilépticos pueden provocar malformaciones de distinto tipo además de nacer con un menor coeficiente intelectual. Sin embargo, es importante subrayar que un embarazo con una epilepsia descontrolada es mucho peor para la madre y el feto.\n\n"}, {"name": "Durante la lactancia", "text": "La lactancia es una época dura y difícil que se asocia al cansancio, cambios hormonales y a la falta de sueño. Las mujeres epilépticas para evitar problemas en el postparto y la lactancia deben descansar adecuadamente y recibir ayuda familiar. Estudios indican que hay bajo riesgo para el lactante; sin embargo, se aconseja que la madre permanezca acostada al dar el pecho; no se debe dar fenobarbital a la madre y se debe realizar un destete progresivo si fuera necesario.\n\n"}]}, {"name": "Repercusiones", "text": "Las crisis epilépticas no conducen inevitablemente a una reducción de determinadas funciones cerebrales (por ej., la inteligencia), aunque sea un prejuicio muy extendido. Además, de existir comportamientos psíquicos extraños en enfermos que padecen crisis (retraso en el desarrollo intelectual, trastornos en el comportamiento o en el habla...), estos no son por lo general provocados por la epilepsia, sino que su origen se encuentra en el trastorno cerebral, que a la vez es la causa de las crisis epilépticas.\n\nLa necesidad de superar la enfermedad, rechazos en la escuela, en el trabajo y en diversos grupos sociales, por los prejuicios de sus semejantes debido al desconocimiento de la epilepsia, así como desventajas en el día a día (en el deporte, carné de conducir, diversas solicitudes...) hacen que los pacientes tengan que sufrir a menudo cargas emocionales exageradas en comparación con la realidad de la enfermedad.\n\nPor otro lado, en muchos países se limita el acceso a licencias de conducir, de pilotar o de manejar maquinaria, lo que a veces reduce la posibilidad de elegir un trabajo. Estas prohibiciones no suelen afectar a aquellos pacientes que puedan controlar sus crisis.[43]​\n\n", "subsections": []}, {"name": "Aspectos históricos", "text": "Apenas ninguna otra enfermedad permite remontarse tanto en la historia de la medicina como la epilepsia; existen numerosas referencias desde los primeros tiempos de la historia que constatan que esta enfermedad ha existido desde los orígenes del hombre. Esta enfermedad era considerada como una de las enfermedades crónicas más habituales.\n\nEl concepto de epilepsia se deriva de la palabra griega ἐπιλαμβάνειν, ēpilambáneim (ser agarrado, atacado). Epilepsia es, pues, “ataque” o “enfermedad que se manifiesta por medio de ataques (crisis)”. Dado que hay diferentes enfermedades que producen crisis, es mejor hablar de epilepsias.\n\nEn antiguos textos mesopotámicos se describen ya sus síntomas típicos como la enfermedad de Bennu, o Sitbu, aunque estos términos para algunos autores parecen designar también “contagio” o “lepra”.[44]​ Se comprueba también que no era infrecuente: en el código de Hammurabi, cuerpo legislativo de la Babilonia del siglo XVII a. C., se establece que, si se descubre que un esclavo adquirido recientemente sufre Bennu, este puede ser devuelto a su anterior propietario en el plazo de un mes.\n\nEl cuerpo de quien padece una crisis epiléptica parece no obedecer a su dueño, sino a voluntad ajena. De ahí que se relacionara con la deidad. Los seguidores de la religión tibetana Bön tenían por elegidos a quienes la padecían, mientras que en la antigüedad judeocristiana se consideraba su padecimiento como un castigo divino o como obra de demonios.\n\nEn el Evangelio de Marcos (9, 17-18) se incluye una descripción de la época que ilustra a la perfección una crisis epiléptica sufrida desde la infancia, donde dice que al no poder echar al espíritu causante de la crisis, sus discípulos se lo llevaron a Jesús, el cual pudo hacerlo y el poseído quedó como muerto para luego hacerlo levantar. En el mismo capítulo se menciona otra persona que expulsaba espíritus en su nombre:[45]​\n\nPero no tardó en cuestionarse el origen preternatural de la epilepsia. En el siglo V a. C., Hipócrates observó en soldados y gladiadores que las heridas por traumatismo craneoencefálico se asociaban con cierta frecuencia a ataques epilépticos, desconcertantemente similares a los que observaba en sus propios pacientes; y el mismísimo Julio César sufría esta afección.[46]​\n\nEn la Edad Media se perdió ese legado médico. Se volvió a atribuir a la epilepsia una causa sobrenatural. Los enfermos y sus familiares rezaban, implorando ayuda, a la Virgen María y a San Valentín, en particular. De hecho, en algunos países se conocía la epilepsia como “mal de San Valentín”.[47]​\n\nDebido al estigma bíblico, se la llamó morbus sacer (enfermedad sagrada), y se dividió por mucho tiempo en grand mal y petit mal. El primero hacía referencia a las convulsiones caracterizadas por inconsciencia, el paciente se caía al suelo y en algunos casos se contorsionaba, apretaba los dientes y emanaba espuma de la boca. El petit mal se caracteriza por un efímero momento de inconsciencia: a menudo quienes rodean al paciente no se percatan del ataque.\n\n", "subsections": []}, {"name": "La epilepsia en la literatura, en la televisión y en la música", "text": "La literatura ha ofrecido una perspectiva amplia sobre enfermedades mentales y neurológicas como la paranoia, la neurosis, la histeria y la epilepsia, que puede apreciarse en la representación y significación de numerosas obras como Otra vuelta de tuerca por Henry James, La corazonada de una suerte de Fiódor Dostoyevski, así como obras de León Tolstói, Hermann Hesse, Edgar Allan Poe y María de Jorge Isaacs que narra la historia de la enfermedad hereditaria epiléptica de María, la protagonista de la historia. Por ejemplo, Dostoyevski, paciente a su vez de epilepsia, reflejó los síntomas de esta enfermedad en personajes de sus obras, como La patrona, Humillados y ofendidos, El idiota, Los demonios, Diario de un escritor y Los hermanos Karamázov.[50]​ En cuanto a Otra vuelta de tuerca de Henry James, se ha descrito que las visiones de uno de sus personajes coinciden con el resultado de una epilepsia focal temporal.[51]​\n\nEl reflejo de la enfermedad en la literatura aúna dimensiones simbólicas, etiológicas y diagnósticas, entre otros. Desde obras que se basan en prejuicios y clichés, que dificultan aún más la vida de los enfermos, a descripciones llenas de comprensión, alguna de las cuales transmiten fenómenos asociados a las crisis como las percepciones extraordinarias (por ejemplo, La corazonada de una suerte), o algunos tipos de alucinaciones.[52]​[53]​\n\nLa preocupación literaria por la epilepsia tiene un significado cada vez mayor como fenómeno médico y puede estimular al médico, estudiante de medicina y personal sanitario de una manera más completa en su relación con los enfermos de epilepsia. De esta manera, se presume que el impacto de la literatura que describe esta dolencia, como otras, ayuda en la formación del personal sanitario en cuanto al trato con los pacientes, contribuyendo a la buena práctica médica y a la ética, en definitiva diversificando la formación sanitaria.[53]​\n\n", "subsections": []}, {"name": "Personalidades célebres con epilepsia", "text": "", "subsections": [{"name": "Especulación sobre personajes históricos", "text": "Las posteriores biografías de personajes históricos como Napoleón, Julio César, Sócrates e incluso Juana de Arco especulan con la posibilidad de que estuvieran afectados por epilepsia según los datos que existen, aunque nunca fueron diagnosticados como tal mientras vivían.[54]​[55]​[56]​[57]​[58]​[59]​[60]​[61]​\n\n"}, {"name": "Músicos famosos con epilepsia", "text": "Ian Curtis, líder y cantante del grupo inglés Joy Division, fue uno de los casos más famosos de personas con epilepsia dentro de la historia de la música rock, el cual sufría de ataques epilépticos en mitad de sus conciertos.[62]​\n\nSus compañeros de banda tuvieron que llevarlo al hospital más cercano para diagnosticarle su enfermedad, ya que el propio Curtis era reacio a acudir por su propio pie a cualquier centro de salud tras padecer sus ataques epilépticos, ya que no quería sentirse una carga para su banda.[63]​\n\n"}, {"name": "Famosos de la televisión con epilepsia", "text": "El actor Cameron Boyce sufrió a la edad de 20 años una muerte súbita inesperada por epilepsia por medio de una convulsión el 6 de julio de 2019. Desde hacía un tiempo presentaba síntomas de epilepsia. Fue llevado al hospital, pero resultó demasiado tarde, pues Cameron ya había fallecido.[64]​[65]​\n\n"}]}, {"name": "Protocolo de actuación ante crisis epilépticas", "text": "\n\nBusca fuentes: «Epilepsia» – noticias · libros · académico · imágenes\nEn caso de presenciar una crisis epiléptica, es importante tener las siguientes consideraciones:\n\nMantenga la calma e intente que las restantes personas presentes se mantengan calmadas.\nNo mover al paciente del sitio. Solo si no está en el suelo, puede considerar recostar a la persona en el piso solo si es viable hacerlo sin provocar lesiones a la persona o a usted mismo, no lo haga si tiene dudas.\nRetire del área alrededor de la persona los objetos (especialmente los duros o filosos) con los que pudiera golpearse.\nCon cuidado, ponga la cabeza de la persona sobre algo suave y plano, como una chaqueta doblada.\nSi tiene gafas o anteojos, quíteselos con cuidado.\nSuéltele la corbata o cualquier cosa que tenga alrededor del cuello que pueda dificultar su respiración.\nControle el tiempo que dure la convulsión. Llame al teléfono de emergencia (112 en la Unión Europea y varios países de América del Sur, 911 en América del Norte, América Central y varios países de América del Sur,...) si la convulsión dura más de 5 minutos, al poder ser status epilepticus, que puede ser muy peligroso.\nNunca haga nada de lo siguiente:\n\nNunca trate de sujetar a la persona o evitar que se mueva.\nNunca ponga nada en la boca de la persona porque podría lesionarle los dientes o la mandíbula. Una persona con convulsiones no se atragantará con su lengua.\nNunca intente respiración boca a boca o reanimación respiratoria durante una crisis. Generalmente las personas comienzan a respirar de nuevo tras la crisis.\nNo le ofrezca agua a la persona hasta que esté recuperada. No ofrezca alimentos.\nFinalizada la crisis epiléptica, la persona sufrirá un aturdimiento post-crisis con una progresiva recuperación hasta lograr la consciencia plena (el nivel de consciencia real de la persona puede ser menor del percibido externamente) a lo largo de un periodo variable entre pocos minutos y varias horas, durante el cual la persona no debería permanecer sin compañía fiable. Debido a ello, por favor acompañe o asegúrese que alguien acompaña a la persona hasta su domicilio o hasta la llegada de un amigo, familiar o conocido que se encargue de acompañarlo a casa. Tras la crisis epiléptica puede ayudar a la persona para que voluntariamente se mueva unos metros hasta un lugar más seguro y tranquilo donde recuperarse.\n\nSolo en casos puntuales es necesario llamar a urgencias:\n\nSi es una mujer embarazada.\nSi existe un traumatismo importante.\nSi tiene varias crisis y entre una y otra no recupera la conciencia o si una crisis dura más de 5 minutos; ambos casos serían un status epilepticus, que puede ser muy peligroso.\nEn la fase tónica de una crisis no se respira debido a una contracción de todos los músculos del cuerpo. El oxígeno que hay en el cuerpo va a los órganos vitales; por ese motivo los labios y orejas pueden presentar cianosis. Esto no es peligroso, siempre que no sea el mencionado status epilepticus.\n\n", "subsections": []}, {"name": "Otros datos", "text": "El 16 de diciembre de 1997 en Japón, 685 niños fueron hospitalizados debido a que fueron víctimas de ataques epilépticos por haber presenciado el episodio de Pokémon Dennō Senshi Porygon (episodio n.° 38 de la primera temporada en la versión original de la serie). Se descubrió que el cambio rápido entre los colores rojo y azul en una escena había provocado las convulsiones.[66]​[67]​\n\n", "subsections": []}, {"name": "Concienciación y apoyo social", "text": "En España, el Día Nacional de la Epilepsia se celebra (a partir del 2006) el 24 de mayo.[68]​\n\nEn el mundo, desde 2015, se ha instaurado el segundo lunes de febrero como el Día Internacional de la Epilepsia, gracias a un trabajo conjunto de la Liga Internacional contra la Epilepsia (ILAE) y el Buró Internacional para la Epilepsia (IBE).[69]​[70]​\n\n", "subsections": []}, {"name": "Véase también", "text": "Enfermedad de Lafora\nEpilepsia fotosensitiva\nSíndrome de Landau-Kleffner\nSíndrome de Lennox Gastaut\nTrastornos neurológicos relacionados con el gluten\nPerro de asistencia para personas epilépticas\nEpilepsia del lóbulo temporal\n", "subsections": []}, {"name": "Referencias", "text": "↑ International League Against Epilepsy. «Glossary of descriptive terminology for ictal semiology» (en inglés). Archivado desde el original el 18 de febrero de 2009. Consultado el 23 de julio de 2009. «a) Epileptic Disorder: A chronic neurological condition characterised by recurrent epileptic seizures.\nb) Epilepsies: Those conditions involving chronic recurrent epileptic seizures that can be considered epileptic disorders.» \n\n↑ Epilepsia, la “enfermedad sagrada”, diario Página|12. Consultado el 2 de febrero de 2011.\n\n↑ «Epilepsia en perros». Vet Mex 39 (3): 279-321. 2008. Archivado desde el original el 9 de diciembre de 2011. Consultado el 4 de marzo de 2010. \n\n↑ Harrison Principios de Medicina Interna 16a edición (2006). «Capítulo 363. Convulsiones y epilepsia». Harrison online en español. McGraw-Hill. Archivado desde el original el 19 de junio de 2009. Consultado el 22 de julio de 2009. \n\n↑ «Nombres de la Epilepsia a lo largo de la Historia - Academia Nacional de Medicina de Colombia». 10 de noviembre de 2022. Consultado el 6 de junio de 2023. \n\n↑ Perucca P (2017). «Real-world utility of whole exome sequencing with targeted gene analysis for focal epilepsy.». Epilepsy Res. Consultado el Marzo de 2017. \n\n↑ Tumienė (2019). «Diagnostic exome sequencing of syndromic epilepsy patients in clinical practice.». Clin Genet. Consultado el Mayo de 2018. \n\n↑ Error en la cita: Etiqueta <ref> no válida; no se ha definido el contenido de las referencias llamadas Peng\n↑ Laura Ortega-Moreno (2017). «Molecular diagnosis of patients with epilepsy and developmental delay using a customized panel of epilepsy genes.». PLoS One. Consultado el Noviembre de 2017. \n\n↑ Uzcati Vielma, Antonio José; Morela Rojas, Carmen; Martínez, Carmen et al. Hallazgos electroencefalográficos en niños con trastornos del aprendizaje Archivado el 1 de noviembre de 2013 en Wayback Machine. (en español). Arch Venez Puer Ped. [en línea]. mar. 2009, vol.72, no.1 [citado 4 de marzo de 2010], p.13-19. ISSN 0004-0649.\n\n↑ Ropper, Allan H; Brown, Robert H. «Epilepsia y otros trastornos convulsivos».  En Marco Antonio Tovar Sosa, ed. Principios de Neurología de Adams y Victor. México: McGraw-Hill Interamericana. p. 999. ISBN 970-10-5707-4.  |fechaacceso= requiere |url= (ayuda)\n\n↑ a b  Roger J, Medina MT, Genton P, Dravet C, Bureau M. «Avances en la clasificación de las epilepsias y los síndromes epilépticos». Consultado el 22 de enero de 2011. \n\n↑ The Epilepsy Foundation of America. «La Genética y la Epilepsia». Consultado el 14 de mayo de 2010. \n\n↑ Valdivia Álvarez I, Aguilar Fabré L y Caraballo Pupo M (2006). «Epilepsia de ausencia de inicio precoz: a propósito de un caso». Archivado desde el original el 3 de mayo de 2010. Consultado el 22 de enero de 2011. \n\n↑  Sheffer, Ingrid (2008). «Epilepsy Female with/without Mental Retardation». OxforJournals. \n\n↑  Nariño González D, Grillo Ardila M (2005). «Epilepsia catamenial». Acta Neurológica Colombiana. \n\n↑ Nobili, Lino; Proserpio, Paola; Combi, Romina; Provini, Federica; Plazzi, Giuseppe; Bisulli, Francesca; Tassi, Laura; Tinuper, Paolo (2014-02). «Nocturnal frontal lobe epilepsy». Current Neurology and Neuroscience Reports 14 (2): 424. ISSN 1534-6293. PMID 24395520. doi:10.1007/s11910-013-0424-6. Consultado el 25 de marzo de 2024. \n\n↑ Asioli, Gian Maria; Rossi, Simone; Bisulli, Francesca; Licchetta, Laura; Tinuper, Paolo; Provini, Federica (30 de enero de 2020). «Therapy in Sleep-Related Hypermotor Epilepsy (SHE)». Current Treatment Options in Neurology 22 (1): 1. ISSN 1092-8480. PMID 31997091. doi:10.1007/s11940-020-0610-1. Consultado el 25 de marzo de 2024. \n\n↑ Oldani, Alessandro; Manconi, Mauro; Zucconi, Marco; Martinelli, Cristina; Ferini-Strambi, Luigi (2006-12). «Topiramate treatment for nocturnal frontal lobe epilepsy». Seizure 15 (8): 649-652. ISSN 1059-1311. PMID 16973383. doi:10.1016/j.seizure.2006.07.002. Consultado el 25 de marzo de 2024. \n\n↑ Tavares S, Almeida, RM, Figueiroa SM, Temudo T (2005). «Epilepsia rolándica. Análisis de las características clínicas, electrofisiológicas, tratamiento y pronóstico en 87 pacientes». Neurol 41 (6). Archivado desde el original el 9 de diciembre de 2011. \n\n↑ Fundación Síndrome de West. «Síndrome de Rasmussen». Archivado desde el original el 6 de marzo de 2012. Consultado el 22 de enero de 2011. \n\n↑  Ruggieri, VL. «Epilepsias de comienzo en la lactancia y la infancia temprana». Neurology 39 (3). ISSN 251 251-262 251 |issn= incorrecto (ayuda). Archivado desde el original el 16 de febrero de 2009. \n\n↑  Pozo Alonso AJ, Pozo Lauzán D, Pozo Alonso D (2003). «A propósito del síndrome de Ohtahara». Revista Cubana de Pediatría 75 (4). ISSN 0034-7531. \n\n↑  «Síndrome de de West». Consultado el 22 de enero de 2011. \n\n↑ Lundin KE, Wijmenga C (Sep 2015). «Coeliac disease and autoimmune disease-genetic overlap and screening». Nat Rev Gastroenterol Hepatol 12 (9): 507-15. PMID 26303674. doi:10.1038/nrgastro.2015.136. \n\n↑ Ciccocioppo R, Kruzliak P, Cangemi GC, Pohanka M, Betti E, Lauret E, Rodrigo L (22 de octubre de 2015). «The Spectrum of Differences between Childhood and Adulthood Celiac Disease». Nutrients 7 (10): 8733-51. PMID 26506381. doi:10.3390/nu7105426. \n\n↑ a b San Mauro I, Garicano E, Collado L, Ciudad MJ (Dec 2014). «Is gluten the great etiopathogenic agent of disease in the XXI century». Nutr Hosp 30 (6): 1203-10. PMID 25433099. doi:10.3305/nh.2014.30.6.7866. \n\n↑ a b c Jackson JR, Eaton WW, Cascella NG, Fasano A, Kelly DL (Mar 2012). «Neurologic and psychiatric manifestations of celiac disease and gluten sensitivity». Psychiatr Q 83 (1): 91-102. PMC 3641836. PMID 21877216. doi:10.1007/s11126-011-9186-y. \n\n↑ a b Lionetti E, Francavilla R, Pavone P, Pavone L, Francavilla T, Pulvirenti A, Giugno R, Ruggieri M (2010 Aug). «The neurology of coeliac disease in childhood: what is the evidence? A systematic review and meta-analysis». Dev Med Child Neurol 52 (8): 700-7. PMID 20345955. doi:10.1111/j.1469-8749.2010.03647.x. \n\n↑ «1 Guidance | Epilepsies: diagnosis and management | Guidance | NICE». www.nice.org.uk. Consultado el 1 de febrero de 2022. \n\n↑ Chen, Wei-Liang; Mefford, Heather C. (2021-07). «Diagnostic Considerations in the Epilepsies—Testing Strategies, Test Type Advantages, and Limitations». Neurotherapeutics (en inglés) 18 (3): 1468-1477. ISSN 1933-7213. PMID 34532824. doi:10.1007/s13311-021-01121-7. Consultado el 1 de febrero de 2022. \n\n↑ Aledo-Serrano, Angel; Sánchez-Alcudia, Rocío; Toledano, Rafael; García-Morales, Irene; Beltrán-Corbellini, Álvaro; del Pino, Isabel; Gil-Nagel, Antonio (2021). «Developmental and epileptic encephalopathies after negative or inconclusive genetic testing: what is next?». Journal of Translational Genetics and Genomics. doi:10.20517/jtgg.2021.40. Consultado el 1 de febrero de 2022. \n\n↑ Villarejo Ortega, Francisco (1998). Tratamiento de la epilepsia. Ediciones Díaz de Santos. p. 113. ISBN 8479783257. \n\n↑ Vaquero Crespo, Jesús (2006). Patología quirúrgica del sistema nervioso. Editorial Ramón Areces. p. 410. ISBN 8480047100. \n\n↑ a b Orsatti, Luciano (2004). Deporte para discapacitados mentales (2.ª edición). Editorial Stadium S.R.L. p. 10. ISBN 9505312067. Archivado desde el original el 3 de febrero de 2014. Consultado el 29 de julio de 2009. \n\n↑ a b Carlos Eduardo Navarro Restrepo, Hermann Scholtz González (2006). «Epilepsia». Neurocirugía para médicos generales (1.ª edición). Universidad de Antioquia. pp. 442-444. ISBN 958-655-875-4. Consultado el 29 de enero de 2011. \n\n↑ «III Congreso Nacional de la Asociación Española de Psiquiatría Privada». Archivado desde el original el 19 de septiembre de 2010. \n\n↑ Felton EA, Cervenka MC (2015 Sep). «Dietary therapy is the best option for refractory nonsurgical epilepsy». Epilepsia 56 (9): 1325-9. PMID 26198999. doi:10.1111/epi.13075. \n\n↑ Vaccarezza MM, Silva WH (2015 Sep). «Dietary therapy is not the best option for refractory nonsurgical epilepsy». Epilepsia9 56 (9): 1330-4. PMID 26198854. doi:10.1111/epi.13074. \n\n↑ Caprara, Ana Letícia F.; Rissardo, Jamir P.; Leite, Martim T.B.; Silveira, Juliana O.F.; Jauris, Paulo G.M.; Arend, Josi; Kegler, Aline; Royes, Luiz Fernando Freire et al. (2020-04). «Course and prognosis of adult-onset epilepsy in Brazil: A cohort study». Epilepsy & Behavior 105: 106969. ISSN 1525-5050. doi:10.1016/j.yebeh.2020.106969. Consultado el 26 de octubre de 2021.  Se sugiere usar |número-autores= (ayuda)\n\n↑ Hamandi K, Routley BC, Koelewijn L, Singh KD (2015 Nov 28). «Non-invasive brain mapping in epilepsy: Applications from magnetoencephalography». J Neurosci Methods. pii: S0165-0270 (15): 00414-8. PMID 26642968. doi:10.1016/j.jneumeth.2015.11.012. \n\n↑ Consensus guidelines: preconception counseling, management, and care of the pregnant woman with epilepsy.\n\n↑ Girona, Carmen (2006). «Conducir con epilepsia». El País. \n\n↑ Mejía Rivera, Orlando (1999). Introducción crítica a la historia de la Medicina: de la prehistoria a la medicina egipcia (1.ª edición). p. 323. ISBN 958-8041-19-8. \n\n↑ «Evangelio de Marcos». Archivado desde el original el 12 de agosto de 2011. Consultado el 24 de enero de 2011. \n\n↑  Dam Gram, Lennart Gram, Mogens Dam (1995). Epilepsia. Ed Med Panamericana. p. 206.  Galeno (130-200 d. C.) llegaría a la misma conclusión que Hipócrates. Ledesma, Juan Antonio (2009). La imagen social de las personas con discapacidad (2.ª edición). CINCA. p. 159. ISBN 978-84-96889-32-3. Consultado el 14 de enero de 2011. \n\n↑  Federico Micheli. Tratado de neurología clínica. p. 780. Consultado el 14 de enero de 2011.  \n\n↑ «Fyodor Dostoevsky». Charge - The experience of Epilepsy. Consultado el 2 de febrero de 2006. \n\n↑ Hughes JR (2005). «The idiosyncratic aspects of the epilepsy of Fyodor Dostoevsky». Epilepsy & Behavior 7 (3): 531-8. PMID 16194626. doi:10.1016/j.yebeh.2005.07.021. \n\n↑ Iván Iniesta López (2006) Enfermedad en la literatura de Dostoyevski, tesis\n\n↑ Manford M, Anderman F. Complex visual hallucinations:Clinical and neurobiological insights. Brain 1998;121:1819-40.\n\n↑ Dostojevski Cristina de Martos, artículo periodístico en El Mundo.\n\n↑ a b Rita Charon; Joanne Trautmann Banks; Julia E. Connelly; Anne Hunsaker Hawkins; Kathryn Montgomery Hunter; Anne Hudson Jones; Martha Montello;y Suzanne Poirer Literature and Medicine: Contributions to Clinical Practice Annals of Internal Medicine. 15 de abril de 1995. Volumen 122, número 8. Páginas 599-606\n\n↑ Muramoto O, Englert W (2006). «Socrates and temporal lobe epilepsy: a pathographic diagnosis 2,400 years later.». Epilepsia 47 (3): 652-4. PMID 16529635. doi:10.1111/j.1528-1167.2006.00481.x. \n\n↑ Hughes J (2004). «Dictator Perpetuus: Julius Caesar--did he have seizures? If so, what was the etiology?». Epilepsy Behav 5 (5): 756-64. PMID 15380131. doi:10.1016/j.yebeh.2004.05.006. \n\n↑ Gomez J, Kotler J, Long J (1995). «Was Julius Caesar's epilepsy due to a brain tumor?». The Journal of the Florida Medical Association 82 (3): 199-201. PMID 7738524. \n\n↑ H. Schneble (1 de enero de 2003). «Gaius Julius Caesar». German Epilepsy Museum. Consultado el 10 de agosto de 2006. \n\n↑ Osler W (1903). «On the so-called Stokes-Adams disease (slow pulse with syncopal attacks, &c.)». The Lancet 2: 516-524. doi:10.1016/S0140-6736(00)66180-9. \n\n↑ Hughes J (2003). «Emperor Napoleon Bonaparte: did he have seizures? Psychogenic or epileptic or both?». Epilepsy Behav 4 (6): 793-6. PMID 14698723. doi:10.1016/j.yebeh.2003.09.005. \n\n↑ Foote-Smith E, Bayne L (1991). «Joan of Arc.». Epilepsia 32 (6): 810-5. PMID 1743152. doi:10.1111/j.1528-1157.1991.tb05537.x. \n\n↑ d'Orsi G, Tinuper P (2006). «\"I heard voices...\": From semiology, a historical review, and a new hypothesis on the presumed epilepsy of Joan of Arc.». Epilepsy & Behavior 9 (1): 152-7. PMID 16750938. doi:10.1016/j.yebeh.2006.04.020. \n\n↑ «Peter Hook Recalls Ian Curtis’s Epilepsy Struggles» (en inglés). Epilepsyresearch.org.uk. 14 de junio de 2011. Archivado desde el original el 3 de diciembre de 2013. Consultado el 28 de enero de 2014. «The bassist added that a gig in Birmingham Curtis was unable to complete because of his epilepsy \"destroyed\" him, although the group had achieved everything he had wanted it to». \n\n↑ Hook, Peter (2012). Unknown Pleasures:Inside Joy Division (en inglés). Simon & Schuster. p. 210. ISBN 978-0-85720-215-4. «He shook his head: he understood me all right but he didn’t want to go to the hospital. Never did; didn’t want to be a bother». .\n\n↑ «Muerte de Cameron Boyce: qué es la muerte súbita e inesperada en la epilepsia (SUDEP) que causó el fallecimiento del joven actor». BBC Mundo. 11 de julio de 2019. Consultado el 15 de mayo de 2023. \n\n↑ «Ya es oficial, la autopsia confirma que Cameron Boyce murió de un ataque epiléptico». El País. 31 de julio de 2019. Consultado el 15 de mayo de 2023. \n\n↑  «Pokemon packs a punch» (en inglés). Consultado el 7 de enero de 2007.  \n\n↑  ScienceDaily. «Color Changes in TV Cartoons Cause Seizures» (en inglés). Archivado desde el original el 8 de noviembre de 2004. Consultado el 8 de agosto de 2008. \n\n↑ Sociedad Española de Neurología. «Día nacional de la Epilepsia». Consultado el 23 de julio de 2009. \n\n↑ Liga Chilena contra la Epilepsia. «Día Internacional contra la Epilepsia». Consultado el 29 de noviembre de 2015. \n\n↑ «Día Internacional contra la Epilepsia». Consultado el 10 de febrero de 2019. \n\n29. Iniesta López, Iván. La enfermedad en la literatura de Dostoievski. Tesis doctoral, año 2004. ISBN 84-669-2606-2 http://eprints.ucm.es/tesis/med/ucm-t27773.pdf Archivado el 14 de abril de 2010 en Wayback Machine.\n\n", "subsections": []}, {"name": "Enlaces externos", "text": " Wikcionario  tiene definiciones y otra información sobre epilepsia.\n Wikimedia Commons alberga una categoría multimedia sobre Epilepsia.\nInformación sobre la epilepsia.\nTodo sobre epilepsia. Archivado el 3 de julio de 2017 en Wayback Machine.\nAsociación Andaluza de Epilepsia (APICE).\nCentros Para el Control y la Prevención de Enfermedades.", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Estereotipos", "title": "Estereotipo", "summary": "\nPor favor, edítalo y/o discute los problemas en la discusión para mejorarlo:\nNo tiene una redacción neutral. Por favor, modifica los párrafos o secciones que muestran un punto de vista parcial en concordancia con lo esperado en una enciclopedia.\nNecesita ser wikificado conforme a las convenciones de estilo de Wikipedia.\nSe conoce con el nombre de  estereotipo (del griego: στερεός [stereós], «sólido», y τύπος [typos], «impresión, molde»)[1]​  a la percepción o creencias generalizadas, que se tiene sobre un determinado grupo o categoría de personas.[2]​[3]​ Regularmente los estereotipos son una preconcepción generalizada que obedece a un conjunto de creencias sobre cualidades y atributos que se  adjudican a un grupo de personas, en donde se ven mezclados en elementos culturales, sociales y económicos que resultan en la representación rígida y falsa o inexacta de la realidad.[4]​\n\nEl término se usa a menudo en un sentido negativo, al considerarse que los estereotipos son creencias ilógicas pero algunas personas le dan la importancia que se les transmite por generación haciendo que limiten la creatividad y que sólo se pueden cambiar mediante el razonamiento personal sobre ese tema.[5]​ Los estereotipos incluyen una amplia variedad de alegaciones sobre diversos grupos raciales y predicciones de comportamiento basadas en el estatus social o la riqueza. Son esquemas de pensamiento o esquemas lingüísticos preconstruidos que comparten los individuos de una misma comunidad social o cultural.[6]​\n\nExiste una tripartición que nos permite entender cómo funcionan los estereotipos en las sociedades. Por un lado existe un componente cognitivo que nos permite reconocer un estereotipo porque encuadra con conocimientos previos que ya tenemos sobre el mismo, es una categoría que nos permite identificar y reconocer fácilmente a ciertos grupos. Por otro lado también existe un componente afectivo, donde entran en juego los sentimientos que experimentamos en relación con ese estereotipo, que pueden ser de prejuicio u hostilidad, o bien, ser positivos. Finalmente en todo estereotipo hay un componente comportamental que supone llevar a la práctica acciones asociadas a esos sentimientos experimentados frente a ciertos estereotipos. Por ejemplo, cuando se le niega un trabajo a alguien por pertenecer a un grupo determinado. Estos tres componentes no necesariamente aparecen todos juntos, uno puede asociar a unos grupos características negativas sin sentir hostilidad o reticencia hacia el mismo y sin excluirlos de ámbitos sociales como el trabajo.\n\nRepresentar a alguien con ciertas características remite a un estereotipo, manifestar desprecio u hostilidad por su grupo de pertenencia se relaciona con un prejuicio, y finalmente llevar adelante acciones sobre la base de esos prejuicios supone una discriminación.[7]​\n\n", "sections": [{"name": "Uso común", "text": "Están constituidos por opiniones preconcebidas, prejuicios, actitudes, vivencias y creencias impuestas por el medio social y cultural; que se aplican de forma generalizada a todas las personas pertenecientes a una categoría, nacionalidad, etnia, edad, género, orientación sexual, religión, ideología, procedencia geográfica, etcétera.[8]​\n\nEn la literatura y el arte, los estereotipos son clichés, personajes o situaciones predecibles. Por ejemplo, un diablo estereotipo es malvado, con cuernos, cola, y tridente.\n\nOriginalmente un estereotipo era una impresión tomada de un molde de plomo que se utilizaba en imprenta en lugar del tipo original. Este uso desembocó en una metáfora sobre un conjunto de ideas preestablecidas que se podían llevar de un lugar a otro sin cambios (al igual que era posible con el tipo portable).\n\nEn la ética y valores humanos se usan estereotipos que ayudan y contribuyen a la forma de representar los problemas que se presentan en la sociedad diaria y continuamente en todo el mundo.\n\n", "subsections": []}, {"name": "En medios de comunicación", "text": "Los medios de comunicación cumplen un rol fundamental en la construcción y la reproducción de estereotipos. A partir de las imágenes e ideas que circulan en los medios, el público accede a ciertos estereotipos que reproducen y construyen en su entorno. Formatos como, la publicidad y los programas dirigidos al público infantil usan los estereotipos, ya que los mismos permiten un mensaje eficaz, pues son rápidamente identificados y reconocidos. Tal y como señalan Ruth Amossy y Anne Herschberg Pierrot, «La visión que nos hacemos de un grupo es el resultado de un contacto repetido con representaciones enteramente construidas o bien filtradas por el discurso de los medios. El estereotipo sería principalmente resultado de un aprendizaje social».[9]​ Incluso lo que percibimos en la cotidianidad (y no solamente a través de los medios) también se vale de conocimiento e ideas previas, y por tanto, no se es totalmente objetivo, sino que el pensamiento está moldeado por la cultura a la que pertenecemos y desde la que percibimos la realidad.\n\nEs muy común ver estereotipos relacionados directamente con las clases sociales, en donde, en televisión, cine y publicidad, es constante ver imaginarios mundos perfectos, donde ocurren situaciones de típicas comedias americanas, con protagonistas que poseen perfiles euro centristas, además de plasmar una extrema riqueza y modernidad en su entorno[10]​. Cosas que se repiten una y otra vez.\n\nUn ejemplo de esto sería la serie de Amazon de brutas nada, en donde se presenta a Cristina, (Tessa Ia) una joven publicista exitosa y adinerada que se enfrenta a grandes problemas cómo el perder patrocinios, rivalidades y el engaño de su prometido un día antes de su boda. Grabada en las zonas más exclusivas de la Ciudad de México, “De brutas nada”, es el claro ejemplo de series que se hacen en México y  lo más mexicano de la serie es la ficticia empresa de publicidad \"limón con chile”. Además suponen un imaginario sobre la vida social y la vida laboral de un profesionista en México.[11]​\n\n", "subsections": [{"name": "Definición y evolución de su significado", "text": "La palabra estereotipo, formada por los vocablos griegos stereós (sólidos) y typos (carácter, tipo o modelo), es un neologismo creado en el siglo XVIII en el ámbito de la tipografía para designar un conjunto de tipos sólidos o fijos. En concreto apareció en Francia en 1796 —steréotype—, traducida como estereotipo que se usa como adjetivo y sustantivo para describir el molde sólido o algo impreso con el procedimiento de los tipos fijos. La expansión de la palabra fue pareja a la rápida difusión de la técnica y surgieron equivalentes, casi idénticos, en la gran mayoría de lenguas modernas. En España se usa el término «estereotipo» para el objetivo y «estereotipa» para el proceso. El último término evoluciona a «estereotipia», el cual fue reconocido por la Real Academia Española en 1843.\n\nEl significado original y sus derivados fueron extendiéndose a un concepto cada vez más figurativo. Por tanto, apareció una nueva acepción que supone un puente entre su origen tipográfico y su significado actual dentro de las ciencias sociales; tal acepción se refiere a cualquier cosa que se repita sistemáticamente, sin variación. En resumen, los términos referidos a la estereotipia se refieren en principio a las impresiones salidas de un molde y poco a poco van siendo aplicadas a todo lo que parece salido de un molde, ya hecho, invariable.[12]​\n\nOtras definiciones se refieren a estereotipo como una imagen o idea aceptada comúnmente por un grupo o sociedad con carácter inmutable[1]​ y una imagen convencional o una idea preconcebida que no tiene una base racional. Se trata de una concepción popular sobre un grupo de personas y constituye una forma de categorizar grupos de gentes de acuerdo con sus apariencias, comportamientos y costumbres.[13]​\n\nCon los estereotipos no suele cumplirse la ley de causa y efecto, más bien suele suceder a la inversa. Además, normalmente parecen seguir una lógica, pero cuando se analizan se descubre que son irracionales e inverosímiles. La imagen creada suele ser una manera de emitir un juicio de valor acerca de un grupo, normalmente basados en raza, profesión o sexo.[13]​\n\nEs frecuente atribuir la creación de estos estereotipos a la sociedad, pero realmente los medios de comunicación son grandes vehículos para difundirlos. En cierto modo, los medios de comunicación refuerzan las opiniones generales haciendo uso de la exposición y reiteración de ideas coexistentes. Los estereotipos tienen cierta conexión con las condiciones sociales, esto les suma fuerza. Al poder localizar en ellos un grano de verdad, su divulgación se hace efectiva. A pesar de que no todos aceptan los estereotipos como verdad, acostumbran a estar aprobados por grandes colectivos. El estereotipo es verdadero y falso al mismo tiempo y está basado en los prejuicios de un grupo hacia otro.\n\nEl discurso publicitario es una fuente inagotable de estereotipos. Los mensajes publicitarios usan estereotipos icónicos para instalarnos en un universo onírico al que accederemos, por supuesto, tras la adquisición del producto anunciado.[14]​\n\n"}, {"name": "Estereotipos en la literatura infantil", "text": "El primer relato que se conoce cuenta la historia de dos hermanos, Anup y Bata, en un papiro de hace unos 3250 años. Según un estudio de Kurt Ranke el relato ha sufrido más de 700 versiones distintas. La mitología griega es la gran portadora de personajes y leyendas que, evolucionadas a través de los siglos y bajo la influencia de las distintas culturas y tradiciones, son el origen de muchos de los cuentos que hoy conocemos. En España el origen del cuento está influenciado por la cultura árabe, que introdujo gran cantidad de relatos, los cuales fueron recopilados por Don Juan Manuel, regente de Castilla, en su obra El conde Lucanor o libro de los ejemplos. En la obra encontramos una característica propia de estos relatos, la moraleja que servía para dar una respuesta moral a las dudas que se iban planteando.\n\nEl cuento infantil, independientemente de la época, lleva implícito en sus personajes estereotipos que reflejan los aspectos culturales de la época de la que provienen. Los personajes son representaciones del bien o del mal como ejemplo para imitar o repudiar, debido a su carácter moralizador. Los valores de los personajes cambian a lo largo del tiempo y se adaptan a las estructuras socioculturales del momento. El héroe y el villano de los cuentos de Charles Perrault o de los Hermanos Grimm poseen cualidades o defectos distintos entre sí, y además, también distan de las cualidades que se consideran hoy en día. La posible interpretación de algunos personajes comunes es la siguiente:\n\nLa bruja: representa la parte regresiva de todo ser humano, el mal que ha de ser destruido y combatido.\nLa madrastra: representa la destrucción dentro de la familia y da cabida a la heroicidad en el niño o la niña desamparado.\nLa princesa: la doncella indefensa que ha de ser protegida y/o rescatada.\nEl lobo: el miedo a la noche y a la oscuridad.\nDurante siglos, en la antigüedad clásica existió la creencia de que había mujeres capaces de transformarse a voluntad y de transformar a otros en animales, se las llamaba brujas y la imagen estereotipada de los cuentos las define como viejas amargadas y malévolas.\n\nLa mayoría de los cuentos maravillosos provienen de relatos antiguos sobre campesinos sometidos al régimen feudal. Los valores sociales de esta época lo constituyen el valor y el respeto por el orden establecido, donde la única mejora para la clase baja se encarna en el joven campesino capaz de superar pruebas y conseguir la mano de la princesa.\n\nEn el siglo XVIII, con la Revolución Industrial, surgen nuevos héroes y villanos más acordes con el hombre de ciudad que ha dejado de lado el campo. Aparecen piratas, pistoleros, bandidos… como nuevos héroes que se enfrentan al orden establecido y el villano pasa a ser un elemento propio del sistema como lo es la sociedad burguesa, las costumbres acomodadas o el ejército.\n\nEl siglo XX, debido a su carácter bélico proporciona nuevos elementos, por ejemplo la influencia americana propone nuevos villanos, personalizados en japoneses y alemanes contra los que el héroe ha de luchar para defender la libertad del mundo.\n\nEl cuento ha evolucionado desde aquellos villanos de antaño a villanos con carácter más cotidiano como puede ser el profesor de colegio o el bullying dentro de las aulas o fuera. El cuento ha pasado a integrarse dentro de la vida real.[15]​[16]​\n\n"}, {"name": "Estereotipos en los medios de comunicación", "text": "En México, país que se caracteriza por su producción de telenovelas desde 1950, donde a través de de historias repetitivas que representaban la realidad de un selecto grupo de mexicanos privilegiados con historias absurdas, vacías y que fueron marcando diferencias sociales desde el inicio de sus transmisiones. Los ricos también lloran (1979), es un claro ejemplo de esto, pues tenía de protagonista a una Verónica Castro de lindos ojos verdes, blanca, ingenua, vulnerable y débil que era rescatada de la pobreza por un Rogelio Guerra varonil, fornido, poderoso y privilegiado, formula que ha sido remasterizada una y otra vez en la televisión mexicana, además de ser un referente estereotípico de la sociedad mexicana.[17]​  \n\nTrancart (1996), en diversos estudios en medios de comunicación franceses (prensa, radio y TV), descubrió que una de cada dos mujeres es citada sin que conste su profesión, mientras que en el caso de los hombres esto solo ocurre en una de cada diez ocasiones. Tal y como dice Martín Serrano (1995), «uno de los esquemas que más se repiten en la televisión es el de las mujeres asociadas con el cuerpo, y los hombres con la cabeza». Así se demuestra en programas televisivos como por ejemplo La Ruleta de la Suerte, en los que la mujer se presenta como un simple objeto de belleza. «Por desgracia y en un gran porcentaje de los casos, cuando la mujer aparece en imágenes, lo hace en muchas ocasiones representado a ciertos estereotipos que han resistido al paso del tiempo y que siguen estando presentes en la mayoría de las sociedades. Así, nos podemos encontrar con la mujer en el papel de seductora, aludiendo a conceptos relacionados con la belleza, el erotismo, y la provocación, o como serpiente tentadora. En definitiva, en el sujeto convertido en objeto».\n\nEn Estados Unidos, The National Federation of Press (Gallagher, 2001) muestra cómo las mujeres han visto incrementar su porcentaje de ocupación de puestos de dirección o de toma de decisiones en solo un 1 % cada año desde 1977. Por su parte, el profesor David Weaver llega a la conclusión de que las periodistas americanas habían conseguido ganancias significativas en materia de control editorial en los últimos tiempos. Se observa también cómo, a pesar de que en las aulas de los colegios y universidades de periodismo en Estados Unidos las mujeres superaban en número a la presencia masculina, —un dato que también se observa en España— seguían teniendo una presencia minoritaria en las salas de prensa y especialmente, en los puestos de dirección.\n\nEn Francia, en Gallagher (2001) se afirma que en el periodismo francés la condición femenina es una restricción para acceder a responsabilidades en el periodismo. Señala que la distancia con respecto a las grandes responsabilidades en este ámbito profesional y a las columnas importantes se traduce en menos probabilidades de encontrase con gente famosa, facilitando en cambio un mayor acceso a personajes más anónimos y reportajes menos brillantes, lo que en resumen produce un periodismo tipificado como femenino. Es decir, que lo que las mujeres escriben no siempre guarda relación con la sensibilidad femenina, sino que en muchas ocasiones no tienen acceso a escribir algo distinto, debido a las estructuras de poder con las que se topan en esta profesión jerarquizada.\n\nEn Reino Unido, en Gallagher (2001) se apunta cómo los hombres que estudian periodismo consiguen más rápidamente un trabajo en los medios que las mujeres. Esto ha llevado a que algunas compañías adopten políticas y programas de acción para equilibrar esta situación, pero puntualiza que esta adopción es más común en radio y televisión que en prensa y que ocurre más a menudo en medios de comunicación públicos que en el sector mediático privado.\n\nEn Sudáfrica, Green (2001) recuerda cómo en un estudio de igualdad laboral realizado una década después de la proclamación del final del apartheid, el número de personas negras que ocupaban cargos de poder en el mundo académico y administrativo solo ascendía a un 10 % del total. Lo sorprendente del estudio era que entre el 90 % restante correspondiente a personas blancas que ostentaban esos puestos de alto escalafón hubiera una ausencia casi total de mujeres blancas en las estructuras de poder y en la universidad. Siete años después del fin del apartheid y bajo la nueva ley de igualdad para con los negros y las mujeres, solo se encuentra con tres mujeres que ocupen el puesto de editoras en periódicos del país, dos de ellas de raza blanca y la otra negra. También destaca que bajo un gobierno con mayoría negra dirigiendo el país, la mayoría de los negocios y profesiones están controladas por manos blancas.\n\nEn Australia, en 1996 se llevó a cabo un estudio que desvelaba que el 23 % de las mujeres periodistas de los medios habían dejado sus trabajos por motivos que tenían que ver con la discriminación que venía sufriendo el género femenino en su promoción laboral. Asimismo, en 1991 The International Federation of Journalism (IFJ) admitió que el 27 % de los periodistas que trabajaban en los medios eran mujeres, en 2001 ya superaban el 38 %, sin embargo este estudio también reconoce diferencias significativas en función del país analizado. Por ejemplo, mientras que en Finlandia y Tailandia estaban cerca del 50 %, en Sri Lanka y Togo las mujeres periodistas no llegaban casi a un 6 % (Peters, 2001).\n\nEn relación con la presencia de la mujer en los distintos medios de comunicación, como es por ejemplo la radio, los locutores están por encima de las mujeres, sobre todo durante la mañana. Según afirma Cramer, las mujeres están prefiriendo trabajar en los telediarios que en los informativos de la radio. En lo que respecta a los medios de comunicación en línea, a pesar de la revolución acontecida en este medio, las grandes multinacionales de la comunicación parecen haber perdido la oportunidad de revolucionar la organización y la cultura de las salas de redacción, sobre todo, por lo que se refiere a la igualdad de género en los puestos directivos que se encargan de manejar estos (Thiel Stern, 2006).\n\nLa mayoría de las entrevistadas no piensan que la escasez de mujeres en los puestos directivos del medio en línea se deba a sexismo o discriminación. Aun así, la insuficiente representación de la mujer es problemático. Los altos cargos son tan pocos y cuesta tanto acceder a ellos que no hay «suficiente pastel para repartir».[18]​\n\n"}, {"name": "Estereotipos en la publicidad", "text": "Los estereotipos en la publicidad son ideas simplificadas de la realidad que han sido aceptadas por la sociedad o por un grupo de personas determinado. No tratan simplemente de vendernos el producto al que hacen referencia, sino que nos venden el éxito social o la competitividad. Muchas veces en un principio pueden resultar forzados o incluso cómicos, pero al final acaban siendo aceptados. El anuncio publicitario debe ser representado con un vocabulario tópico, que refleje los valores y argumentos en que se sustenta el estereotipo de la marca. Así se crearán unos estereotipos definidos que no aparecen con tanta simplicidad en la realidad.\n\nEn definitiva, la publicidad es una de las principales responsables de los estereotipos, ya que a través de muchas estrategias comerciales consiguen establecer modelos de conducta que las personas tratarán de imitar, nos hace creer que si consumimos el producto anunciado conseguiremos obtener las mismas características.\n\nEn el mundo publicitario encontramos diferentes tipos de estereotipos, aunque el principal es el sexo. Este se utiliza para todo tipo de productos e incluso para aquellos que no tienen nada que ver con él. Se trata de un estímulo que el receptor acoge de forma positiva y rápida. El rol de la mujer en la publicidad ha sido altamente estereotipado, representándola siempre como esposa, madre, ama de casa o incluso como mujer objeto. Se muestra la imagen de mujer dependiente y débil, pero, ante todo, bella. De esta forma, la mujer es representada no solo como objeto de deseo del varón, sino, como afirma García Oyarzun (2014), como parte del consumo del objeto publicitado. A pesar de que la objetivación de la mujer sigue siendo abundante en la publicidad, actualmente también empiezan a aparecer ejemplos de la mujer superwoman que no necesita la ayuda del hombre. En el hombre el estereotipo establecido ejerce mayor presión social hacia una imagen que refleje fuerza, agresividad, dominio, valentía, pero sin descuidar tampoco su aspecto físico. A su vez, son mostrados como poco profundos y muy superficiales, esencialmente incompetentes.[19]​[20]​\n\nSin embargo, tanto en el caso de los hombres como en el de las mujeres, uno de valores más explotados es la belleza. Los creativos publicitarios recurren siempre a modelos atractivos para llamar la atención del público y con ello pretenden que el público crea que, al consumir su producto o servicios, su físico será tal y como se muestra en la publicidad y que de esa forma su vida será mejor. En muchos casos, esa necesidad generada de alcanzar el ideal físico mostrado en la publicidad da lugar a trastornos alimenticios (anorexia, bulimia) y otros problemas psicológicos, sobre todo en adolescentes, que son un blanco fácil para este tipo de presiones.\n\nDentro de la publicidad infantil, el estereotipo que más se desarrolla es el de los roles de género, marcando supuestas diferencias entre chicos y chicas. Las niñas suelen ser representadas como obedientes, delicadas y ordenadas, que ayudan a la madre en el hogar asumiendo responsabilidades desde una edad muy temprana. Del mismo modo, todos los juguetes enfocados para las niñas tienen relación con el mundo de la cosmética y el hogar. Por el contrario, los niños suelen mostrarse como inquietos y rebeldes, aunque a su vez son emprendedores. Y de esa forma, los juguetes para niños suelen tener que ver con el mundo de la construcción, el automóvil o incluso campos más agresivos como la guerra. También se suele usar a los niños como gancho para vender productos a los adultos, valiéndose de la simpatía o ternura que producen.[19]​\n\nEn ocasiones la publicidad también fomenta ciertos estereotipos raciales. De esta forma, la mayoría de las veces pueden llegar a subestimar una raza sobre otra, como sucedió en el anuncio de una cadena de comida rápida en Alemania, que indignó a los mexicanos.[21]​ Además, el físico ideal que muestra la publicidad tiene también ciertos componentes raciales. Esto sucede porque, por norma general, los modelos utilizados no solo comparten entre sí su delgadez y belleza, sino que suelen ser personas con rasgos caucásicos, piel blanca y, muchas veces, pelo rubio y ojos claros. Esto ayuda a fomentar la idea de que hay una raza más perfecta o superior que el resto.[19]​\n\nEn resumen, el uso de estereotipos es negativo cuando empiezan a convertirse en prejuicios y condicionantes. Actualmente, este problema está empezando a cambiar, ya que los consumidores tienen más consciencia sobre este fenómeno, pero, aun así, la gran mayoría sigue siendo manipulada por los anunciantes.\n\n"}, {"name": "Estereotipos en el cine", "text": "Según un estudio realizado por el Observatorio de Cultura y Comunicación de la Fundación Alternativas, el cine producido por los grandes estudios de Estados Unidos representa aproximadamente entre el 70 % y el 80 % del mercado mundial. Este mismo estudio afirma que Hollywood domina el imaginario colectivo. Este imperialismo cultural deriva en un mercado cinematográfico —especialmente el occidental— con referencias y estereotipos bastos.[23]​\n\nCon respecto a España, la mejor cuota de mercado de la historia del cine nacional fue la obtenida en 2014, con un 25,5 %, más de 6 puntos porcentuales por encima de la obtenida en 2013 (19,2 %).[24]​[25]​ Dentro de este porcentaje el cine de autor no tiene apenas cabida. Esta limitación contribuye al fomento del consumo de cine elaborado al estilo hollywoodiense, más rentable en términos económicos. De este modo, a la hora de hablar de estereotipos en el cine se habla principalmente de aquellos que aparecen reflejados en el cine norteamericano y que, por extensión, llegan a mayor número de población.\n\nComo apunta Parini, «el estereotipo —en sus diferentes formas y significados— representa un instrumento y una solución a la exigencia objetiva, presente en los medio de comunicación, de reducir una complejidad que no es fácil de difundir».[26]​ Pero recurrir al estereotipo refuerza los tópicos, generalmente alejados de la realidad a la que aparenta representar, ya que, para Pérez Serrano «el cine contribuye a la formación, mantenimiento o eliminación de estereotipos, según apoyen o no las creencias aceptadas socialmente. Además, general modelos que influyen en la creación de la identidad social».[27]​\n\n«Durante gran parte del siglo, la teoría del cine en Europa y Norteamérica parece haber vivido de la ilusión de ser totalmente ajena a toda raza». Esta frase del teórico Robert Stam (1999) define no solo la teoría, sino también una realidad.[28]​\n\nEn lo que al cine norteamericano respecta, los principales papeles representados por los asiáticos son el de mafioso y el de experto en artes marciales —o ambos a la vez, generalmente—. Por su parte, los latinos suelen ser pobres con un especial talento para bailar, seducir o embaucar o traficantes y personas allegadas a estos. Los afroamericanos aparecen representados por personajes graciosos, con carácter y/o buena voz. Los rusos suelen aparecer como agentes, exagentes secretos o mafiosos dispuestos a poner en peligro la seguridad mundial. Al pueblo judío lo representan como un colectivo avaro y codicioso, mientras que los árabes, como terroristas.\n\nLos occidentales de piel clara suelen ser los protagonistas de las películas y desempeñan diferentes roles, también estereotipados, fundamentalmente en torno al género. Cabe mencionar aquí al héroe americano, firme defensor de lo correcto, la libertad y la justicia y algunos de los tópicos más frecuentes en torno a los europeos: los alemanes se relacionan con la cerveza y un gran tamaño, los españoles con la fiesta y el flamenco —y a veces con los trajes de mexicano— y los italianos con la seducción, la mafia, la pasta y la Vespa. En definitiva, el reflejo que hace el cine comercial no es el del individuo, sino el de los tópicos.\n\nSi dirigimos la mirada hacia el cine español, Gordillo concluía en un trabajo sobre el diálogo intercultural en el cine español contemporáneo que «el cine español muestra actualmente unas relaciones interculturales deficientes entre el oriundo y el inmigrante que llega huyendo de la pobreza, debido —sobre todo— a la mirada etnocéntrica y a los prejuicios sociales y culturales de carácter negativo».[29]​\n\nPara Rodrigo Alsina, catedrático de Teorías de la Comunicación de la Universidad Pompeu Fabra de Barcelona, «dentro del cine español encontramos una profunda falta de información sobre las etnias, culturas y pueblos que empiezan a vivir en nuestras ciudades. En realidad, una de las causas del rechazo social y del racismo es el desconocimiento de la otra cultura, que da lugar al estereotipo, una de las marcas que se presentan al reflejar los rasgos del diálogo intercultural en el cine español. Aunque los estereotipos ayudan a ordenar y dar sentido a los hechos que desbordan nuestro conocimiento, son un problema cuando se utilizan para fundamentar ideas y opiniones supuestamente serias. Los prejuicios y los estereotipos siempre se utilizan para analizar la realidad y debemos de ser conscientes de ello».[30]​\n\nArtículo principal:\nPara Williams y Best, «uno de los estereotipos que a lo largo de la historia se ha mantenido con más fuerza y fiabilidad es el del sexo. En múltiples trabajos, algunos ya clásicos y otros más cercanos se encuentran descripciones de los grupos de hombres y de mujeres que engloban características similares en contextos tan diversos como América del Norte y del Sur, Asia, África, Europa y Australia. Estas descripciones retratan a las mujeres como sensibles, cálidas, dependientes y orientadas a la gente, en tanto que a los hombres se les ve dominantes, independientes, orientados hacia el trabajo y agresivos».[31]​\n\nLa industria cinematográfica moderna representa a la mujer a través de un estereotipo en el que se ajusta al canon de belleza, que viste por lo general con ropa seductora y cuyo rol se encuentra entre ser el objeto de deseo o una acompañante fiel, tierna y comprensiva de la figura masculina protagonista. Las mujeres mayores o poco atractivas solo optan a papeles secundarios o se ven relegadas a papeles como el de bruja o señora de la limpieza cuando, por el contrario, los hombres de su misma condición sí optan a papeles protagonistas y aparecen siempre rodeados de atractivas jóvenes que, en palabras de Gila y Guil Sevilla, o se enamoran de ellos o se venden a su poderío. Las mismas autoras reconocen, no obstante, que «existe cine español y europeo que escapa a estos tópicos», pero que «su influencia es muchísimo menor al ser significativamente menos visto por los espectadores».[32]​\n\nSin embargo, la sociedad está viviendo un empoderamiento de la mujer en las últimas décadas, lo que augura algunos cambios en la industria cinematográfica, si seguimos el criterio de González Gabaldón, que manifiesta que «una forma concreta de cambio del estereotipo se produce al modificarse los roles de un grupo y cuando esto sucede los estereotipos se adaptan rápidamente y pasan a reflejar los nuevos desempeños».[33]​ En la actualidad se busca derribar los modelos femeninos superficiales planteados en los medios de comunicación para combatir los estereotipos que tratan a la mujer como objeto en lugar de sujeto.\n\nVarios autores consideran que un enfoque holístico de concienciación a todos los niveles sobre el binomio sociedad-industria cinematográfica no solo permitiría seguir avanzando en dirección a la restitución de la integridad de la figura de la mujer con pleno derecho, sino que direccionaría el uso de una herramienta de difusión como es la industria del cine hacia motivos superiores, universales y ejemplarizantes para la sociedad que los estrictamente mercantiles.[34]​\n\n"}, {"name": "Recomendaciones para la eliminación de estereotipos", "text": "\n\nBusca fuentes: «Estereotipo» – noticias · libros · académico · imágenes\nA pesar de que la prevalencia de los estereotipos es continua en el tiempo y está fuertemente arraigada en nuestra cultura y en nuestro día a día, la utilización de estas figuras vejatorias ha de llegar a su fin, puesto que sólo contribuyen, en muchos casos, a desfigurar una realidad variada y rica con complejos y miedos o reservas infundados. La desaparición de los mismos es una meta por la que han de pugnar todos los agentes sociales, aunando esfuerzos por una eventual erradicación de los mismos.\nUno de los principales problemas en el desarrollo de intervenciones para reducir estereotipos es transformar las pruebas disponibles en un plan implementable.[35]​ La investigación que se centra en los cambios en la expresión de evaluaciones implícitas, ayuda a comprender como las cogniciones sociales implícitas están estructuradas; la expresión de, por ejemplo, preferencias raciales implícitas podría ser modificada a través de lo siguiente: cambios en estados emocionales, exposición a ejemplares no-estereotípicos, y el establecimiento de objetivos igualitarios.[36]​ Las asociaciones implícitas parecen ser bastante estables a lo largo de la vida del individuo, e incluso cuando se lleva acabo una intervención, cambios en creencias conscientes no siempre llevan a un correspondiente cambio en las asociaciones implícitas, aunque en algunas ocasiones, una intervención llevada acabo en el laboratorio podría resultar efectiva en reducir estas asociaciones. Intervenciones pueden variar de exponer a los sujetos a imágenes de personas que desafían los estereotipos a entregar a los sujetos objetivos para de alguna manera anular estos sesgos implícitos.[37]​\n\nA continuación se procede a la enumeración de algunas de las recomendaciones de los estudiosos del tema para hacer desaparecer los estereotipos de los medios de comunicación:\n\nLos medios han de representar el pluralismo de imágenes y discursos que genera la sociedad, igualmente plural y diversa, al servicio de la igualdad y la justicia, para así permitir que todas las partes de la misma estén correctamente representadas.\nSe han de crear relaciones positivas y continuas con las organizaciones y con ayuda de profesionales para mejorar la imagen y el posicionamiento de las minorías desfavorecidas. En el caso concreto de los periódicos, podría ser interesante crear una sección específica destinada a sensibilizar a los públicos acerca de estos ámbitos, o incluso lanzar una revista que aborde esta temática. Por lo que respecta a lo audiovisual, a la televisión, dada su naturaleza como medio masivo, que consigue mayor cobertura e impacto, podría ser interesante realizar programas o debates televisivos, destinados a proporcionar información sobre los estereotipos, contrastando, aportando datos, para así permitir a las audiencias desmontarlos por sí mismos.\nConseguir repercusión, que las noticias, reportajes e investigaciones realizados por aquellos integrantes de las minorías desfavorecidas lleguen a los principales medios relatando los hechos desde su punto de vista, dando proyección y, por lo tanto, influir así en las políticas relacionadas de los países, tanto a nivel nacional como internacional.\nCreación de cursos, seminarios y similares sobre orientación de estos asuntos para profesionales de los medios con el fin de desalentar la información insensible respecto a las minorías.\nDesarrollar organismos, asociaciones, centros de información, oficinas, tanto nacionales como internacionales, que propicien al cambio social, con un canal directo y abierto de comunicación con los principales medios para así planificar políticas y planes de acción eficaces.\nContar con la implicación de directores de los canales, los productores, los publicistas; es decir, todos los públicos implicados, tanto decisores como los que contribuyen a generar la opinión pública.\nCreación de un código ético y de conducta que se refiera específicamente estos temas, enfocado a los medios de comunicación masivos.\nCreación de equipos multiculturales en los medios.\nEl lenguaje no es una creación arbitraria de la mente humana, sino un producto social e histórico que influye en nuestra percepción de la realidad, de ahí su gran importancia.\n\nEs importante tener en cuenta que la audiencia no es necesariamente homogénea y está conformada por mujeres y hombres de diferentes vertientes culturales, creencias, costumbres y orígenes. Se han de intentar satisfacer las necesidades informativas del amplio abanico de los públicos y la pluralidad de intereses que representan. El supuesto ser humano neutro carece de existencia real y, por tanto, de cabida en los medios.\nConsiderar los grandes cambios experimentados por los colectivos, los avances y retrocesos, abusos y ayudas, y trasladar esto a las informaciones para que una correlación en los medios de comunicación.\nDiversificar las fuentes, dar voz a los afectados y evitar limitarse a los interlocutores y jefes jerárquicos de las instituciones, que aportan datos, cifras frías y sin rostro, en lugar de buscar a las personas que hay tras ellas.\nIntroducir perspectiva, entendido esto como asumir cada colectivo, cada individuo desde sus diferencias; poner de relieve que hemos sido socializados de una manera distinta y a menudo educados en valores diferentes o incluso opuestos. Esta socialización ha introducido a la fuerza variedades de comportamiento, de actitudes, de creencias, de estilo o de formas de vida.\nSer cuidadoso en la adjetivación. Ha de prevalecer la búsqueda por aportar nuevos rasgos informativos a la noticia y destierra el sentido sensacionalista, evitando alusiones despectivas y groseras o demasiado elogiosas que no aporten nuevos contenidos informativos.\nConocer las culturas.\nHacer que impere la racionalidad; no guiarse siempre solo por las emociones. Hacer primar la honradez y la profesionalidad.\nLa empatía es importante: ponerse en el lugar del otro. Intentar comprender a los demás.\nAsumir que todos los seres humanos, por el simple hecho de serlo, merecen respeto y dignidad.\nUtilizar el pensamiento crítico y no sucumbir a la presión de un grupo.\nGuiarse por los derechos humanos y la democracia, así como los valores que promueven.\nApreciar a la gente que lucha por un mundo más justo y combate la discriminación.\nNo caer en la trampa de los estereotipos; no son más que imágenes falsas y simplificadas.\nAceptar la individualidad de cada ser humano.\n"}]}, {"name": "En informática", "text": "Es un concepto dentro del Lenguaje de Modelado Unificado, donde se utiliza para encapsular los comportamientos. Por lo tanto, un estereotipo se utiliza como un vehículo para comunicar los requisitos de software y diseños, carece de la actual connotación negativa que se le da en el uso general.\n\n", "subsections": []}, {"name": "En la cultura de Internet", "text": "Bright – Persona que adhiere e impulsa la visión naturalista del mundo, incluyendo igualdad de derechos civiles, y aceptación de las personas que comparten dicha visión del mundo.\nFriki – Personas interesadas obsesivamente en los temas de la denominada cultura friki: ciencia ficción, fantasía, videojuegos, historietas, informática, etcétera.\nNerd – Persona abocada al estudio y la labor científica, informática e intelectual, hasta el punto de mostrar desinterés por las actividades sociales, físicas y deportivas.\nGamer – Jugador de videojuegos con gran dedicación e interés y con buen conocimiento de este tipo de productos.\nOtaku – Hace referencia a todo fanático que dedica tiempo, dinero y/o interés en sus pasatiempos, al manga y al anime, así como a la cultura japonesa.\nHipster – jóvenes de clase media-alta asociados a tendencias culturales independientes, alternativas o alejadas de las predominantes, a posiciones políticas progresistas o de izquierdas, al consumo de alimentos orgánicos, productos artesanales y ropa de segunda mano.\n", "subsections": []}, {"name": "Estereotipo de grupo", "text": "La pertenencia de un individuo a un determinado grupo social hace que se le relacione con un prototipo de vida, asignándole un modelo de conducta que conlleva un conjunto de características similares o comunes a los miembros de este grupo y de esta forma establecer diferencias significativas con miembros de otras categorías. Los estereotipos de grupo son una de las formas más frecuentes de representación social, definidos como una imagen mental simplificada de alguna categoría de personas, institución o acontecimiento, que es compartida por un gran número de personas en sus características esenciales (Henri Tajfel, 1982). En la medida en que un sujeto es agregado a una categoría social o grupal, se le atribuyen determinadas características. Se espera que piense, que sienta y que por lo general se comporte en coherencia con las características de dicho grupo. Los sujetos no son tomados como individuos, sino como parte de un grupo y son percibidos como similares entre ellos. El estereotipo se encarga de hacer generalizaciones acerca de los miembros de un grupo. Las generalizaciones pueden ser vistas desde un punto positivo (las mujeres son tiernas) pero en otras ocasiones son vistas negativas y resistentes al cambio (los aborígenes son salvajes). Normalmente los estereotipos facilitan el prejuicio y la discriminación.\n\n", "subsections": [{"name": "Ejemplos de estereotipo de grupo", "text": "Mujer: ama de casa, madre, inteligente, siempre bella, paciente, delicada, dependiente, sensible, frívola, tierna, etc.\nVarón: trabajador, inteligente, fuerte, no llora, valiente, jefe de familia, proveedor, le gustan los riesgos, agresivo, feo, malo, egoísta, mentiroso, soberbio, infiel, etc.\nAncianos: se les cataloga como inútiles, enfermizos, dependientes, e improductivos.\nRacial: se basan en las diferencias étnicas y culturales considerando inferiores a personas de distinto color de piel, lugar de origen o cultura, catalogándolos por ejemplo como terroristas, delincuentes o tontos.\nClases sociales: generalizan a los pobres con la ignorancia y la delincuencia, a los ricos con la soberbia y la prepotencia, a las madres solteras con una conducta ligera.\nLGBT: les ponen calificativos como: raros, confundidos, enfermos, desviados etc., además que hay una constante invalidación de su persona y su estilo de vida.\nDeportes: solo los hombres juegan fútbol por que tienen más resistencia y energía y las mujeres no pueden.\nTrabajo: solo los hombres pueden trabajar porque son más inteligentes, tienen mas fuerza y saben lo que hacen, las mujeres no, porque su obligación es hacer quehaceres domésticos.[38]​\nEs bueno acotar que estos estereotipos en muchos casos conllevan discriminación.\n\n"}]}, {"name": "Véase también", "text": "Arquetipo\nPersonaje tipo\nEstereotipos de enfermería\nRubia tonta\nCientífico loco\nAnexo: Sesgos cognitivos\nEstereotipos de África\n", "subsections": []}, {"name": "Referencias", "text": "↑ a b Real Academia Española. «estereotipo». Diccionario de la lengua española (23.ª edición). Consultado el 28 de diciembre de 2014. \n\n↑ Malgesini, Graciela; Giménez, Carlos (2000). Guía de los conceptos sobre migraciones, racismo e interculturalidad. Los Libros de la Catarata. p. 406. ISBN 978-848-319-095-1. \n\n↑ «Estereotipos y prejuicios- concepto». Consultado el 18 de septiembre de 2021. \n\n↑ González-Gabaldón, Blanca (1 de marzo de 1998). Comunicar 6 (12): 79-88. ISSN 1134-3478. doi:10.3916/c12-1999-12 http://dx.doi.org/10.3916/c12-1999-12 |url= sin título (ayuda). Consultado el 16 de diciembre de 2021. \n\n↑ Robyn Quin, Barrie Mcmahon (1987). «estereotipos negativos». Historias y estereotipos. Madrid: Ediciones de la Torre. ISBN 84-7960-086-1. \n\n↑ Herrero Cecilia, Juan. «La teoría del estereotipo aplicada a un campo de la fraseología: las locuciones expresivas francesas y españolas». Consultado el 13 de octubre de 2012. \n\n↑ Amossy, Ruth; Herschberg Pierrot, Anne (2001). Estereotipos y clichés. Eudeba. p. 39.  Texto «ubicación» ignorado (ayuda)\n\n↑ «ESTEREOTIPOS SOCIALES Y MEDIOS DE COMUNICACIÓN: UN CÍRCULO VICIOSO Autores/as Cora Edith Gamarnik». \n\n↑ Amossy, Ruth; Herschberg Pierrot, Anne (2001). Estereotipos y clichés. Buenos Aires: Eudeba. ISBN 9502311477. \n\n↑ Jara, Paula Klein (2021). «\"La literatura como indagación del lenguaje\". Entrevista con el escritor mexicano Carlos Velázquez». Confluencia: Revista Hispánica de Cultura y Literatura 36 (2): 167-178. ISSN 2328-6962. doi:10.1353/cnf.2021.0001. Consultado el 17 de diciembre de 2021. \n\n↑ Enpoli (9 de agosto de 2021). «La comedia romántica mexicana.». Enpoli. Consultado el 17 de diciembre de 2021. \n\n↑ Cano Gestoso, José Ignacio (1993).  Universidad Complutense de Madrid, ed. Los estereotipos sociales: el proceso de perpetuación a través de la memoria selectiva. Madrid. \n\n↑ a b Quin, Robyn; McMahon, Barrie (1997). Historias y estereotipos. Ediciones de la Torre. ISBN 9788479600860. Consultado el 20 de abril de 2015. \n\n↑ Correa García, Ramón Ignacio.  Universidad de Huelva, ed. Bases para la lectura de imágenes.  |fechaacceso= requiere |url= (ayuda)\n\n↑ Rasero Linde, Mª Victoria. «Historia del cuento». Archivado desde el original el 22 de mayo de 2015. Consultado el 31 de mayo de 2015. \n\n↑ Prat Ferrer, Juan José (2013).  Fundación Joaquín Díaz, ed. Historia del cuento tradicional. Consultado el 31 de mayo de 2015. \n\n↑ Pérez García, Martha Estela; Leal Larrarte, Sandra Adriana (2017-12). «Las telenovelas como generadoras de estereotipos de género: el caso de México». Anagramas - rumbos y sentidos de la comunicación 16 (31): 167-185. ISSN 1692-2522. doi:10.22395/angr.v16n31a7. Consultado el 17 de diciembre de 2021. \n\n↑ Mateos de Cabo, Ruth (2007).  Comunidad de Madrid, ed. La presencia de estereotipos en los medios de comunicación: análisis de la prensa digital española. Consultado el 1 de junio de 2015. \n\n↑ a b c Joseph, Chris. «Tipos de estereotipos en la publicidad». La Voz de Houston. Consultado el 1 de junio de 2015. \n\n↑ Grupo de Investigación \"Nuevas Formas Publicitarias y Nueva Economía\" y Asociación UNESCO para la Promoción de la Ética en los Medios de Comunicación (AUPEMEC).  Ministerio de Educación y Ciencia, ed. «Publicidad, educación y nuevas tecnologías». Consultado el 1 de junio de 2015. \n\n↑ «Campaña publicitaria de McDonald’s en Alemania indigna a Mexicanos». Zócalo Saltillo. 2 de mayo de 2013. Archivado desde el original el 4 de marzo de 2016. Consultado el 1 de junio de 2015. \n\n↑ «Salma Hayek está en contra de los estereotipos latinos». rpp.pe. 9 de julio de 2013. Consultado el 18 de mayo de 2016. \n\n↑ Saura, Antonio (2010).  Fundación Alternativas, ed. La presencia del cine español en el mercado internacional. ISBN 978-84-92957-14-9. Archivado desde el original el 23 de noviembre de 2015. Consultado el 1 de junio de 2015. \n\n↑ Belinchón, G.; García, R. (23 de septiembre de 2014). «La cruel paradoja del cine español». El País. Consultado el 1 de junio de 2015. \n\n↑ García, Rocío (10 de diciembre de 2014). «El cine español firma su mejor año». El País. Consultado el 1 de junio de 2015. \n\n↑ Parini, Pino (2002). Los recorridos de la mirada. Del estereotipo a la creatividad. Barcelona: Paidós. pp. 289-290. \n\n↑ Pérez Serrano, Gloria (1991).  UNED, ed. El análisis de contenido de la prensa. Madrid. \n\n↑ Stam, Robert (1999). Teorías del cine: Una introducción. Barcelona: Paidós. pp. 311-312. \n\n↑ Gordillo, Inmaculada (2006). «El diálogo intercultural en el cine español contemporáneo: entre el estereotipo y el etnocentrismo». Comunicación (4): 207-222. Consultado el 1 de junio de 2015. \n\n↑ Rodrigo Alsina, Miquel (1999). La Comunicación Intercultural. Barcelona: Anthropos. pp. 82-83. \n\n↑ Williams, John.E.; Best, Deborah.L. (1990). Measuring Sex Stereotypes: a Multination Study. Sage. \n\n↑ Gila, Juana; Guil Sevilla, Ana (1999). «La mujer actual en los medios: estereotipos cinematográficos». Comunicar (12): 89-93. \n\n↑ González Gabaldón, Blanca (1999). «Los estereotipos como factor de socialización en el género». Comunicar (12): 79-88. \n\n↑ Ramírez Macías, Gonzalo; Piedra de la Cuadra, Joaquín; Ries, Francis; Rodríguez Sánchez, Augusto R. (2011). «Estereotipos y roles sociales de la mujer en el cine de género deportivo».  En Universidad de Salamanca, ed. Teoría de la Educación. Educación y Cultura en la Sociedad de la Información 12 (2): 82-103. ISSN 1138-9737. Consultado el 1 de junio de 2015. \n\n↑ David Trafimow & Magda Osman (2022) Barriers to Converting Applied Social Psychology to Bettering the Human Condition, Basic and Applied Social Psychology, 44:1, 1-11, DOI: 10.1080/01973533.2022.2051327.\n\n↑ Lai, C. K., Marini, M., Lehr, S. A., Cerruti, C., Shin, J. E. L., Joy-Gaba, J. A., ... & Nosek, B. A. (2014). Reducing implicit racial preferences: I. A comparative investigation of 17 interventions. Journal of Experimental Psychology: General, 143(4), 1765.\n\n↑ Lai, C. K., Skinner, A. L., Cooley, E., Murrar, S., Brauer, M., Devos, T., ... & Nosek, B. A. (2016). Reducing implicit racial preferences: II. Intervention effectiveness across time. Journal of Experimental Psychology: General, 145(8), 1001.\n\n↑ Espino-Armendáriz, Saúl (8 de agosto de 2021). «Bajo un mismo cielo: las iglesias para la diversidad sexual y de género en un campo religioso conservador». International Feminist Journal of Politics 23 (4): 665-668. ISSN 1461-6742. doi:10.1080/14616742.2021.1952091. Consultado el 17 de diciembre de 2021. \n\n", "subsections": []}, {"name": "Bibliografía", "text": "Aguado Odina, Teresa; Del Olmo, Margarita (2009). Educación intercultural. Perspectivas y propuestas. Madrid. ISBN 978-84-613-5087- |isbn= incorrecto (ayuda). \nBiernat, M. (1991).  Journal of Personality and Social Psychology, ed. Gender Stereotypes and the Relationship between Masculinity and Feminity: A developmental Analysis (en inglés). \nGarcía Oyarzun, Ainhoa (2014). Sobre sexismo en los medios de comunicación: enfoque pragmático-discursivo. \nHamilton, D.L; Trolier, T.K. (1986).  J. Dovidio y S. Gaertner, ed. Stereotypes and stereotyping: An overview of the cognitive approach (en inglés). Orlando: Academic Press. \nSánchez, Mariano (1999). «La educación para el uso de los medios y su identidad crítica». Estereotipos en los medios. Educar para el sentido crítico (Huelva: Grupo Comunicar): 186-190. \nTajfel, Henri; Flament, M.C.; Billig, M.; Bundy, R.P. (1971).  European Journal of Social Psychology, ed. Social Categorization and Intergroup Behavior (en inglés). \nTajfel, Henri (1978). Differentiation between social groups (en inglés). Londres: Academic. \nTajfel, Henri (1982). Social Identity and Intergroup Relations (en inglés). Estados Unidos: Cambridge University Press. \n", "subsections": []}, {"name": "Enlaces externos", "text": " Wikcionario  tiene definiciones y otra información sobre estereotipo.", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Estimulaci%C3%B3n", "title": "Estimulación", "summary": "La estimulación es la actividad que se le otorga a los seres vivos para un buen desarrollo o funcionamiento, ya sea por cuestión laboral, afectiva o física. La estimulación se contempla por medio de recompensas o también llamados estímulos, que despiertan en el individuo la motivación para realizar algo.\n\nLa mayor parte es por dinero, por afecto o por ciertos métodos de ejercicios, por lo cual se incita a realizar acciones mejor elaboradas. La palabra también se usa a menudo metafóricamente. Por ejemplo, una actividad interesante o divertida puede ser descrita como \"estimulante\", independientemente de sus efectos físicos sobre los nervios.\n\nEstimular significa \"llevar a alguien a convertirse en (más) activo, trabajador, fomentar o provocar algo para empezar (más rápido) o desarrollarse (mejor) o excitar a un órgano u organismo para incrementar su actividad\".\n\n", "sections": [{"name": "Generalidades", "text": "Estimulación en general se refiere a cómo los organismos perciben los estímulos entrantes. Como tal, es parte del mecanismo de estímulo-respuesta. Por lo tanto, la estimulación puede ser descrita como \"la respuesta que provocan los eventos externos o internos a un individuo en el intento de hacerles frente\".\nPsicológicamente, es posible habituarse a un grado de estimulación, y luego encontrar que es incómodo tener significativamente más o menos. Así, uno puede llegar a acostumbrarse a una vida intensa y estresante, y luego sufrir de abstinencia cuando se retira de ella, por falta de estimulación.\n\n", "subsections": []}, {"name": "Tipos de estimulación", "text": "Estimulación laboral: Es aquella que por la puntualidad y hacer lo mejor posible el trabajo asignado se les dan a los trabajadores ciertos beneficios (vales de despensa, aumento salarial, etc).\nEstimulación afectiva: Es por el contacto más agradable para una persona ya sea sexual o  afectiva. Es la más común entre casi todas las personas, ya que, es la acción de dar y recibir.\nEstimulación física: Es la repetición de ciertos ejercicios para sanar o desarrollar las partes del cuerpo que se llegan a deteriorar o a lesionar. También es muy común la estimulación  en los bebés ya que por su fragilidad es la mejor etapa para su crecimiento y ser más competentes para su vida futura.\n", "subsections": []}, {"name": "Estimulación en los videojuegos", "text": "De acuerdo a los 100 principios del diseño de videojuegos, la mejor estimulación es cuando “hay un espacio que deja respirar al jugador entre él y el suspenso, deja que el jugador se sienta cómodo y listo para ser lanzado de nuevo a un destello de acción, una buena estimulación mantiene un balance entre estos dos”.[1]​ Esto quiere decir que el mejor flujo de estimulación para el jugador es un toque de incertidumbre y expectativa, de este modo se le mantiene enganchado al juego y al mismo tiempo se genera una expectativa de este.\n", "subsections": []}, {"name": "Véase también", "text": "Estimulante\nEstimulación temprana\nEstimulación multisensorial\nEstimulación cerebral profunda\n", "subsections": []}, {"name": "Referencias", "text": "↑ Despain, Wendy (2012). 100 Principles of Game Design (en inglés). New Riders. ISBN 978-0321902498. \n\n", "subsections": []}, {"name": "Bibliografía", "text": "ARANGO M. Teresa; Infante E.,López Ma. Elena, Estimulación Temprana, 7° edición, Colombia, 2000.", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Etiolog%C3%ADa", "title": "Etiología", "summary": "La etiología (del griego αἰτιολογία ‘estudio de la causa’)[1]​ es la ciencia centrada en el estudio de la causalidad. En medicina, patogénesis se refiere al origen de las enfermedades. La palabra se usa en filosofía, biología, derecho penal, física, y psicología para referirse a las causas de los fenómenos.\n\n", "sections": [{"name": "Historia", "text": "Desde los tiempos de Hipócrates a los médicos se les enseña a comenzar las historias clínicas preguntando al paciente:\n\n¿Qué le pasa?\n¿Desde cuándo?\n¿A qué lo atribuye?\nEl médico hace partícipe al paciente, para que exprese la causa, si la sabe, de sus males.\n\nA lo largo de la historia de la medicina, los médicos discutieron si la causa de una enfermedad era un único factor o si era el resultado de un conjunto de factores que actuaban simultáneamente. En el siglo XIX estos dos puntos de vista los representaron respectivamente Pasteur y Bernard. \n\nBernard hizo hincapié en los factores ambientales, externos e internos. Y defendió la idea de la enfermedad producida por una pérdida del equilibrio interno (homeostasis) que suponía, por lo general, la concurrencia de un gran número de factores.\n\nPasteur centró sus esfuerzos en esclarecer el papel desempeñado por las bacterias en la aparición de una enfermedad, relacionando diferentes enfermedades con determinados microbios. Pasteur demostró la correlación que existe entre las bacterias y determinadas enfermedades, y por ello sus teorías tuvieron un impacto decisivo. \n\nLa postura de Pasteur y sus seguidores predominó en la discusión y, como resultado, la teoría de los gérmenes -según la cual cada enfermedad era causada por un microbio específico- fue rápidamente aceptada por los profesionales de la medicina.\n\nEl concepto de etiología científica lo formuló el médico Robert Koch, quien enumeró una serie de postulados de Koch para probar si un microbio determinado causaba una enfermedad específica.\n\nLos adelantos en el campo de la biología del siglo XIX se acompañaron del desarrollo de la tecnología médica. Se inventaron nuevos instrumentos de diagnóstico médico, entre ellos el estetoscopio y los aparatos para tomar la presión sanguínea, y la tecnología quirúrgica se volvió más sofisticada.\n\nYa bien entrado el siglo XX, se reconoce que la causa de las enfermedades es múltiple donde interaccionan los determinantes de la salud que son el medio ambiente, el agente y el huésped.\n\n", "subsections": []}, {"name": "La etiología en medicina", "text": "La etiología en el campo de la medicina se refiere principalmente al estudio de las causas de las enfermedades\n\nLos tres elementos necesarios para que se desarrolle una enfermedad son:\n\nEl medio ambiente.\nEl agente.\nEl huésped.\nEstos tres \"elementos\" por sí solos no \"causan\" un problema. Es la concurrencia de los tres, en tiempo y espacio, lo que da como resultado una enfermedad. \nCuando se conoce la causa o causas de una enfermedad, facilita la investigación de un tratamiento específico, o en su defecto un tratamiento para mejorar la calidad de vida del paciente.\n\nSe considera que hay cuatro tipos básicos de factores que influyen en las causas de las enfermedades:\n\nPredisponentes: edad, sexo, enfermedad previa u otros pueden crear una mayor sensibilidad ante una enfermedad.\nFacilitadores: bajos ingresos, desnutrición, malas condiciones habitacionales, entre otros, pueden favorecer el desarrollo de determinadas enfermedades.\nDesencadenantes: la exposición a un agente patógeno -causante de una enfermedad- puede precipitar su desarrollo;\nPotenciadores: la exposición repetida a un agente patógeno puede agravar una enfermedad ya presente.\n", "subsections": []}, {"name": "Tipos de enfermedades", "text": "Según su etiopatogenia (según la causa y la fisiopatología consecuente) las enfermedades se pueden clasificar en: \n\nEnfermedades endógenas (atribuibles a alteración del huésped):\nEnfermedades exógenas (atribuibles al efecto de la acción directa del agente sobre el huésped):\nEnfermedades ambientales (atribuibles a los efectos del ambiente y del agente -en conjunto- sobre el huésped):\nEnfermedades de etiología multifactorial:\nActualmente, varias de las condiciones de salud que originan los diferentes tipos de enfermedades están codificadas en la Clasificación internacional de enfermedades, décima versión. Dicha clasificación se basa en una amplia variedad de signos, síntomas, hallazgos anormales, denuncias, circunstancias sociales y causas externas que producen daños y/o enfermedad.[2]​\n\n", "subsections": []}, {"name": "Véase también", "text": "CIE-10\nPatogenia\n", "subsections": []}, {"name": "Referencias", "text": "↑ Real Academia Española. «Etiología». Diccionario de la lengua española (23.ª edición). \n\n↑ World Health Organization, WHO (2015). «International Classification of Diseases (ICD)». List of Official ICD-10 Updates (en inglés). WHO. Consultado el 2 de mayo de 2016. \n\n", "subsections": []}, {"name": "Enlaces externos", "text": " Wikcionario  tiene definiciones y otra información sobre etiología.\n\n", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Eurogamer", "title": "Eurogamer", "summary": "\n\nRupert Loman\n\n\nEurogamer es una revista y sitio web con sede en Brighton enfocado en noticias, críticas, presentaciones y entrevistas acerca de videojuegos. Está operada por Eurogamer Network Ltd., empresa que fue fundada en 1999 por los hermanos Rupert y Nick Loman. Eurogamer ha crecido tanto que ahora es uno de los sitios web europeos sobre videojuegos más visitados. La Eurogamer Network anunció que es el sitio más leído de todos los sitios de videojuegos independientes en Reino Unido (alrededor de 1,8 millones de usuarios en noviembre de 2007, incluyendo el tráfico de los sitios en idioma francés y alemán),[1]​ y fue uno de los primeros sitios en tratar acerca del tráfico de verificaciones independientes por el sistema de ABC Electronic.[2]​\n\nLos sitios web GamesIndustry.biz y Get Games son filiales de Eurogamers, y tiene tres divisiones: Eurogamer Video, Eurogamers y DigitalFoundry, sección en la que realizan análisis técnicos en profundidad.\n\nEn 2008 lanzaron su sitio español, Eurogamer.es,[3]​ con contenido creado por redactores españoles para este público. Su sede está en Barcelona.\n\n", "sections": [{"name": "Sub-salidas", "text": " Eurogamer  es el sitio principal de la familia Gamer Network de sitios web relacionados con videojuegos. Tiene varios puntos de venta regionales:\n\n Eurogamer.cz  para la República Checa.[4]​\n Eurogamer.de  para Alemania;[5]​ lanzado en cooperación con Extent Media el 24 de agosto de 2006 para coincidir con la exposición Convención de Juegos de ese año.[6]​\n Eurogamer.dk  para Dinamarca;[7]​ lanzado en junio de 2009 y dirigido por Kristian West.[8]​\n Eurogamer.es  para España.[9]​\n Eurogamer.it  para Italia.[10]​\n Eurogamer Benelux  para los Países Bajos y Bélgica;[11]​ lanzado en agosto de 2008 y dirigido por Steven De Leeuw.[12]​\n Eurogamer.pl  para Polonia.[13]​\n Eurogamer.pt  para Portugal;[14]​ lanzado en asociación con LusoPlay en mayo de 2008.[15]​\n Digital Foundry , fundada en \n2004, ha sido alojada en  Eurogamer  desde 2007 y está dirigida por Richard Leadbetter. Realiza análisis técnicos de juegos.[16]​\n\n", "subsections": []}, {"name": "Referencias", "text": "↑ Game Press anuncia las estadísticas del tráfico de Eurogamer para noviembre de 2007\n\n↑ El sitio web de ABC Electronic\n\n↑ «Eurogamer.es». Archivado desde el original el 15 de mayo de 2020. Consultado el 31 de mayo de 2010. \n\n↑  «Eurogamer.cz». Eurogamer.cz.  \n\n↑  «Eurogamer.de». Eurogamer.de.  \n\n↑  Bramwell, Tom (4 de agosto de 2006). «Eurogamer.de anunció». Eurogamer.  \n\n↑  «Eurogamer.dk». Eurogamer.dk.  \n\n↑  Gibson, Ellie (25 de junio de 2009). «Eurogamer Dinamarca lanza». Eurogamer.  \n\n↑  «Eurogamer.es». Eurogamer.es.  \n\n↑  «Eurogamer.it». Eurogamer.it.  \n\n↑  «Eurogamer Benelux». Eurogamer.nl.  \n\n↑  Bramwell, Tom (18 de agosto de 2008). «¡Lanzamientos de Eurogamer Benelux!». Eurogamer.  \n\n↑  «Eurogamer.pl». Eurogamer.pl.  \n\n↑  «Eurogamer.pl». Eurogamer.pl.  \n\n↑  Gibson, Ellie (21 de mayo de 2008). «Lanzamiento del nuevo sitio de Eurogamer Portugal». Eurogamer.  \n\n↑  «Ayuda y preguntas frecuentes». Digital Foundry.  \n\n", "subsections": []}, {"name": "Enlaces externos", "text": "Eurogamer.es\nEurogamer.net\nGamesIndustry.biz\nGamesIndustry.biz", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Festigame", "title": "Festigame", "summary": "\n\n◄ Actual ►\n2024\nFestigame es un evento de videojuegos que se realiza en Santiago de Chile desde el año 2012. En la actualidad el evento tiene sede en Espacio Riesco, pero sus primeras ediciones fueron en Estación Mapocho. Su última versión del año 2019, se realizó los días 2, 3 y 4 de agosto, siendo esta su octava edición.\n\nDesde el año 2012, Festigame ha sido catalogado como el evento gamer más grande de Chile y uno de los más importantes de Latinoamérica, realizando versiones tanto en Chile como en Colombia.\n\nAño a año las compañías más importantes de la industria de los videojuegos dicen presente en Festigame dando a conocer las últimas tendencias, lanzamientos y avances de sus productos más importantes, destacando la presencia de gigantes del mundo gamer como Microsoft, Sony y Nintendo.\n\nPara el año 2020, el evento fue completamente suspendido debido a la pandemia de COVID-19, con el fin de no propagar la enfermedad, debido a su alta asistencia. Además el lugar donde se lleva a cabo el evento actualmente, Espacio Riesco, fue arrendado por el gobierno para pacientes críticos de coronavirus en el sector nororiente de Santiago, instalando un hospital de campaña.\n\nDebido a la pandemia, el evento volvió a realizar su novena edición los días 16 a 18 de julio del año 2021, de manera online mediante plataformas como Twitch y trasmisiones en Youtube, con el fin de atraer público de manera virtual.\n\n", "sections": [{"name": "Orígenes", "text": "", "subsections": [{"name": "Primera edición (2012)", "text": "La feria de videojuegos más grande de Chile se realizó por primera vez el año 2012. Aquí, más de 25 mil asistentes repletaron el Centro Cultural Estación Mapocho desde 10 hasta el 12 de agosto de ese año, que además contó con la participación de Charles Martinet, quien es la voz del mundialmente conocido personaje Super Mario. También estuvo Sebastián Llapur, quien realiza la icónica voz de Marcus Fenix en el popular título de Microsoft, Gears of War.\n\n"}, {"name": "Segunda edición (2013)", "text": "El año siguiente, Festigame se realizó durante el 15, 16, 17 y 18 de agosto. Esta vez fue la primera oportunidad en que Festigame superaba los 40 mil asistentes. Al ya invitado anteriormente Sebastián Llapur, en esta ocasión se sumó Ricardo Tejedo, quien participó en el videojuego Gears of War encarnando a Dominic Santiago.\n\n"}, {"name": "Tercera edición (2014)", "text": "El 2014 nuevamente se repitió el formato de cuatro días, por lo que el festival se realizó desde el 14 de agosto hasta el 17 en el Centro Cultural Estación Mapocho de Santiago. En esa ocasión se invitó a Steven Ogg, quien fue la voz de Trevor Phillips en el popular videojuego GTA V, Lindsay Elise quien es una reconocida cosplayer en el mundo gamer y nuevamente Charles Martinet, la voz de Super Mario.\n\nEn esta oportunidad, PlayStation se robó las miradas con juegos como DriveClub, el cual presentó como exclusiva unas pistas ubicadas en el norte de Chile. LittleBigPlanet 3, el gran juego de plataformas que en esta nueva entrega ofrecía multijugador de hasta cuatro personas. Finalmente, The Order: 1886, título de acción que sorprendía con el enfrentamiento de una orden en una distopía de época victoriana.\n\n"}, {"name": "Cuarta edición (2015)", "text": "En su cuarta edición, Festigame 2015 se realizó desde el 13 al 16 de agosto, donde se congregaron nuevamente más de 45 mil personas en Estación Mapocho. Los invitados en esta ocasión fueron Troy Baker, la voz de Joel en el videojuego The Last of Us, además de dos de las cosplayer, más reconocidas a nivel mundial como Jessica Nigri y, nuevamente, Lindsay Elise.\n\nNintendo presentó en esta edición a “Super Mario Maker”, el juego de construcción que celebraba los treinta años de su célebre personaje. También se pudieron probar otros títulos como “Star Fox Zero” y “Yoshi’s Wooly World”.\n\n"}, {"name": "Quinta edición (2016)", "text": "Su quinta versión se realizó desde el 4 al 7 de agosto, por primera vez en el Espacio Riesco, lo que significó un gran aumento en el espacio del evento. Se invitó a Leto Dugatkin, conocido por ser la voz de Nathan Drake en la versión latinoamericana de la saga Uncharted, Yoshinori Ono productor de la empresa Capcom y Mike Ross el gerente de Esports de la comunidad Fightning en Twitch. \n\nEn esta oportunidad destacó un gran stand de Xbox, en donde los más fanáticos pudieron probar Forza Horizon 3 y Gears 4. Igualmente se exhibió el primer tráiler de Sea of Thieves. Por parte de PlayStation, los fanáticos de la consola de Sony pudieron disfrutar del esperado \"The Last Guardian\"\n\n"}, {"name": "Sexta edición (2017)", "text": "La versión de este año fue histórica, ya que el encuentro familiar terminó de consolidarse como el evento de entretención y videojuegos más importante de nuestro país y, que en esta versión, registró récord de asistentes (más de 47.000 personas), de expositores, de invitados internacionales y un número impresionante de viewers en el streaming a través de Movistar TV (solo durante este sábado se duplicaron los que hubo el 2016).\n\nEste año las figuras internacionales fueron históricas. Ed Boon, el Co-Creador de Mortal Kombat y actual responsable de la franquicia Injustice en NetherRealm Studios, fue uno de los más solicitados. Mario Kempes y Fernando Palomo, relatores de FIFA 17 y comentaristas de ESPN, llegaron a Festigame y fueron recibidos en el escenario por Stefan Kramer. Jessica Ángeles, la actriz de doblaje mexicana que ha dado voz por primera vez en Latinoamérica a la Princesa Zelda, en el exitoso videojuego The Legend of Zelda: Breath of the Wild, también dijo presente, Aldo Schiappacasse y Claudio Palma, quienes presentaron PES 2018 con sus relatos para el mercado local.\n\n"}, {"name": "Séptima edición (2018)", "text": "Su séptima edición se realizó el 3,4 y 5 de agosto en Espacio Riesco. En esta oportunidad uno de los invitados estelares fue Eric Jacobus, el doble de acción de Kratos en God of War, título electo como \"Game of the Year\" en los Game Awards 2018; Jacobus fue el encargado de darle vida a lo movimientos de este popular e histórico personaje de PlayStation. Otro invitado que se robó todas las miradas fue Stefanie Joosten  la actriz, modelo y cantante holandesa llegó a Chile como la persona que encarna a Quiet, en Metal Gear Solid V; este  personaje, creado por el japonés Hideo Kojima, utiliza el rostro, voz y movimientos de Joosten por lo que su personaje es prácticamente \"un calco\" de ella. Además es intérprete de \"Quiet Theme\", canción compuesta para la personaje y que cantó durante Festigame, junto con relatar sobre su carrera dentro del mundo de los videojuegos. Finalmente en el cosplay destacó la presencia de Giu Hellsing, cosplayer brasileña de 27 años muy conocida alrededor del mundo que llegó a Espacio Riesco como expositora y parte del jurado en todas las competencias del evento.\n\nFestigame 2018 destacó por ser un año cargado a los Sports, en donde hubo competencias de Just Dance, FIFA 18, Counter-Strike: Global Offensive, Overwatch, League of Legends, Mortal Kombat XL e Injustice 2\n\n"}]}, {"name": "Referencias", "text": "Festigame en 24 horas\n\nJuegos inéditos en Festigame 2015\n\nFestigame 2015 en Cooperativa\n\nFestigame 2015 cierra con éxito su edición 2015\n\nFestigame 2015 en La Tercera Archivado el 26 de julio de 2015 en Wayback Machine.\n\nImágenes del último día de Festigame \n\nColumna de Vardoc sobre Festigame\n\n", "subsections": []}, {"name": "Enlaces externos", "text": "Sitio oficial Festigame Chile [1]", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/G%C3%A9nero_de_videojuegos", "title": "Género de videojuegos", "summary": "\n\nBusca fuentes: «Género de videojuegos» – noticias · libros · académico · imágenes\nUn género de videojuegos es una forma de clasificar los videojuegos basada en su jugabilidad más que en sus diferencias visuales o narrativas.[1]​[2]​ Un género de videojuego es definido según su conjunto de limitaciones jugabilísticas y son clasificados independientemente de su ambientación, a diferencia de otras obras de ficción como películas o libros. Por ejemplo, un videojuego de disparos seguirá siendo un videojuego de disparos, sin importar en dónde o cuándo tome lugar.[3]​[4]​\n\nAsí como cerca de todas las variedades de clasificación de géneros, la cuestión de un género de videojuegos en específico está abierta a interpretación subjetiva. Un único juego puede pertenecer a varios géneros al mismo tiempo.[1]​\n\n", "sections": [{"name": "Antecedentes", "text": "El primer intento serio de clasificación de los videojuegos conocido fue realizado en 1984 por Chris Crawford en su libro The Art of Computer Game Design,[5]​ en donde clasifica a los videojuegos en dos macro categorías y varias subcategorías basadas en las mecánicas del juego, además de hacer un gran hincapié entre la diferencia de un juego y un puzle, donde el puzle no cambia y una vez resuelto se pierde el conflicto y la dificultad para el jugador, mientras que el juego es dinámico y varía cada vez que él se juega. A continuación se hablará brevemente de cada una de ellas.\n\nJuegos de habilidad y acción\nJuegos de combate: que presentan un conflicto violento, donde el jugador tiene que derrotar a los enemigos, usualmente disparándoles (ej. Doom).\nJuegos de laberinto: donde el jugador tiene que recorrer una estructura laberíntica, usualmente siendo perseguido por enemigos (ej. Terrario).\nJuegos de deportes: juegos que tratan de simular una experiencia de un deporte real[Ej.(Fifa)].\nJuegos de paleta: juegos basados en Pong donde el jugador tiene que mover una paleta para rebotar una pelota (ej. Arcanoid).\nJuegos de carreras: juegos, donde el objetivo es mover a un avatar (ya sea un vehículo o un personaje) para ganar una carrera, ya sea contra otros jugadores o una computadora (ej. Need for Speed).\nJuegos de estrategia y cognitivos\nJuegos de aventuras: donde el jugador debe trasladarse en un mundo complejo, consiguiendo herramientas y tesoro suficiente para lograr su objetivo final (ej. Tomb Raider ).\nJuegos de rol: Donde los jugadores son guiados por un «director de juego» a través de una historia creada por él, donde pone las reglas y las situaciones que se presentarán.\nJuegos de guerra (o gran estrategia): son juegos complejos con cantidades enormes de guerra, donde se presenta conflicto entre dos o más jugadores donde existen muchas variables y modificadores (ej. Starcraft).\nJuegos educacionales: son juegos, donde la intención principal es transmitir algún conocimiento o trabajar alguna habilidad.\n", "subsections": []}, {"name": "Generalidades", "text": "A lo largo de la historia de los videojuegos, sus creadores han ido dando lugar a una variedad creciente de géneros en las distintas plataformas disponibles. Estos géneros se han ido conformando en torno a factores como: la representación gráfica, el tipo de interacción entre el jugador y la máquina, la ambientación, y su sistema de juego, siendo este último el criterio más habitual a tener en cuenta.\n\nLa siguiente lista de géneros de videojuegos va acompañada de una breve descripción y varios ejemplos de cada uno. Hay que decir que cada vez es más habitual que un videojuego contenga elementos de diversos géneros, cosa que hace difícil su clasificación. Un buen ejemplo de este fenómeno son los videojuegos de la serie The Legend of Zelda, que contienen a la vez elementos de acción, de aventura y rol. Esta fusión de géneros crea a su vez nuevos géneros, como es el de rol-acción o el de acción-aventura. Ejemplos de este último género son Grand Theft Auto o Resident Evil, que mezclan elementos de aventura gráfica con otros de Matamarcianos.\n\n", "subsections": []}, {"name": "Acción", "text": "Artículo principal:\nLos videojuegos de acción requieren que el jugador haga uso de sus reflejos, puntería y habilidad, a menudo en un contexto de combate o de superación de obstáculos y peligros. Dentro de este amplio género se encuadran varios subgéneros de gran popularidad, como los juegos de disparos, los de lucha, los arcades y los de plataformas, entre otros.\n\n", "subsections": [{"name": "Lucha", "text": "Los videojuegos de lucha, como indica su nombre, recrean combates entre personajes controlados tanto por un jugador como por la computadora. El jugador normalmente ve a los combatientes desde una perspectiva lateral, como si se tratase de un espectador aunque también hay excepciones que manejan entornos en 3D y primera persona. Este tipo de videojuegos ponen especial énfasis en las artes marciales, reales o ficticias (generalmente imposibles de imitar), u otros tipos de enfrentamientos sin armas como el boxeo o la lucha libre. Otros videojuegos permiten también usar armas blancas como pueden ser espadas, hachas, martillos, etc., o ataques a distancia, normalmente de carácter mágico o etéreo.\n\nAunque este género se introdujo a mediados de los años 1980, no se popularizó hasta la llegada de Street Fighter II. Con la llegada de los gráficos tridimensionales no cambió el estilo de juego, pero en cambio sí la forma de jugarlos.\nSobre todo surgió el género de arena fighting que suele presentarse como un juego de batalla campal («battle royal» en inglés) donde el movimiento del jugador suele ser completamente libre en el escenario y existe, habitualmente, una alta interacción con el escenario, diversos objetos utilizables repartidos sobre el escenario, ataque a distancia, etc. Por eso también se los conoce como juegos de lucha sobre plataformas («platform fighting»). \n\nEjemplos: Street Fighter, Guilty Gear, BlazBlue, Fatal Fury, Mortal Kombat, Tekken, Soulcalibur, Super Smash Bros, The King of Fighters, Killer Instinct.\n\n"}, {"name": "Beat 'Em Up", "text": "Los Beat 'Em Up o «yo contra el barrio» son videojuegos similares a los de lucha, con la diferencia que en este caso los jugadores deben combatir con un gran número de individuos mientras avanzan a lo largo de varios niveles, desplazándose por escenarios vistos normalmente en perspectiva lateral. Los enfrentamientos suelen ser cuerpo a cuerpo, aunque no es infrecuente el uso de armas de fuego.\n\nEn los beat'em up suele ser posible jugar dos o más personas a la vez de forma cooperativa para facilitar el progreso.\n\nEjemplos: Double Dragon, Splatterhouse, Final Fight, Streets of Rage, Die Hard Arcade, Viewtiful Joe, Battletoads, The Warriors y God Hand.\n\nHack and Slash\nA diferencia de los videojuegos de rol hack and slash, el término \"hack and slash\" también comenzó a usarse para referirse a los videojuegos de acción de estilo Beat 'em up, como la serie Golden Axe.[6]​[7]​ \nLos periodistas que cubren la industria de los videojuegos a menudo usan el término \"hack and slash\" para referirse a un género distinto de videojuegos de acción cuerpo a cuerpo de tercera persona en 3D basados en armas, incluyendo títulos como Devil May Cry, Dynasty Warriors, Ninja Gaiden, God of War, Genji, No More Heroes, Bayonetta, Darksiders y Dante's Inferno.[8]​[9]​\n\n"}, {"name": "Arcade", "text": "Los videojuegos tipo arcade se caracterizan por su jugabilidad simple, repetitiva y de acción rápida. Más que un género en sí, se trata de un calificativo bajo el que se engloban todos aquellos juegos típicos de las máquinas recreativas (Yo contra el barrio, matamarcianos, plataformas). Tuvieron su época dorada en la década de 1980.\n\nTambién se dice que un juego es tipo «arcade» para significar que, en contraposición a otros juegos del mismo género que persiguen un gran realismo o sofisticación (como los juegos de simulación de vehículos o de guerra), se caracterizan por una jugabilidad, unos gráficos y/o un argumento más simples.\n\nSu origen está en las máquinas de arcade, máquinas recreativas disponibles en lugares públicos de diversión.\n\nEjemplos: Space Invaders, Asteroids, Pac-Man, Duck Hunt, Missile Command, Galaxian, Robostrike y Donkey Kong .\n\n"}, {"name": "Plataformas", "text": "En los videojuegos de plataformas el jugador controla a un personaje que debe avanzar por el escenario evitando obstáculos físicos, ya sea saltando, escalando o agachándose. Además de las capacidades de desplazamiento como saltar o correr de los personajes de los juegos de plataformas; este tipo de género puede estar más inclinado, o a la acción (generalmente cuando el usuario puede realizar ataques contra los enemigos), o a la aventura (cuando el usuario no puede atacar, sino que solo puede moverse); por lo cual no se podría catalogar ampliamente a los plataformas como un juego de aventura o de acción. Inicialmente los personajes se movían por niveles con un desarrollo horizontal, pero con la llegada de los gráficos 3D este desarrollo se ha ampliado hacia todas las direcciones posibles.\n\nA partir del sistema de cambio de perspectiva (o movimiento de «cámara») utilizado en el famoso Super Mario 64 (de cuya técnica se basaron el resto de los juegos tridimensionales posteriormente) se ha permitido una verdadera libertad de movimiento en tales ambientes (no confundir con el primer plataforma 3D).\n\nLos videojuegos de plataformas son uno de los primeros tipos de juegos que aparecieron en las computadoras. Aunque este género fue muy popular en los 80 y los 90, su popularidad ha disminuido en los últimos años, aún más cuando se introdujeron los gráficos 3D en los videojuegos. Esto se debe en gran parte a que los gráficos tridimensionales han hecho que se perdiese la simplicidad de desarrollo que caracterizaba este género.\n\nNo obstante, un subgénero de plataformas 3D ha tenido notable éxito en los últimos años, se trata de los videojuegos endless runner o juegos de «carrera infinita». Bien adaptados a las posibilidades de las interfaces táctiles, estos juegos se han popularizado en móviles y tabletas de la mano de títulos como Temple Run o Rodeo Stampede.\n\nEjemplos de sagas del género de plataformas: Super Mario, Sonic the hedgehog, Mega Man, Rayman, Crash Bandicoot, Donkey Kong y Banjo-Kazooie.\n\n"}]}, {"name": "Disparos", "text": "Considerados a menudo como una gran subcategoría dentro del género de acción, en los videojuegos de disparos -también conocidos como shooters- el protagonista hace un uso continuo de armas de fuego para abrirse paso en el juego.\n\n", "subsections": [{"name": "Disparos en primera persona", "text": "En los videojuegos de disparos en primera persona, conocidos también como FPS (\"first person shooter\"(no se deben confundir con los fotogramas por segundo)), se maneja al protagonista desde una perspectiva subjetiva, es decir, vemos en la pantalla lo que ve nuestro personaje, y por tanto no lo vemos a él. Sí vemos en cambio su arma, en primer plano, la cual deberemos usar para abatir a los diferentes enemigos que aparecerán frente a nosotros al avanzar. La perspectiva en primera persona, en un entorno 3D, tiene por meta dar al jugador la impresión de ser el personaje, buscando con ello una experiencia más realista de juego.\n\nGeneralmente, en estos videojuegos la calidad del guion no tiene gran relevancia (salvo superproducciones tales como Half Life o Halo), mientras que hacen destacar la calidad gráfica y la jugabilidad. Cada generación de juegos mejora con las últimas tecnologías y las nuevas posibilidades gráficas que rozan el fotorrealismo. La mecánica del juego (o gameplay) impone generalmente al jugador tener buenos reflejos y precisión.\n\nAlgunos videojuegos marcaron el género, tales como Wolfenstein 3D, Doom, Unreal, Quake, Half Life, y posteriormente Halo, Call of Duty, Team Fortress Classic, Far Cry o Battlefield.\n\nEs de notar que en ciertos videojuegos de disparos en primera persona tales como Quake III, Counter Strike u otros menos conocidos como Soldier Front o Day of Defeat, se puede jugar en modo multijugador en línea, como también contra personajes controlados por la máquina (bots) sin necesitar una conexión a internet. La mayoría de jugadores optan por jugar solos o en equipos contra oponentes humanos con los que poner a prueba su habilidad, compitiendo por conseguir la victoria.\n\nLa popularidad de estos juegos y el sentimiento de competición que acompaña a los jugadores, han hecho surgir distintas ligas de juegos de disparos en línea con gran cantidad de participantes y seguidores de distintas naciones.\n\nEste género de videojuegos ha sido durante mucho tiempo casi exclusivo del PC, apareciendo en videoconsolas solo en contadas ocasiones con títulos como Doom o Wolfenstein, aunque se produce un cambio de tendencia tras la llegada de la Nintendo 64 y su GoldenEye 007. En cuanto a las consolas portátiles cabe mencionar la Nintendo DS con el aclamado Metroid Prime Hunters.\n\nPor último, una variante del género con bastante implantación en el mundo de las máquinas de arcade son los shooters  sobre raíles, caracterizados por dirigir automáticamente el desplazamiento del jugador por el escenario de juego, con lo que el jugador solo ha de concentrarse en apuntar y disparar a los enemigos que van apareciendo ante él. Ejemplos de este subgénero son The House of the Dead, Operation Wolf,  Virtua Cop o Time Crisis.\n\n"}, {"name": "Disparos en tercera persona", "text": "Los videojuegos de disparos en tercera persona, conocidos también como TPS (third person shooter), se basan en la alternancia entre disparos y pelea o interacción con el entorno, pero a diferencia de los juegos de mira (primera persona), se juega con un personaje visto desde atrás o, en ocasiones, desde una perspectiva isométrica.\n\nDentro de esta clasificación, ha tomado fuerza un nuevo grupo de subgénero, el cual a pesar de ser tercera persona y ser de disparos, no se limita a ser un shooter. El famoso Grand Theft Auto es uno de esos títulos, a los que también se les denomina como juegos de mundo libre o de acción-aventura, en los que el jugador hace cosas diversas aparte de disparar, como pueden ser explorar, conducir, interactuar con otros personajes, etc.\n\nEjemplos: BloodRayne, Fortnite, Mafia: The City of Lost Heaven, Magic Carpet, GunZ The Duel, Max Payne, Oni, Tomb Raider, The Suffering, Syphon Filter, No More Heroes, Gears of War, Dead Space, Uncharted y No More Heroes: Desperate Struggle.\n\n"}, {"name": "Matamarcianos", "text": "El Matamarcianos es un tipo de juego de disparos con perspectiva en dos dimensiones, donde habitualmente manejamos una nave espacial (en los juegos conocidos popularmente como «matamarcianos»), aunque también puede ser otro tipo de vehículo o un personaje.\nSon características de este género el uso continuo de los disparos, los distintos tipos de armas, o la mejora de las disponibles, avance automático (scroll) vertical o lateral, y enfrentamientos con jefes de gran tamaño al final de cada misión.\n\nAun siendo juegos en 2D, a veces se incluyen o combinan elementos 3D para dar efectos de profundidad, explosiones o mayor efecto visual, sobre todo con los enemigos jefes.\n\nEjemplos: Space Invaders, Gradius, R-Type, Darius. \n\nRun and Gun\nLos run and gun son videojuegos derivados de los matamarcianos, con la diferencia que en este caso los jugadores deben combatir con un gran número de individuos mientras avanzan a lo largo de varios niveles, desplazándose por escenarios vistos normalmente en perspectiva lateral. Los enfrentamientos suelen ser con el uso de armas de fuego, aunque no es infrecuente el enfrentamiento cuerpo a cuerpo.\n\nEn estos juegos suele ser posible jugar dos o más personas a la vez de forma cooperativa para facilitar el progreso.\n\nEjemplos: \"Contra\", \"Gunstar Heroes\", \"Metal Slug\".\n\n"}]}, {"name": "Estrategia", "text": "Se caracterizan por la necesidad de manipular a un numeroso grupo de personajes, objetos o datos, haciendo uso de la inteligencia y la planificación, para lograr los objetivos. Aunque la mayoría de estos juegos son fundamentalmente de temática bélica, los hay también de estrategia económica, empresarial o social.\n\nDos grandes subgéneros son los juegos de estrategia en tiempo real (también llamados RTS, siglas en inglés de real-time strategy), y los por turnos (TBS, siglas también en inglés de turn based strategy).\n\n", "subsections": [{"name": "Estrategia en tiempo real", "text": "Pertenecen a esta modalidad Age of Empires, Age of Mythology, StarCraft, Command & Conquer, Endwar, Warcraft, Empire Earth, Halo Wars, Imperivm, Europa Universalis, Stronghold, Rise of Nations, y juegos de estrategia histórica como el Cossacks o el Blitzkrieg.\n\nUna variante popular de este subgénero en la actualidad son los videojuegos de estrategia en tiempo real multijugador en línea (MMORTS). Algunos ejemplos: KingsAge, Travian, OGame, Stronghold Kingdoms, Age of Empires Online, Kingdoms of Camelot, Forge of Empires, Clash of Clans, Game of War, Total War: Arena.\n\n"}, {"name": "Estrategia por turnos", "text": "Dentro de esta variante encontramos juegos como Civilization, Dofus, Heroes of Might and Magic, Warlords, Advance Wars, Fire Emblem, la serie Total War (esta última dispone de un mapa de batalla en tiempo real) y Final Fantasy Tactics.\n\n"}, {"name": "Otros subgéneros", "text": "Otros subgéneros destacables dentro de los videojuegos de estrategia son los siguientes:\n\nTáctica en tiempo real. Ejemplos: la serie Total War, Commandos, Warhammer: Mark of Chaos.\nTáctica por turnos. Ejemplos: X-Com, Final Fantasy Tactics.\nGuerra (llamados también wargames). Ejemplos: Panzer General, Close Combat, Combat Mission.\nConstrucción de imperios (llamados también 4X). Ejemplos: Civilization, Age of Empires, Galactic Civilizations, VGA Planets, Rome: Total War.\nArtillería. Ejemplos: Worms, Scorched Earth, Gunbound, Angry Birds.\nVideojuego multijugador de arena de batalla en línea (MOBA). Ejemplos: League of Legends, Defense of the Ancients (DotA), SMITE (Campo de batalla de los dioses).\nTower defense. Ejemplos: Desktop Tower Defense, Plants vs. Zombies, Kingdom Rush.\nGestión del tiempo. Ejemplos: Flight Control, Kingdom Chronicles, Diner Dash, Airport Mania.\nAcción táctica. Ejemplos: Mount&Blade y la saga Rainbow Six.\n"}]}, {"name": "Simulación", "text": "Este género se caracteriza por recrear situaciones o actividades del mundo real, dejando al jugador tomar el control de lo que ocurre. En ocasiones la simulación pretende un alto grado de verosimilitud, lo que le otorga una componente didáctica. Los tipos de simulación más populares son los de manejo de vehículos (pilotar un coche, un avión, un tren...), los de construcción (construir una ciudad, un parque de atracciones o un imperio), o los de vida (dirigir la vida de una persona o un animal virtual).\n\n", "subsections": [{"name": "Simulación de vehículos", "text": "Son videojuegos que permiten al jugador operar una variedad de vehículos de forma más o menos realista. Los que gozan de mayor popularidad son los simuladores de conducción (generalmente de carreras de coches, considerados en sí mismos como uno de los grandes géneros de videojuegos), los videojuegos de combate en vehículos, y los simuladores de vuelo.\n\nSimuladores de conducción o de carreras (ver sección propia más abajo): EuroTruck Simulator, Gran Turismo, Colin McRae Rally, Need for Speed, Real Racing, rFactor.\nSimuladores de vuelo:  Microsoft Flight Simulator, X-Plane.\nSimuladores de vuelo de combate: Lock On: Modern Air Combat, IL-2 Sturmovik.\nSimuladores de combate en vehículos (habitualmente son considerados como juegos de acción):\nAutomóviles: Carmageddon, Mario Kart.\nTanques: Battlezone, World of Tanks, Panzer Front.\nBarcos y submarinos: Silent Hunter, Aquanox.\nNaves espaciales: Star Wars X-Wing, Wing Commander.\nMechas (robots): MechWarrior.\nSimuladores ferroviarios: Microsoft Train Simulator, Rail Simulator o BVE Trainsim.\nSimuladores náuticos: Virtual Sailor, Ship Simulator.\nSimuladores de submarinos: Silent Hunter o Forever Blue.\n"}, {"name": "Simulación de construcción", "text": "Los juegos de construcción (o de construcción y gestión) son un género muy popular en PC, donde el programa le proporciona al usuario todas las herramientas para construir un proyecto, en el cual se consideran desde gastos de construcción y mantenimiento, hasta una línea de tiempo, física y clima que afecta todas las decisiones que tome. La particularidad de poder experimentar, tomar decisiones y afectar el desempeño de la simulación, los hace tremendamente adictivos.\n\nPueden distinguirse varios subgéneros:\n\nConstrucción de ciudades: SimCity y Cities: Skylines, donde el usuario toma el rol de alcalde y debe administrar una ciudad.\nConstrucción de imperios: cabe destacar la serie Civilization, Total War y The Settlers. Suelen de todos modos asociarse más comúnmente al género de estrategia.\nConstrucción sandbox: caracterizados por una gran libertad creativa y desarrollo no lineal. Ejemplo: Minecraft, \"Terraria\".\nSimulación económica o empresarial: Capitalism, Transport Tycoon, Anno.\nSimulación de dios: Populous: The Beginning, Black & White.\nSimulación política: Democracy.\nSimulación de granja: FarmVille, Stardew Valley\nSimulación de gestión deportiva: PC Fútbol, Football Manager.\nSimulación de zoológico: Zoo Tycoon 2, Zoo Tycoon o Wildlife Park 2.\nSimulación de parque de atracciones: RollerCoaster Tycoon, Theme Park o Thrillville.\n"}, {"name": "Simulación de vida", "text": "Son videojuegos en los que el jugador controla una o más formas de vida artificial, ya sea de seres humanos o de animales. Cabe distinguir tres subgéneros principales:\n\nLos videojuegos de simulación social: se enfocan en controlar un personaje con capacidades y emociones humanas, y controlar todos los aspectos de su vida, desde donde vivirá, que estudiará, hasta con quien se casará. El realismo colocado en estos juegos y una línea de tiempo que permite al personaje evolucionar, comer, dormir, convivir con otras personas, envejecer e incluso morir, hace que muchas personas tomen estos juegos como desahogo de todo lo que quisieran experimentar en su vida propia, pero sin riesgos. El juego más popular en este género es el The Sims, del cual se han lanzado muchas expansiones, y en el que se permite incorporar al juego principal elecciones como aprender magia, convertirse en una estrella de cine, tener citas, adoptar una mascota o tener y criar un hijo.\nLos videojuegos de mascotas virtuales: en ellos debemos cuidar diariamente a un animal de compañía. A diferencia de los videojuegos de simulación biológica, la mascota generalmente no se reproduce ni muere. Ejemplos: Tamagotchi, Petz, Nintendogs, Pou.\nLos videojuegos de simulación biológica: habitualmente simulan ecosistemas enteros controlados por el jugador donde los organismos pueden evolucionar; por ejemplo el juego SimLife, donde asumimos el papel de un dios biológico de un planeta similar a la Tierra, o Evolution: The Game of Intelligent Life. En otros juegos asumimos la vida de un animal individual, como por ejemplo Spore (un juego de 2008 donde se comienza siendo una bacteria, y dependiendo de las decisiones tomadas por el jugador, la criatura puede evolucionar de formas casi infinitas), y otros como Wolf,  Lion, o el humorístico Goat Simulator. Otro ejemplo distinto es el Animal Crossing de Nintendo, un juego donde el personaje convive en un pueblo con sus habitantes, (que prácticamente son animales, de ahí el nombre), aunque el sentido de exploración es muy limitado.\n"}, {"name": "Simulación de combate", "text": "Género que recrea situaciones de guerra más allá de lo que lo puedan hacer los populares videojuegos de disparos. Se caracteriza por el elevado realismo en todos los aspectos relevantes, ya sea en el manejo de un soldado, una cuadrilla militar. Un destacado exponente de este subgénero lo encontramos en Operation Flashpoint: Cold War Crisis y su secuela Armed Assault.[cita requerida] Ambos son juegos en los que un solo pero certero disparo significa la muerte, el movimiento de los personajes o el comportamiento del armamento tratan de ser absolutamente realistas. El primero de estos juegos cuenta con una modificación denominada VBS1, que se ha destinado al entrenamiento táctico de algunos cuerpos de élite de ejércitos como el de Estados Unidos o Australia.\n\n"}, {"name": "Otros", "text": "Otros subgéneros dentro de los videojuegos de simulación son:\n\nSimuladores médicos: Trauma Center: Under the Knife, Surgeon Simulator.\nSimuladores de citas: Tokimeki Memorial.\nSimuladores de caza: Deer Hunter.\nSimuladores de trabajo: Street Cleaning Simulator, Crane Simulator.\n"}]}, {"name": "Deporte", "text": "Los videojuegos de deportes son aquellos que simulan deportes del mundo real. Entre ellos encontramos golf, tenis, fútbol, hockey, juegos olímpicos, etc. La mecánica del juego es la misma que en el deporte original, aunque a veces incorpora algunos añadidos.\n\nPueden subdividirse en los siguientes tipos: arcade, simulador, mánager y RPG deportivo. Entre los ejemplos más conocidos encontramos:\n\nTenis: Super Tennis, Mario Tennis, Virtua Tennis.\nFútbol: Pro Evolution Soccer, FIFA, PC Fútbol, Mario Strikers: Charged Football.\nBaloncesto: NBA Live, NBA Jam, NBA 2K .\nFútbol americano: Madden NFL, Tecmo Super Bowl.\nBéisbol: Bases Loaded, Triple Play, MLB: The Show.\nSkate: Tony Hawk's Pro Skater, Skate\nGolf: Mario Golf, Everybody´s Golf, NES Open Tournament Golf.\nVarios: Mario & Sonic en los Juegos Olímpicos, Wii Sports,Wii Sports Resort, Nintendo Switch Sports, California Games\nOtros: Wii Fit\nMuchos videojuegos de deportes suelen tener revisiones anuales que incluyen pequeñas mejoras y la actualización de las plantillas de los equipos. Ejemplo de ellos son franquicias establecidas como Pro Evolution Soccer, NBA Live o Madden NFL. En grandes eventos deportivos, como los Juegos Olímpicos o el Mundial de Fútbol, suelen lanzarse al mercado videojuegos basados en dichos eventos para aprovechar comercialmente su popularidad.\n\n", "subsections": []}, {"name": "Carreras", "text": "A veces considerados como una subcategoría dentro de los videojuegos de deportes o los de simulación, los videojuegos de carreras o de conducción sitúan al jugador en un recorrido en el que debe llegar a una meta antes que sus contrincantes o dentro de un tiempo límite. Habitualmente el jugador maneja un vehículo a motor, como un coche, aunque existen otras posibilidades.\n\nAlgunos de estos juegos recrean circuitos de competición existentes en el mundo real, ya sea de Fórmula 1, motociclismo, etc.\n\nSegún el nivel de fidelidad a lo que es la conducción en el mundo real, dentro de este género se suelen distinguir dos variantes: arcade y simuladores.\n\nArcade: Mario Kart, Out Run, Crash Team Racing, F-Zero, Need for Speed, Midnight Club, Sonic & Sega All-Stars Racing, Trackmania.\nSimuladores: Gran Turismo, Project Gotham Racing, rFactor, Forza Motorsport, Toca, GTR, Colin McRae Rally, Need for Speed, Real Racing, Project CARS, Race 07, Assetto Corsa.\n", "subsections": []}, {"name": "Aventura", "text": "Son videojuegos en los que el protagonista debe avanzar en la trama interactuando con diversos personajes y objetos.\n\n", "subsections": [{"name": "Aventura conversacional", "text": "Los videojuegos de aventura fueron, en cierto modo, los primeros videojuegos que se vendieron en el mercado, empezando por Colossal Cave Adventure en los años 1970. Este tipo de juego se hizo famoso con los juegos de la saga Zork y consiguió alcanzar cierto nivel de popularidad en los años 80 que duró hasta mediados de los 90. El jugador encarna a un protagonista que por lo general debe resolver incógnitas y rompecabezas con objetos diversos. Los primeros videojuegos de aventura eran textuales (aventuras textuales, aventura conversacional o ficción interactiva). En estos, el jugador utiliza el teclado para introducir órdenes como “agarrar la cuerda” o “ir hacia el oeste” y el ordenador describe lo que pasa.\n\nCuando el uso de gráficos se generalizó, los juegos de aventura textuales dejaron paso a los visuales (por ejemplo, con imágenes del lugar presente) que substituyeron de este modo las descripciones por texto, que se habían vuelto casi superfluas. Estos juegos de aventura con gráficos seguían, no obstante, sirviéndose de la introducción de texto. Además, sigue existiendo una comunidad de autores y jugadores activos de ficción interactiva (véase la web del CAAD para el mundo hispanoparlante), aunque la participación de grandes empresas comerciales es más bien rara.\n\nUna variante moderna de las aventuras conversacionales, muy popular en Oriente, son las novelas visuales, relatos en forma de diálogo acompañados de imágenes, a menudo del género anime, en los que la jugabilidad se limita a tomar ocasionales decisiones al estilo de los libros de Elige tu propia aventura.\n\nOtra variante con una jugabilidad similar a las novelas visuales, pero con imágenes de vídeo en vez de estáticas, son las películas interactivas, en las que las decisiones del jugador van modelando el desarrollo de la trama, lo que le conducirá a distintos desenlaces en cada caso.\n\n"}, {"name": "Aventura gráfica", "text": "A comienzos de los 1990, el uso creciente del ratón dio pie a los juegos de aventura de tipo «Point and click», también llamados aventura gráfica, en los que ya no se hacía necesaria la introducción de comandos. El jugador puede, por ejemplo, hacer clic con el puntero sobre una cuerda para recogerla.\n\nA finales de los 1990, este tipo de juego sufrió una importante pérdida de popularidad, las presentaciones de productos de masas se hicieron raras, hasta el punto que hubo quienes predijeron la muerte de este tipo de videojuegos. No obstante, en 2005, los juegos de aventura experimentaron un retorno con títulos como The Moment of Silence, The Black Mirror, Sherlock Holmes: The Case of the Silver Earring o NiBiRu: Age of Secrets. Los grandes juegos de aventura de la historia incluyen títulos como Day of the Tentacle, los juegos de la serie King's Quest, la serie Leisure Suit Larry, la serie Broken Sword, la serie Gabriel Knight, la serie Police Quest, la serie Space Quest y los de Monkey Island.\n\nHe aquí otros ejemplos de juegos de aventura de LucasArts: Indiana Jones and the Fate of Atlantis (1992), Maniac Mansion (1987), The Dig (1995), Full Throttle (1995), Mundodisco, Grim Fandango (1998) y Sam & Max Hit the Road (1993), y Runaway de Dinamic Multimedia (2001), Lure of the Temptress de Virgin Interactive (1992), Syberia y Syberia II ambos de Microïds (2003 y 2004, respectivamente), y la serie The Legend of Kyrandia de Cing Another Code: Two Memories (2005), y Hotel Dusk: Room 215 (2007).\n\nPor último, en la década de 2010 toma cuerpo un nuevo subgénero de avengura gráfica conocido como juegos de exploración o walking simulators, caracterizados por un gran enfoque en la narración, fundamentalmente lineal, y una interactividad mínima, limitada a la búsqueda de objetos que permiten proseguir el relato o la resolución de algunos puzles. Títulos destacados de esta variedad son por ejemplo Dear Esther, Gone Home o Firewatch.\n\n"}, {"name": "Acción-aventura", "text": "Se trata de un género mixto, altamente popular, de juegos con un planteamiento similar a los de aventura pero en los que hay un fuerte componente de acción.\nEjemplos: The Legend of Zelda, Tomb Raider, Uncharted, The Last of Us,  Grand Theft Auto, Prince of Persia, Soul Reaver, God of War, Batman: Arkham, Enter The Gungeon y Assassin's Creed.\n\nMuchos de estos juegos se pueden encuadrar también dentro de los juegos de disparos en tercera persona.\n\nAdicionalmente, cabe destacar dos subgéneros populares que mezclan también acción y aventura, como son los Terror y supervivencia y los juegos de sigilo:\n\nTerror y supervivencia\nCorrespondientes al género de terror. El/los protagonistas viven aventuras donde deben salir airosos de situaciones típicas de una película de terror (escapar de una casa llena de zombis, huir de un asesino, resolver misterios para aplacar a los fantasmas, etc.). Un factor importante es el terror psicológico, ayudado de una buena ambientación y apartado sonoro. Cabe destacar que el término \"Terror y supervivencia\" nace de la desarrolladora Capcom y su saga Resident Evil, que si bien no fueron los primeros juegos de este género, sí dieron nacimiento al nombre del mismo.\n\nEjemplos: Obscure, Nightmare Creatures II, Project Zero/Fatal Frame, Dino Crisis, Parasite Eve, Manhunt, Resident Evil, Clock Tower, Silent Hill, Alone in the Dark, Dead Space, Dead Rising, Left 4 Dead, Amnesia: The Dark Descent, ZombiU, The Last of Us, Outlast o The Evil Within.\n\nSigilo\nLos videojuegos de sigilo son un género relativamente reciente. Aunque la primera entrega de la serie Metal Gear, la abanderada de este género, apareció en 1987, el género de la infiltración no se popularizó hasta la salida de Metal Gear Solid en 1998. Estos videojuegos se basan en el sigilo, la furtividad y la estrategia en vez de buscar la confrontación directa con el enemigo.\n\nA veces los videojuegos de sigilo aparecen como un subgénero de los videojuegos de disparos, aunque podemos encontrar videojuegos como Commandos, que se puede clasificar a la vez como juego de estrategia y de infiltración.\n\nEjemplos: Metal Gear, Splinter Cell, Hitman, Thief: The Dark Project, Beyond Good & Evil, Assassin's Creed, Watch Dogs.\n\nBattle Royale\nEs un género de videojuegos que combina los elementos de un videojuego de supervivencia con la jugabilidad de un último jugador en pie. Los videojuegos tipo battle royale desafían a un grupo de jugadores, comenzando con un equipamiento mínimo, a que busquen armas y eliminen a otros oponentes, mientras evitan quedar fuera de un \"área segura\" (el campo de juego, que se hace cada vez más pequeño), siendo el ganador el último jugador en pie. \n\nEjemplos: Fortnite, PlayerUnknown's Battlegrounds, Apex Legends.\n\n"}]}, {"name": "Rol", "text": "Emparentados con los de aventura, los videojuegos de rol, o RPG, se caracterizan por la interacción con el personaje, una historia profunda y una evolución del personaje a medida que la historia avanza. Para lograr la evolución generalmente se hace que el jugador se enfrasque en una aventura donde irá conociendo nuevos personajes, explorando el mundo para ir juntando armas, experiencia, aliados e incluso magia. Es habitual, desde la aparición del CD-ROM, la inclusión de videos (cinemáticas) durante el juego, que complementan la narración de la historia y hacen que el jugador se sienta como dentro de una película.\n\nAunque la mayoría de juegos de aventura incluyen una dosis baja de RPG, los videojuegos de rol puros se enfocan específicamente en ir agrandando las habilidades y experiencia del protagonista, y en su alto grado de personalización. Por ejemplo en juegos como la saga The Elder Scrolls, el crear y personalizar el personaje que vamos a manejar puede llevar desde 10 minutos hasta 30 horas.\n\nLos RPG clásicos, inspirados en los juegos de tablero, realizan las batallas por turnos, es decir, el jugador usa su equipo y habilidades aprendidas para atacar mediante una serie de comandos y después debe quedar estático y esperar a recibir el ataque del otro jugador o CPU. El mejor ejemplo de esto es Final Fantasy, Dungeons & Dragons y Pokémon. Esta modalidad por turnos ha caído sin embargo en desuso, y la mayoría de los juegos de rol actuales usan el combate en tiempo real, es decir, no hay pausas y ambos rivales se atacan al mismo tiempo.\n\nEn cuanto a la temática, aunque la mayoría de juegos de rol son de fantasía medieval, son numerosos también los de ambientación futurista o distópica (por ejemplo los de la saga de Star Wars, Mass Effect o Fallout).\n\nUna variante moderna de los videojuegos de rol son los RPG en línea o MMORPG (Massive Multiplayer Online RPG) donde cada jugador crea un personaje y, mediante una conexión a internet, entra a un mundo donde miles de jugadores se unen a la aventura, exploran, intercambian y evolucionan juntos. Destaca por su popularidad en este subgénero el juego World of Warcraft. Son juegos conocidos por lo adictivos que acostumbran a ser, además de la gran cantidad de cultura popular que suelen generar a su alrededor.\n\nDentro de los videojuegos de rol se pueden destacar los siguientes subgéneros y títulos representativos:\n\nVideojuegos de rol puro: suelen distinguirse dos tipos según la perspectiva visual que adoptan:\nVista en tercera persona: Bloodborne, Dark Souls, Baldur's Gate, Fable, Final Fantasy, Lost Odyssey, IceWind Dale, Neverwinter Nights, Dragon Age: Origins, Gothic, The Witcher, Pokémon, Knights of the Old Republic y Dragon Quest.\nVista en primera persona: Skyrim, The Elder Scrolls, Fallout (estos tres admiten también vista en tercera persona), la serie Eye of the Beholder, Bard's Tale (1985) y Ultima Underworld 1 y 2.\nVideojuegos de rol-acción:  Diablo, Fallout, Dungeon Siege, Sacred, Kingdom Hearts, Silver, The Last Story, Mass Effect, Pandora's Tower, Xenoblade Chronicles.\nVideojuegos MMORPG (videojuegos de rol multijugador masivo en línea): Ragnarok Online, Grand Chase, Elsword, Everquest, Ultima Online, Granado Espada, World of Warcraft, Lineage, Lineage II, Star Wars Galaxies, Maple Story, Mu Online, Rakion, Runescape, Metin2, 4Story, Grand Fantasia, Aura Kingdom, Guild Wars 2, FF XI, Warhammer online, EVE.\nVideojuegos de rol tácticos: X-COM: UFO Defense, Sonic Chronicles: The Dark Brotherhood, Final Fantasy Tactics, Ogre Battle, Advance Wars y Fire Emblem\nRoguelike: Rogue, NetHack, Pokémon Mundo Misterioso: Equipo de Rescate Azul, DoomRL.\n", "subsections": []}, {"name": "Otros géneros destacables", "text": "", "subsections": [{"name": "Sandbox", "text": "Muchas veces confundido con los mundos virtuales (como Second Life o Habbo), los sandbox son aquellos en los cuales se comienza prácticamente desde cero, creando prácticamente todo lo necesario para avanzar y transformar un mundo virtual propio. Son videojuegos no lineales, porque no tienen una línea de juego apenas definida, el orden de las acciones permite la mayor libertad según la presente clasificación. Eso no impide que puedan definirse unos objetivos para guiar al jugador, quien puede optar por ignorarlos. Una de las características esenciales de un juego sandbox es que al jugador se le dan muy pocas limitaciones, y este es capaz de alterar y/o modificar el entorno del juego\n\nLos ejemplos más conocidos y evidentes de este género son juegos de construcción:  No Man's Sky, Valheim, Minecraft, Terraria, SimCity, 7 Days To Die, Ark: Survival Evolved, Starbound y Garry's Mod. No obstante, se utiliza muchas veces sandbox como calificativo para referirse a juegos que presentan dichas cualidades de libertad de acción, no linearidad, etc. Así ocurre por ejemplo en ciertos juegos (como el Grand Theft Auto, Red Dead Redemption, The Witcher o Roblox ).\n\n"}, {"name": "Musical", "text": "Su desarrollo gira en torno a la música, ya sean de tipo karaoke, de baile o en los que se tocan instrumentos musicales. La mayoría de estos juegos se caracterizan por necesitar accesorios especiales compatibles con las consolas y por ofrecer modo multijugador, en el que los jugadores intentan conseguir el mayor número de puntos posible por medio de su actuación.\n\nKaraoke: Juegos de karaoke son el Singstar para PS2, PS3, UltraStar para PC, y también otros títulos como Karoke Revolution disponible para varias plataformas. Estos títulos necesitan un micrófono, con el cual los jugadores deben cantar la letra de la canción para obtener puntos.\nBaile: Entre los juegos de baile se pueden tomar en cuenta Dance Central, de Xbox 360, que usa la tecnología Kinect para captar los movimientos de los jugadores, y los juegos de la serie Dance Dance Revolution, Pump It Up , Just Dance o StepMania, que pueden ser jugados con un mando/teclado pero realizan su jugabilidad con paneles de baile, formados por flechas que han de ser pisadas en el momento indicado por la canción del juego.\nInstrumentos musicales: Rock Band, Guitar Hero o DJ Hero han revolucionado el género por medio de sus periféricos en forma de instrumentos musicales, como la guitarra, la batería o una mesa de mezclas. Los jugadores pueden tomar el papel de un instrumentista, un DJ o formar en conjunto una banda. Siguiendo las combinaciones de colores que aparecen en pantalla, los jugadores deben tocar en sus instrumentos, las teclas o los platos con los respectivos colores. En Rock Band y en nuevos títulos de Guitar Hero se puede cantar con un micrófono.\nOtros juegos musicales': Bust a Groove, Beatmania, Electroplankton, Space Channel 5, Elite Beat Agents, Geometry Dash, Friday Night Funkin.\n"}, {"name": "Agilidad mental / Puzle", "text": "Los juegos de lógica o de agilidad mental, también llamados de puzles o rompecabezas, ponen a prueba la inteligencia del jugador para la resolución de problemas, que pueden ser de índole matemático, espacial o lógico.\n\nExiste una gran variedad dentro de los juegos este género; algunos se enfocan en la rapidez mental del jugador (juegos de lógica-acción), otros en la capacidad de razonamiento (juegos de física, o de acertijos), otros en la capacidad de observación (juegos de objetos ocultos), etc.\n\n\nEjemplos: Brain Age, Brain Academy, Tetris, Buscaminas, Profesor Layton, Ace Attorney, Flash Focus Vision, Qix, Bejeweled, Zuma, Candy Crush, Notpron, Análogos dimensionales del Cubo de Rubik.\n\n"}, {"name": "Party games", "text": "En este género los jugadores habrán de ir avanzando por turnos en un tablero virtual e ir superando diversas pruebas de tipos muy diversos en los que compiten entre sí por llegar lo antes posible a la meta, o conseguir la máxima cantidad posible de puntos.\n\nEjemplos: Mario Party, Rayman Raving Rabbids, Sonic Shuffle, Viva Piñata: Party Animals, Wii Play, Fortune Street, Wario Ware, Crash Bash, Wii Party, Fuzion Frenzy, Among Us, Human fall flat.\n\n"}, {"name": "Educación", "text": "Los juegos educativos son aquellos dirigidos a aportar unos conocimientos o habilidades al jugador durante el transcurso del mismo. Se combina así formación con entretenimiento. Existen los claramente diseñados para una función didáctica, orientados normalmente a niños, pero se consideran también a veces como educativos ciertos juegos de construcción de imperios o ciudades (por ejemplo el Civilization o el SimCity) en los que el jugador, sin ser ese su objetivo principal, adquiere conocimientos del mundo real relacionados con esas áreas.\n\nEjemplos de videojuegos educativos infantiles: Fine Artist, El autobús mágico.\n\n\n\n"}]}, {"name": "Tipos de videojuegos", "text": "Más allá de la clasificación de los videojuegos por géneros −en los cuales se atiende fundamentalmente a su mecánica de juego−, se pueden distinguir varios tipos de videojuegos atendiendo a otras características, como es si admiten varios jugadores o no, a qué público van dirigidos, su finalidad, la tecnología que emplean, etc.\n\nJuegos arcade: juegos caracterizados por una jugabilidad simple, repetitiva y de acción rápida que los hace típicos de las máquinas recreativas. Son juegos arcade la mayoría de los Yo contra el barrio, marcianitos y plataformas.\nJuegos multijugador: aquellos concebidos para albergar más de un jugador simultáneamente en la misma partida, ya jueguen de manera colaborativa o competitiva entre sí, como por ejemplo Fortnite o Pummel Party)\nJuegos en línea: son aquellos jugados vía internet independientemente de la plataforma. Puede tratarse de videojuegos multijugador, en los que se juega con otras personas físicamente distantes, o videojuegos de navegador (sean multijugador o no) que se descargan desde la web y se ejecutan en el navegador.\nJuegos MMO: son los que, combinando las dos características anteriores (ser multijugador y en línea), reúnen a un gran número de jugadores, a menudo de manera asíncrona, en lo que puede ser un mundo persistente. Existen MMOs de rol (MMORPG), de estrategia (MMORTS) y de otros géneros.\nJuegos sociales: aquellos que se juegan a través de redes sociales, y/o haciendo uso de algunas características de estas. Suelen ser juegos de navegador, aunque también los hay que son aplicaciones autónomas.\nJuegos de navegador: son aquellos que se ejecutan en un navegador web, empleando tecnologías web estándar (HTML, Javascript, CSS, PHP...) o plugins de navegador (habitualmente Flash o Java). Debido a esto son juegos multiplataforma, funcionales en diversos tipos de dispositivos que dispongan de un navegador estándar. Estos juegos suelen ser gratuitos y los hay de todos los géneros.\nJuegos educativos: pueden pertenecer a cualquier género, aunque los más habituales son los de preguntas y respuestas o los de aventura gráfica.\nJuegos serios: aquellos cuyo propósito principal es distinto del mero entretenimiento. Esto incluye (pero no se limita a) juegos destinados a la formación en materias profesionales (empresa, defensa, medicina...).\nJuegos publicitarios (advergames)\nJuegos de terror\nJuegos artísticos\nJuegos infantiles\nJuegos no lineales\nJuegos de mundo abierto (o sandbox)\nMinijuegos\nJuegos casuales\nJuegos AAA\nJuegos indie\nJuegos retro\nFangames\nExergames\nDeportes electrónicos\nJuegos eróticos\nJuegos geolocalizados\nJuegos de realidad aumentada\nJuegos de realidad virtual\nJuegos free to play / pay to play / freemium\n", "subsections": []}, {"name": "Véase también", "text": " Portal:Videojuegos. Contenido relacionado con Videojuegos.\nIndustria de los videojuegos\n", "subsections": []}, {"name": "Referencias", "text": "↑ a b Apperley, Thomas H. (2006). «Genre and game studies» (PDF). Simulation & Gaming (en inglés) (1 edición) 37: 6-23. doi:10.1177/1046878105282278. Archivado desde el original el 10 de mayo de 2013. Consultado el 1 de abril de 2020. \n\n↑ Adams, Ernest (9 de julio de 2009). «Background: The Origins of Game Genres». Gamasutra (en inglés). Archivado desde el original el 17 de diciembre de 2014. Consultado el 1 de abril de 2020. \n\n↑ Adams, Ernest; Rollings, Andrew (2006). Fundamentals of Game Design (en inglés). Prentice Hall. p. 67. ISBN 9780133435719. Consultado el 1 de abril de 2020. \n\n↑ Harteveld, Casper (26 de febrero de 2011). Triadic Game Design: Balancing Reality, Meaning and Play (en inglés). Springer Science & Business Media. p. 71. ISBN 1849961573. Consultado el 1 de abril de 2020. \n\n↑ 1950-, Crawford, Chris, (1984). The art of computer game design. Osborne/McGraw-Hill. ISBN 0881341177. OCLC 10277416. \n\n↑ Greg Kasavin (30 de noviembre de 2006). «Golden Axe Review». GameSpot. Archivado desde el original el 4 de febrero de 2009. Consultado el 7 de octubre de 2008. \n\n↑ Patrick Shaw (16 de mayo de 2008). «Golden Axe: Beast Rider». GamePro. Archivado desde el original el 17 de octubre de 2008. Consultado el 7 de octubre de 2008. \n\n↑ «Is Dante's Inferno Divine or a Comedy of Errors?» (en inglés). UGO Networks. 9 de febrero de 2010. Archivado desde el original el 5 de noviembre de 2013. Consultado el 14 de marzo de 2018. \n\n↑ Freeman, Will (4 de septiembre de 2007). «Heavenly Sword Review» (en inglés). VideoGamer. Consultado el 14 de marzo de 2018. \n", "subsections": []}]}
