{"url": "https://es.wikipedia.org/wiki/Python", "title": "Python", "summary": "\n\n[\n]\nPython es un lenguaje de alto nivel de programación interpretado cuya filosofía hace hincapié en la legibilidad de su código. Se trata de un lenguaje de programación multiparadigma, ya que soporta parcialmente la orientación a objetos, programación imperativa y, en menor medida, programación funcional. Es un lenguaje interpretado, dinámico y multiplataforma.\n\nAdministrado por Python Software Foundation, posee una licencia de código abierto, denominada Python Software Foundation License.[3]​ Python se clasifica constantemente como uno de los lenguajes de programación más populares.[4]​\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Características y paradigmas", "text": "", "subsections": []}, {"name": "Filosofía", "text": "", "subsections": []}, {"name": "Modo interactivo", "text": "", "subsections": []}, {"name": "Elementos del lenguaje y sintaxis", "text": "", "subsections": []}, {"name": "Sistema de objetos", "text": "", "subsections": []}, {"name": "Biblioteca estándar", "text": "", "subsections": []}, {"name": "Implementaciones", "text": "", "subsections": []}, {"name": "Incidencias", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Bibliografía", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/ABC_(lenguaje_de_programaci%C3%B3n)", "title": "ABC (lenguaje de programación)", "summary": "ABC es un lenguaje de programación imperativo de propósito general y entorno de programación desarrollado en el Centrum Wiskunde & Informatica de Países Bajos por Leo Geurts, Lambert Meertens y Steven Pemberton. Es interactivo, estructurado, de alto nivel y está pensado para ser utilizado en lugar de BASIC, Pascal o AWK. No pretende ser un lenguaje de programación de sistemas, sino que está destinado a la enseñanza o la creación de prototipos.\n\nEl lenguaje tuvo una gran influencia en el diseño del lenguaje de programación Python; Guido van Rossum, quien desarrolló Python, trabajó anteriormente durante varios años en el sistema ABC a mediados de los años ochenta.[1]​[2]​\n\n", "sections": [{"name": "Características", "text": "", "subsections": []}, {"name": "Ejemplo", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Amoeba_(Inform%C3%A1tica)", "title": "Amoeba (sistema operativo)", "summary": "Amoeba es un sistema operativo distribuido de investigación, basado en una arquitectura de micronúcleo. Fue desarrollado por Andrew S. Tanenbaum y otros en la Universidad Libre de Ámsterdam. El objetivo del proyecto Amoeba era construir un sistema de tiempo compartido que hiciera que una red entera de computadores pareciera a los ojos de un usuario como una máquina única.\n\nLos servicios suministrados por el núcleo incluyen threads, segmentos de memoria, mecanismos de IPC (RPCs y mensajes) y E/S [160]. \n\nEl desarrollo parece detenido, dado que la fecha de la última modificación en el código data de febrero de 2001.\n\nExisten versiones para varias plataformas, incluyendo i386, Sun-3 y SPARC.\n\nEl lenguaje de programación Python fue originalmente desarrollado para esta plataforma.\n\n", "sections": [{"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Apache_Software_Foundation", "title": "Apache Software Foundation", "summary": "\n \nApache Software Foundation (ASF) es una organización sin fines de lucro (una fundación) creada para dar soporte a los proyectos de software bajo la denominación Apache, incluyendo el popular servidor HTTP Apache. La ASF se formó a partir del llamado Grupo Apache y fue registrada en Delaware (Estados Unidos), en marzo de 1996.[1]​\n\nApache Software Foundation es una comunidad descentralizada de desarrolladores que trabajan cada uno en sus propios proyectos de código abierto. Los proyectos Apache se caracterizan por un modelo de desarrollo basado en el consenso y la colaboración y en una licencia de software abierta y pragmática. Cada proyecto es gestionado por un grupo autoseleccionado de expertos técnicos que son participantes activos en dicho proyecto. La ASF es una meritocracia, de lo que se deriva que la pertenencia a la fundación se permite solo a voluntarios que hayan contribuido significativamente a proyectos Apache.\n\nEntre los objetivos de la ASF se encuentran el de proporcionar protección legal a los voluntarios que trabajan en proyectos Apache, y al propio nombre Apache de ser empleado por otras organizaciones. El proyecto Apache es el origen de la Licencia Apache y de todas las licencias que siguen un esquema similar (llamadas licencias \"estilo Apache\").\n\n", "sections": [{"name": "Financiación", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Aprendizaje_autom%C3%A1tico", "title": "Aprendizaje automático", "summary": "El aprendizaje automático (AA); también llamado automatizado, computacional o de máquinas (del inglés machine learning, ML), es el subcampo de las ciencias de la computación y una rama de  la inteligencia artificial, cuyo objetivo es desarrollar técnicas que permitan que las computadoras aprendan. Se dice que un agente aprende cuando su desempeño mejora con la experiencia y mediante el uso de datos; es decir, cuando la habilidad no estaba presente en su genotipo o rasgos de nacimiento.[1]​ \"En el aprendizaje de máquinas un computador observa datos, construye un modelo basado en esos datos y utiliza ese modelo a la vez como una hipótesis acerca del mundo y una pieza de software que puede resolver problemas\".[2]​\n\nEn muchas ocasiones el campo de actuación del aprendizaje automático se solapa con el de la estadística inferencial, ya que las dos disciplinas se basan en el análisis de datos. Sin embargo, el aprendizaje automático incorpora las preocupaciones de la complejidad computacional de los problemas. Muchos problemas son de clase NP-hard, por lo que gran parte de la investigación realizada en aprendizaje automático está enfocada al diseño de soluciones factibles a esos problemas. El aprendizaje automático también está estrechamente relacionado con el reconocimiento de patrones. El aprendizaje automático puede ser visto como un intento de automatizar algunas partes del método científico mediante métodos matemáticos. Por lo tanto es un proceso de inducción del conocimiento.\n\nEl aprendizaje automático tiene una amplia gama de aplicaciones, incluyendo motores de búsqueda, diagnósticos médicos, detección de fraude en el uso de tarjetas de crédito, análisis de mercado para los diferentes sectores de actividad, clasificación de secuencias de ADN, reconocimiento del habla y del lenguaje escrito, juegos y robótica.\n\n", "sections": [{"name": "Resumen", "text": "", "subsections": []}, {"name": "Tipos de algoritmos", "text": "", "subsections": []}, {"name": "Técnicas de clasificación", "text": "", "subsections": []}, {"name": "Conocimiento", "text": "", "subsections": []}, {"name": "Distinción entre aprendizaje supervisado y no supervisado", "text": "", "subsections": []}, {"name": "Aplicaciones", "text": "", "subsections": []}, {"name": "Temas del aprendizaje automático", "text": "", "subsections": []}, {"name": "Historia y relación con otros temas", "text": "", "subsections": []}, {"name": "Software", "text": "", "subsections": []}, {"name": "Sesgos", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Bibliografía", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Asincron%C3%ADa", "title": "Asincronía", "summary": "\n\nBusca fuentes: «Asincronía» – noticias · libros · académico · imágenes\nEl término \"Asincronía\" hace referencia al suceso que no tiene lugar en total correspondencia temporal con otro suceso.\n\nPor ejemplo, podemos hablar de motor asíncrono a aquel cuya velocidad de rotación no corresponde con la frecuencia de corriente alterna que lo hace funcionar.\n\nDos señales son asíncronas o no están sincronizadas, cuando sus correspondientes instantes significativos no coinciden. \nDe esta manera, podremos saber una asincronidad basándonos en la ley de ohm.\n\nModo de transmisión de datos en el que el instante de emisión de cada carácter o bloque de caracteres se fija arbitrariamente, sincronizando con Start-Stop.\n\nEn educación a distancia (EaD), la asincronía se refiere a actividades que no requieren la conexión simultánea del facilitador y los participantes, sino que cada quien participa en su propio tiempo. \n\nUn ejemplo son los foros asíncronos, en los cuales todos participan en la conversación, pero en diferentes momentos.\n\nEl bloger\n", "sections": []}
{"url": "https://es.wikipedia.org/wiki/Base_de_datos", "title": "Base de datos", "summary": "\n\nBusca fuentes: «Base de datos» – noticias · libros · académico · imágenes\nUna base de datos (del inglés: database) se encarga no solo de almacenar datos, sino también de conectarlos entre sí en una unidad lógica. En términos generales, una base de datos es un conjunto de datos estructurados que pertenecen a un mismo contexto y, en cuanto a su función, se utiliza para administrar de forma electrónica grandes cantidades de información.[1]​ En este sentido; una biblioteca puede considerarse una base de datos compuesta en su mayoría por documentos y textos impresos en papel e indexados para su consulta. Actualmente, y debido al desarrollo tecnológico de campos como la informática y la electrónica, la mayoría de las bases de datos están en formato digital, siendo este un componente electrónico; por tanto, se ha desarrollado y se ofrece un amplio rango de soluciones al problema del almacenamiento de datos.\n\nEn las bases de datos, los datos deben estar estructurados e interrelacionados según un modelo que refleje el máximo contenido semántico. Esto significa que los datos se integran, estructuran, relacionan y comparten, y las interrelaciones deben almacenarse junto con los datos, lo que es una diferencia esencial en comparación con los archivos donde las interrelaciones no se almacenan. La redundancia de datos debe controlarse para evitar duplicidades perjudiciales, aunque se admite la redundancia física por motivos de eficiencia. En resumen, no debe existir redundancia lógica en las bases de datos.\n\nHay programas denominados sistemas gestores de bases de datos, abreviado SGBD (del inglés Database Management System o DBMS), que permiten almacenar y posteriormente acceder a los datos de forma rápida y estructurada. Las propiedades de estos DBMS, así como su utilización y administración, se estudian dentro del ámbito de la informática.\n\nLas aplicaciones más usuales son para la gestión de empresas e instituciones públicas. También son ampliamente utilizadas en entornos científicos con el objeto de almacenar la información experimental.\n\nAunque las bases de datos pueden contener muchos tipos de datos, algunos de ellos se encuentran mutuamente protegidos por las leyes de varios países. Por ejemplo en España, los datos personales se encuentran protegidos por la Ley Orgánica de Protección de Datos de Carácter Personal (LOPD), en México por la Ley Federal de Transparencia y Acceso a la Información Pública Gubernamental y en Argentina por la Ley de Protección de Datos Personales.[2]​\n\nEn Argentina, el Código Penal sanciona ciertas conductas relacionadas con una base de datos: acceder ilegítimamente a un banco de datos personales, proporcionar o revelar información registrada en un archivo o en un banco de datos personales cuyo secreto estuviere obligado a guardar por ley o insertar o hacer insertar datos en un archivo de datos personales. Si el autor es funcionario público, sufre además pena de inhabilitación especial.\n\n", "sections": [{"name": "Clasificación de bases de datos", "text": "", "subsections": []}, {"name": "Sistema de Administración de Bases de Datos (DBMS)", "text": "", "subsections": []}, {"name": "Diferencias entre bases de datos y hojas de cálculo", "text": "", "subsections": []}, {"name": "Modelos de bases de datos", "text": "", "subsections": []}, {"name": "Otros tipos de base de datos", "text": "", "subsections": []}, {"name": "Consulta a base de datos", "text": "", "subsections": []}, {"name": "Investigación", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Benevolent_Dictator_for_Life", "title": "Benevolent Dictator for Life", "summary": "Benevolent Dictator for Life (BDFL) es un título informal que se otorga a ciertos individuos de la comunidad de desarrolladores de software de código abierto que tienen la tarea de asignar las directrices generales y, en ciertas situaciones, las decisiones finales dentro del ámbito de un proyecto. La traducción de Benevolent Dictator for Life es Dictador Benevolente De por vida, lo que conlleva un tanto de informalidad y humor.\n\nEn 1995 Guido van Rossum, creador de Python, fue la primera persona sobre la que recayó dicha distinción.[1]​[2]​\n\nEl término \"Benevolent Dictator for Life\" fue acuñado por el programador de Python, Guido van Rossum, quien se autodesignó como \"BDFL\" para el desarrollo de Python. En la comunidad del software libre, el papel del BDFL es visto como una forma efectiva de tomar decisiones rápidas y unificadas, lo que permite que un proyecto crezca y evolucione de manera más eficiente.\n\nSin embargo, también hay críticas al concepto de BDFL, ya que algunas personas argumentan que el control absoluto de una sola persona puede limitar la creatividad y la innovación del proyecto. Además, la naturaleza del BDFL puede crear una dependencia insalubre en una sola persona, lo que puede ser perjudicial para el proyecto a largo plazo.\n\nNótese la diferencia con su significado histórico usado en un contexto político.[cita requerida]\n\n", "sections": [{"name": "Lista de algunos BDFLs", "text": "", "subsections": []}, {"name": "Dictador Benevolente", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Biblioteca_(inform%C3%A1tica)", "title": "Biblioteca (informática)", "summary": "En informática, una biblioteca o, llamada por vicio del lenguaje, librería (del inglés library) es un conjunto de implementaciones funcionales, codificadas en un lenguaje de programación, que ofrece una interfaz bien definida para la funcionalidad que se invoca. \n\nA diferencia de un programa ejecutable, el comportamiento que implementa una biblioteca no espera ser utilizada de forma autónoma (un programa sí: tiene un punto de entrada principal), sino que su fin es ser utilizada por otros programas, independientes y de forma simultánea. Por otra parte, el comportamiento de una biblioteca no tiene por qué diferenciarse demasiado del que pudiera especificarse en un programa. Es más, unas bibliotecas pueden requerir de otras para funcionar, pues el comportamiento que definen refina, o altera, el comportamiento de la biblioteca original; o bien la hace disponible para otra tecnología o lenguaje de programación.\n\nLas bibliotecas pueden vincularse a un programa (o a otra biblioteca) en distintos puntos del desarrollo o la ejecución, según el tipo de vínculo que se quiera establecer, tal y como se detalla en el apartado de \"Tipos\".\n\nLa mayoría de los sistemas operativos modernos proporcionan bibliotecas que implementan los servicios del sistema. De esta manera, estos servicios se han convertido en una «materia prima» que cualquier aplicación moderna espera que el sistema operativo ofrezca. Como tal, la mayor parte del código utilizado por las aplicaciones modernas se ofrece en estas bibliotecas.\n\n", "sections": [{"name": "Nota terminológica", "text": "", "subsections": []}, {"name": "Historia", "text": "", "subsections": []}, {"name": "Tipos", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Biblioteca_(programaci%C3%B3n)", "title": "Biblioteca (informática)", "summary": "En informática, una biblioteca o, llamada por vicio del lenguaje, librería (del inglés library) es un conjunto de implementaciones funcionales, codificadas en un lenguaje de programación, que ofrece una interfaz bien definida para la funcionalidad que se invoca. \n\nA diferencia de un programa ejecutable, el comportamiento que implementa una biblioteca no espera ser utilizada de forma autónoma (un programa sí: tiene un punto de entrada principal), sino que su fin es ser utilizada por otros programas, independientes y de forma simultánea. Por otra parte, el comportamiento de una biblioteca no tiene por qué diferenciarse demasiado del que pudiera especificarse en un programa. Es más, unas bibliotecas pueden requerir de otras para funcionar, pues el comportamiento que definen refina, o altera, el comportamiento de la biblioteca original; o bien la hace disponible para otra tecnología o lenguaje de programación.\n\nLas bibliotecas pueden vincularse a un programa (o a otra biblioteca) en distintos puntos del desarrollo o la ejecución, según el tipo de vínculo que se quiera establecer, tal y como se detalla en el apartado de \"Tipos\".\n\nLa mayoría de los sistemas operativos modernos proporcionan bibliotecas que implementan los servicios del sistema. De esta manera, estos servicios se han convertido en una «materia prima» que cualquier aplicación moderna espera que el sistema operativo ofrezca. Como tal, la mayor parte del código utilizado por las aplicaciones modernas se ofrece en estas bibliotecas.\n\n", "sections": [{"name": "Nota terminológica", "text": "", "subsections": []}, {"name": "Historia", "text": "", "subsections": []}, {"name": "Tipos", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Biopython", "title": "Biopython", "summary": "\nEl proyecto 'Biopython' es el nombre que recibe una serie de aplicaciones y programas informáticos pensados para cuantificar y hacer cálculos con datos biológicos, programados por una comunidad internacional. Su objetivo principal es el de desarrollar el mayor número posible de bibliotecas informáticas basadas en el lenguaje de programación Python, que tengan aplicaciones bioinformáticas y que estén disponibles para un público lo más amplio posible.[1]​[2]​ Esto es posible gracias a una licencia de código abierto específica, llamada licencia Biopython, que es muy poco restrictiva.\n\nBiophython permite representar secuencias biológicas y anotaciones de genomas y es capaz de comunicar con las bases de datos biológicos en línea del NCBI para hacer cálculos. Además, gracias a diversos módulos, puede ser utilizada para trabajar sobre proyectos relativos al alineamiento de secuencias, cálculo de estructuras proteicas, genética de poblaciones, filogenética e inteligencia artificial.\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Diseño", "text": "", "subsections": []}, {"name": "Características y ejemplos", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Bloque_de_c%C3%B3digo", "title": "Bloque de código", "summary": "El bloque de código es un usuario o sección de código con una o más declaraciones y sentencias. Un lenguaje de programación que permite bloques, incluyendo bloques anidados dentro de otros bloques es llamado un lenguaje de programación estructurado por bloques.\n\nIdeas de la estructura del bloque se desarrollaron en la década de los años 1950, durante el desarrollo de los primeros autocodes y fueron formalizados en los informes de Algol 58 y Algol 60. Algol 58 introdujo la noción de la \"sentencia compuesta\", que estaba relacionada únicamente con control de flujo.[1]​ El posterior informe revisado que describe la sintaxis y la semántica de Algol 60 introdujo la noción de un bloque, consistiendo en \"una secuencia de sentencias encerrada entre begin y end...\" en la que \"cada declaración aparece en un bloque de esta manera y es válida solo para ese bloque\".[2]​\n\nLa función de los bloques de programación es permitir que grupos sentencias sean tratados como si fueran una sola sentencia, y restringir el ámbito léxico de las variables, los procedimientos y funciones declaradas en un bloque para que no entre en conflicto con variables con el mismo nombre utilizadas para diferentes propósitos en otras partes de un programa.\n\nLa noción de bloques es introducida por diferentes sintaxis en diferentes lenguajes, pero hay dos grandes familias: la familia del ALGOL en que los bloques están delimitados por las palabras clave begin y end, y la familia de C en la que los bloques están delimitados por llaves { y }. Algunas otras técnicas utilizadas son el uso de sangría, y s-expression con una palabra clave sintáctica como lambda o let (como en la familia del Lisp).\n\nEn un lenguaje de programación estructurado en bloque, los nombres de las variables y otros objetos, como los procedimientos que son declarados en bloques externos son visibles dentro de otros bloques internos, a menos que sean sombreado por un objeto del mismo nombre.\n\nAlgunos lenguajes que soportan bloques con declaraciones de variables no soportan completamente todas las declaraciones; por ejemplo muchos lenguajes derivados de C no permitan la definición de una función dentro de un bloque. Y a diferencia de su antecesor Algol, Pascal no soporta el uso de bloques con sus propias declaraciones dentro del begin y end de un bloque existente, sólo sentencias compuestas permitiendo una secuencia de declaraciones agrupadas en if, while, repeat y otras sentencias de control.\n\n", "sections": [{"name": "Origen", "text": "", "subsections": []}, {"name": "Sintaxis", "text": "", "subsections": []}, {"name": "Uso", "text": "", "subsections": []}, {"name": "Parámetros", "text": "", "subsections": []}, {"name": "Uso", "text": "", "subsections": []}, {"name": "Parámetros", "text": "", "subsections": []}, {"name": "Beneficios", "text": "", "subsections": []}, {"name": "Consecuencias", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Boo_(lenguaje_de_programaci%C3%B3n)", "title": "Boo (lenguaje de programación)", "summary": "\nBoo es un lenguaje de programación orientado a objetos, de tipos estáticos para la Common Language Infrastructure con una sintaxis inspirada en  Python y un énfasis en la extensibilidad del lenguaje y su compilador. Sus características incluyen la inferencia de tipos, los generadores, multimétodos, duck typing opcional, macros, clausuras, currificación y funciones de primera clase.\n\nBoo es software de código abierto; tiene una licencia tipo MIT/BSD.\n\nBoo se integra sin fisuras con Microsoft.NET y Mono.\n\n", "sections": [{"name": "Ejemplos de código", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Bucle_while", "title": "Bucle while", "summary": "\n\nBusca fuentes: «Bucle while» – noticias · libros · académico · imágenes\nEl bucle while o bucle mientras es un ciclo repetitivo basado en los resultados de una expresión lógica; se encuentra en la mayoría de los lenguajes de programación estructurados. El propósito es repetir un bloque de código mientras una condición se mantenga verdadera.[1]​\n\n", "sections": [{"name": "Sintaxis", "text": "", "subsections": []}, {"name": "Condición", "text": "", "subsections": []}, {"name": "Ejemplos (usando sintaxis de C++)", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/C%2B%2B", "title": "C++", "summary": "\n\n[\n]\nC++ es un lenguaje de programación diseñado en 1979 por Bjarne Stroustrup. La intención de su creación fue extender al lenguaje de programación C y añadir mecanismos que permiten la manipulación de objetos. En ese sentido, desde el punto de vista de los lenguajes orientados a objetos, C++ es un lenguaje híbrido.\n\nPosteriormente se añadieron facilidades de programación genérica, que se sumaron a los paradigmas de programación estructurada y programación orientada a objetos. Por esto se suele decir que el C++ es un lenguaje de programación multiparadigma.\n\nActualmente existe un estándar, denominado ISO C++, al que se han adherido la mayoría de los fabricantes de compiladores más modernos. Existen también algunos intérpretes, tales como ROOT.\n\nEl nombre \"C++\" fue propuesto por Rick Mascitti en el año 1983, cuando el lenguaje fue utilizado por primera vez fuera de un laboratorio científico. Antes se había usado el nombre \"C con clases\". En C++, la expresión \"C++\" significa \"incremento de C\" y se refiere a que C++ es una extensión de C.\n\n", "sections": [{"name": "Características de C++", "text": "", "subsections": []}, {"name": "Ejemplos", "text": "", "subsections": []}, {"name": "Tipos de datos", "text": "", "subsections": []}, {"name": "Principios", "text": "", "subsections": []}, {"name": "El concepto de clase", "text": "", "subsections": []}, {"name": "Standard Template Library (STL)", "text": "", "subsections": []}, {"name": "Biblioteca de entrada y salida", "text": "", "subsections": []}, {"name": "C++11", "text": "", "subsections": []}, {"name": "Actualidad y futuro", "text": "", "subsections": []}, {"name": "Diferencias de tipos respecto a C", "text": "", "subsections": []}, {"name": "Compiladores", "text": "", "subsections": []}, {"name": "Entornos de desarrollo", "text": "", "subsections": []}, {"name": "Críticas", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/C%C3%A1lculo_lambda", "title": "Cálculo lambda", "summary": "En lógica matemática, el cálculo lambda es un sistema formal diseñado para investigar la definición de función, la noción de aplicación de funciones y la recursión. Fue introducido por Alonzo Church y Stephen Kleene en la década de 1930 como parte de sus investigaciones sobre los fundamentos de las matemáticas. Church usó el cálculo lambda en 1936 para resolver el Entscheidungsproblem. Puede ser usado para definir de manera limpia y precisa qué es una \"función computable\".\n\nEl interrogante de si dos expresiones del cálculo lambda son equivalentes no puede ser resuelto por un algoritmo general. Esta fue la primera pregunta, incluso antes que el problema de la parada, cuya indecidibilidad fue probada. El cálculo lambda tiene una gran influencia sobre los lenguajes funcionales, como Lisp, ML y Haskell.\n\nSe puede considerar al cálculo lambda como uno de los lenguajes universales de programación más minimalistas. Consiste en una regla de transformación simple (sustitución de variables) y un esquema simple para definir funciones.\n\nEl cálculo lambda es universal porque cualquier función computable puede ser expresada y evaluada a través de él. Por lo tanto, es equivalente a las máquinas de Turing. Sin embargo, el cálculo lambda no hace énfasis en el uso de reglas de transformación y no considera las máquinas reales que pueden implementarlo. Se trata de una propuesta más cercana al software que al hardware.\n\nEste artículo se enfocará sobre el cálculo lambda sin tipos, como fue diseñado originalmente por Church.[1]​ Desde entonces, algunos cálculo lambda tipados fueron creados.\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Introducción informal", "text": "", "subsections": []}, {"name": "Definición formal", "text": "", "subsections": []}, {"name": "Cálculos aritméticos con lambda", "text": "", "subsections": []}, {"name": "Lógica y predicados", "text": "", "subsections": []}, {"name": "Pares", "text": "", "subsections": []}, {"name": "Recursión", "text": "", "subsections": []}, {"name": "Funciones computables y el cálculo lambda", "text": "", "subsections": []}, {"name": "Indecisión de equivalencia", "text": "", "subsections": []}, {"name": "Cálculo lambda y los lenguajes de programación", "text": "", "subsections": []}, {"name": "Estrategias de reducción", "text": "", "subsections": []}, {"name": "Concurrencia y paralelismo", "text": "", "subsections": []}, {"name": "Reducción óptima", "text": "", "subsections": []}, {"name": "Semántica", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/C%C3%B3digo_abierto", "title": "Código abierto", "summary": "El código abierto (en inglés: open source) es un modelo de desarrollo de software basado en la colaboración abierta.[1]​ Se enfoca en los beneficios prácticos (acceso al código fuente) y en cuestiones éticas o de libertad que tanto se destacan en el software libre.[2]​ Para muchos el término «libre» hace referencia al hecho de adquirir un software de manera gratuita. Sin embargo, de lo que se trata es de abaratar los costos y ampliar la participación; que sea libre no necesariamente implica que sea gratuito, lo importante sigue siendo ampliar la participación y extender libertades.\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Movimiento del código abierto", "text": "", "subsections": []}, {"name": "Programas en código abierto", "text": "", "subsections": []}, {"name": "Código abierto en educación", "text": "", "subsections": []}, {"name": "Extensiones del concepto", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/CPython", "title": "CPython", "summary": "\n\nBusca fuentes: «CPython» – noticias · libros · académico · imágenes\nCPython es la implementación oficial y más ampliamente utilizada del lenguaje de programación Python. Está escrita en C. Además de CPython, hay otras implementaciones con calidad para producción: Jython, escrita en Java; IronPython, escrita para el Common Language Runtime y PyPy, escrita en un subconjunto del propio lenguaje Python. \n\nCPython es un intérprete de bytecode. Tiene una interfaz de funciones foráneas para varios lenguajes (incluyendo C, C++ y Fortran)[1]​ con el que se pueden codificar bindings para bibliotecas escritas en lenguajes diferentes a Python.[2]​\n\nAdemás de CPython, existen otras implementaciones de Python: Jython, IronPython, PyPy y Stackless Python.\n\n\n\n", "sections": [{"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/C_(lenguaje_de_programaci%C3%B3n)", "title": "C (lenguaje de programación)", "summary": "\n\nCódigo simple en C\nB (BCPL, CPL), ALGOL 68,[1]​: 201-208 \n\nC es un lenguaje de programación de propósito general[2]​: 1  originalmente desarrollado por Dennis Ritchie entre 1969 y 1972 en los Laboratorios Bell,[1]​ como evolución del anterior lenguaje B, a su vez basado en BCPL.[2]​: 1 [3]​[4]​\n\nAl igual que B, es un lenguaje orientado a la implementación de sistemas operativos; concretamente Unix. C es apreciado por la eficiencia del código que produce y es el lenguaje de programación más popular para crear softwares de sistemas y aplicaciones.\n\nSe trata de un lenguaje de tipos de datos estáticos, débilmente tipado, que dispone de las estructuras típicas de los lenguajes de alto nivel, pero, a su vez, dispone de construcciones del lenguaje que permiten un control a bajo nivel. Los compiladores suelen ofrecer extensiones al lenguaje que posibilitan mezclar código en ensamblador con código C o acceder directamente a memoria o dispositivos periféricos.\n\nLa primera estandarización del lenguaje C fue en ANSI, con el estándar X3.159-1989. El lenguaje que define este estándar fue conocido vulgarmente como ANSI C. Posteriormente, en 1990, fue ratificado como estándar ISO (ISO/IEC 9899:1990). La adopción de este estándar es muy amplia por lo que, si los programas creados lo siguen, el código es portable entre plataformas y/o arquitecturas.\n\n", "sections": [{"name": "Filosofía", "text": "", "subsections": []}, {"name": "Historia", "text": "", "subsections": []}, {"name": "Lenguajes derivados de C", "text": "", "subsections": []}, {"name": "Proceso de compilación", "text": "", "subsections": []}, {"name": "Herramientas de programación", "text": "", "subsections": []}, {"name": "Aplicabilidad", "text": "", "subsections": []}, {"name": "Bibliotecas C", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Clase_(inform%C3%A1tica)", "title": "Clase (informática)", "summary": "\n\nBusca fuentes: «Clase (informática)» – noticias · libros · académico · imágenes\nEn informática, una clase es una plantilla para el objetivo de la creación de objetos de datos según un modelo predefinido. Las clases se utilizan para representar entidades o conceptos, como los sustantivos en el lenguaje. Cada clase es un modelo que define un conjunto de variables y métodos apropiados para operar con dichos datos. Cada objeto creado a partir de la clase se denomina instancia de la clase.\n\nLa programación orientada a objetos es la base principal para los tipos de objetos. Permiten abstraer los datos y sus operaciones asociadas al modo de una caja negra. Los lenguajes de programación que soportan clases difieren sutilmente en su soporte para diversas características relacionadas con clases. La mayoría soportan diversas formas de herencia. Muchos lenguajes también soportan características para proporcionar encapsulación, como especificadores de acceso.\n\nUna clase también puede tener una representación (metaobjeto) en tiempo de ejecución, que proporciona apoyo en tiempo de ejecución para la manipulación de los metadatos relacionados con la clase.\n\n", "sections": [{"name": "Componentes", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Codigo_fuente", "title": "Código fuente", "summary": "\n\nBusca fuentes: «Código fuente» – noticias · libros · académico · imágenes\nEl código fuente de un programa informático (o software) es un conjunto de líneas de texto con los pasos que debe seguir la computadora para ejecutar un cargador.[1]​\n\nEl código fuente de un programa está escrito por un programador en algún lenguaje de programación legible por humanos, normalmente en forma de texto plano.[2]​ Sin embargo, el programa escrito en un lenguaje legible por humanos no es directamente ejecutable por la computadora en su primer estado, sino que debe ser traducido a otro lenguaje o código binario; así será más fácil para la máquina interpretarlo  (lenguaje máquina o código objeto que sí pueda ser ejecutado por el hardware de la computadora). Para esta traducción se usan los llamados compiladores, ensambladores, intérpretes y otros sistemas de traducción.\n\nEl término código fuente también se usa para hacer referencia al código fuente de otros elementos del software, como, por ejemplo, el código fuente de una página web, que está escrito en lenguaje de marcado HTML o en Javascript, u otros lenguajes de programación web, y que es posteriormente ejecutado por el navegador web para visualizar dicha página cuando es visitada.\n\nEl área de la informática que se dedica a la creación de programas, y por tanto a la creación de su código fuente, es la ingeniería de software.\n\n", "sections": [{"name": "Licencias", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Coloreado_de_sintaxis", "title": "Resaltado de sintaxis", "summary": "\n\nBusca fuentes: «Resaltado de sintaxis» – noticias · libros · académico · imágenes\nEl resaltado de sintaxis, a veces llamado coloreado de sintaxis, es una capacidad de algunas aplicaciones para tratamiento de textos (como los editores de texto), para diferenciar elementos de texto (especialmente el llamado código fuente) mediante diversos colores o estilos tipográficos, dependiendo de las categorías sintácticas de sus términos, conforme a las reglas de algún lenguaje formal concreto.\n\nEste resaltado se utiliza a modo de notación secundaria, habitualmente para mejorar la legibilidad del código fuente de programas o de textos escritos en algún lenguaje de marcado, permitiendo aumentar la productividad de los programadores. Los estilos aplicados por defecto dependen de cada programa informático, alguno de los cuales permiten configurar los estilos e incluso reconocer diversos lenguajes.\n\nLa interpretación del texto no varía en absoluto al resaltar sus elementos. Los cambios en la representación del texto cumplen una función visual identificativa y no semántica, sólo se usan para transmitir información al lector humano. Por tanto, en el caso del código fuente de un programa, los intérpretes y los compiladores lo ignoran. No forman parte ni del lenguaje formal en sí, ni del texto, por lo que tampoco se guardan en el fichero, sino que se analiza cada vez que se carga.\n\n", "sections": [{"name": "Ejemplo", "text": "", "subsections": []}, {"name": "Programas con resaltado de sintaxis", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Colt_Python", "title": "Colt Python", "summary": "\n \nEl Colt Python es un revólver calibre .357 que era fabricado por la empresa Colt Manufacturing Company de Hartford, Connecticut. A veces es mencionado como \"Magnum de combate\".[1]​ Fue introducido al mercado en 1955, el mismo año que el revólver Modelo 29 calibre 11 mm de Smith & Wesson. El ya descontinuado Colt Python iba dirigido al segmento del mercado de revólveres de lujo. Algunos coleccionistas de armas de fuego y escritores como Jeff Cooper, Ian V. Hogg, Chuck Hawks, Leroy Thompson, y Renée Smeets han descrito al Python como uno de los mejores revólveres jamás fabricados.[2]​[3]​[4]​[5]​[6]​[7]​[1]​\n\n", "sections": [{"name": "Descripción", "text": "", "subsections": []}, {"name": "Historia", "text": "", "subsections": []}, {"name": "Modelos y variantes", "text": "", "subsections": []}, {"name": "Uso", "text": "", "subsections": []}, {"name": "Críticas", "text": "", "subsections": []}, {"name": "Apariciones en televisión y videojuegos", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Notas", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Comentario_(inform%C3%A1tica)", "title": "Comentario (informática)", "summary": "rojo\nverde\nazul\nEn la programación de computadoras, un comentario es una construcción del lenguaje de programación[1]​ destinada a incrustar anotaciones legibles al programador en el código fuente de un Programa informático.[2]​ Estas anotaciones son potencialmente significativas para los programadores, pero usualmente ignorados por los compiladores e intérpretes.[3]​[4]​ Los comentarios son añadidos usualmente con el propósito de hacer el código fuente más fácil de entender con vistas a su mantenimiento o reutilización. La sintaxis y reglas para los comentarios varían y usualmente son definidas en la especificación del lenguaje de programación.\n\nSe ha de tener en cuenta que los comentarios necesitan mantenimiento igual que el código y, por tanto, que un comentario preciso y conciso es más fácil de mantener que uno largo, repetitivo y complicado.\n\nLos comentarios tienen una amplia gama de posibles usos: desde la mejora del código fuente con descripciones básicas hasta la generación de documentación externa. También se utilizan para la integración con sistemas de control de versiones y otros tipos de herramientas de programación externas.\n\nLa flexibilidad proporcionada por los comentarios da pie a un amplio abanico de formas de uso distintas y a la inclusión de información inútil dentro del código fuente. Para evitar este inconveniente, muchos programadores y analistas de software adoptan alguna de las \"filosofías\" o metodologías para la correcta utilización de los comentarios.\n\n", "sections": [{"name": "Información general", "text": "", "subsections": []}, {"name": "Usos", "text": "", "subsections": []}, {"name": "Estilos", "text": "", "subsections": []}, {"name": "Curiosidades", "text": "", "subsections": []}, {"name": "Ejemplos", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Compilaci%C3%B3n_en_tiempo_de_ejecuci%C3%B3n", "title": "Compilación en tiempo de ejecución", "summary": "\n\nBusca fuentes: «Compilación en tiempo de ejecución» – noticias · libros · académico · imágenes\nEn informática, la compilación en tiempo de ejecución (también conocida por sus siglas inglesas, JIT, just-in-time), también conocida como traducción dinámica, es una técnica para mejorar el rendimiento de sistemas de programación que compilan a bytecode, consistente en traducir el bytecode a  código máquina nativo en tiempo de ejecución. La compilación en tiempo de ejecución se construye a partir de dos ideas anteriores relacionadas con los entornos de ejecución: la compilación a bytecode y la compilación dinámica.\n\nEn un sistema que use interpretación de bytecode como por ejemplo Smalltalk, Perl, GNU CLISP o las primeras versiones de Java, el código fuente es traducido a un código intermedio llamado bytecode. El bytecode no es el código máquina de ninguna computadora en particular, y puede por tanto ser portable entre diferentes arquitecturas. El bytecode es entonces interpretado, o ejecutado por una máquina virtual.\n\nUn entorno con compilación dinámica es aquel en el que el compilador puede ser usado durante la ejecución. Por ejemplo, la mayoría de los sistemas Commons Lisp tienen una función compile que permite compilar nuevas funciones creadas durante la ejecución del programa. Aunque ventajoso en la depuración interactiva, la compilación dinámica es menos útil en un sistema en explotación desatendido. Ese método es más común en emuladores modernos y frecuentemente comerciales que requieren mucha velocidad, como el Qemu y el VirtualPC (PC) o el Executor (Macintosh 68k).\n\nEn un entorno de compilación en tiempo de ejecución, la compilación a bytecode es el primer paso, reduciendo el código fuente a una representación intermedia portable y optimizable. El bytecode se despliega en el sistema de destino. Cuando dicho código se ejecuta, el compilador en tiempo de ejecución lo traduce a código máquina nativo. Esto puede realizarse a nivel de fichero (programa) o de funciones, compilándose en este último caso el código correspondiente a una función justo cuando va a ejecutarse (de aquí el nombre de just-in-time, «justo a tiempo»).\n\nEl objetivo es combinar muchas de las ventajas de la compilación a código nativo y a bytecode: la mayoría del «trabajo pesado» de procesar el código fuente original y realizar optimizaciones básicas se realiza en el momento de compilar a bytecode, mucho antes del despliegue: así, la compilación a código máquina del programa resulta mucho más rápida que partiendo del código fuente. El bytecode desplegado es portable, a diferencia del código máquina para cualquier arquitectura concreta. Los compiladores dinámicos son más fáciles de escribir, pues el compilador a bytecode ya realiza buena parte del trabajo.\n7\n\n", "sections": [{"name": "Uso de compilación JIT en emuladores", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Conteo_de_referencias", "title": "Conteo de referencias", "summary": "Conteo de referencias, en inglés Reference counting, es una técnica para contabilizar las veces que un determinado recurso está siendo referido. Por lo general ese recurso son bloques de memoria y la técnica permite establecer cuando no existe ninguna referencia a ese bloque y este puede ser liberado. Es una técnica de muy fácil implementación, pero tiene una importante desventaja: Si las referencias forman un ciclo los objetos involucrados no se liberarán nunca. Otra técnica más efectiva es el uso de un recolector de basura.\n\n", "sections": [{"name": "Véase también", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/CubicWeb", "title": "CubicWeb", "summary": "\nCubicWeb es un framework de código abierto para el desarrollo de aplicaciones con funciones integradas de web semántica, escrito en Python. El framework está formado por componentes (clases programadas en Python) llamados cubos, que pueden ser reutilizados para construir sistemas más complejos. CubicWeb sigue los principios de la programación orientada objetos.\nSe viene desarrollando desde 2000 pero es hasta 2008 cuando la empresa Logilab decide liberar el código bajo una licencia LGPL.\n\n", "sections": [{"name": "Características principales", "text": "", "subsections": []}, {"name": "Soporte de bases de datos", "text": "", "subsections": []}, {"name": "Premios", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Ejemplos de sitios públicos realizados con CubicWeb", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Cython", "title": "Cython", "summary": "\n\nCython es un lenguaje de programación para simplificar la escritura de módulos de extensión para Python en C y C++. Siendo estrictos, la sintaxis de Cython es la misma de Python pero con algunos agregados:\n\nSe pueden llamar funciones en C, o funciones/métodos de C++, directamente desde el código en Cython.\nEs posible usar tipos estáticos en las variables (enteros, flotantes, o cualquier tipo de dato).\nCython compila a código en C o C++ desde Python, y el resultado puede ser usado desde Python como un \"Modulo de extensión\", o como una aplicación embebida en el intérprete CPython.\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Ventajas", "text": "", "subsections": []}, {"name": "Compatibilidad", "text": "", "subsections": []}, {"name": "Usos", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Páginas externas", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/DARPA", "title": "Agencia de Proyectos de Investigación Avanzados de Defensa", "summary": "\nSitio web oficial\nLa Agencia de Proyectos de Investigación Avanzados de Defensa, más conocida por su acrónimo DARPA, proveniente de su nombre original en inglés Defense Advanced Research Projects Agency, es una agencia del Departamento de Defensa de Estados Unidos responsable del desarrollo de nuevas tecnologías para uso militar. Fue creada en 1958 como consecuencia tecnológica de la llamada Guerra Fría y de la que surgieron los fundamentos de ARPANET, red que dio origen a Internet.\n\nLa agencia, denominada en su origen simplemente como ARPA, cambió su denominación en 1972, conociéndose en lo sucesivo como DARPA, por sus siglas en inglés. DARPA fue responsable de dar fondos para desarrollar muchas tecnologías que han tenido un gran impacto en el mundo: satélites, robots, redes de ordenadores (empezando con ARPANET, que después se desarrolló como Internet), así como NLS, el cual fue tanto un sistema de hipertexto como un precursor de la interfaz gráfica de usuario contemporánea.\n\nLa Agencia, bajo control del Departamento de Defensa se organizará en forma independiente de la comunidad de investigación y desarrollo militar. Su misión durante las próximas décadas la llevará a desarrollar y proveer aplicaciones tecnológicas no convencionales para la defensa de Estados Unidos ampliando la frontera tecnológica a favor de una organización reducida en número, pero flexible, libre de condicionamientos y dotada de científicos de élite. A.R.P.A. será la responsable de una gran parte de la investigación en ordenadores y comunicaciones de carácter innovador en EE. UU. durante los próximos años.\n\nSu nombre original fue simplemente Agencia de Investigación de Proyectos Avanzados pero se renombró a DARPA (por Defensa) el 23 de marzo de 1972, volvió a cambiarse a ARPA el 22 de febrero de 1993 y otra vez a DARPA el 11 de marzo de 1996.\n\nDARPA fue creado en 1958 en respuesta al lanzamiento soviético del Sputnik, con la misión de mantener a la tecnología de Estados Unidos en la carrera militar por delante de la de sus enemigos. Es independiente de otras agencias más convencionales de I+D y reporta directamente al consejo del Departamento de Defensa. DARPA tiene alrededor de 240 trabajadores, los cuales manejan un presupuesto de unos 3000 millones de dólares —2800 en 2012.[1]​ Estos datos son solo promedios, puesto que DARPA está enfocado en proyectos de corto plazo (de dos a cuatro años) llevados a cabo por equipos pequeños y constituidos expresamente para dichos proyectos.\n\n", "sections": [{"name": "Espionaje", "text": "", "subsections": []}, {"name": "Misión de DARPA", "text": "", "subsections": []}, {"name": "Historia", "text": "", "subsections": []}, {"name": "Organización actual", "text": "", "subsections": []}, {"name": "Proyectos DARPA", "text": "", "subsections": []}, {"name": "Controversia", "text": "", "subsections": []}, {"name": "ARPA y DARPA en la ficción", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/D_(lenguaje_de_programaci%C3%B3n)", "title": "D (lenguaje de programación)", "summary": "\n[\n]\nD es un lenguaje de programación de propósito general desarrollado por Walter Bright cuya primera versión apareció en 1999. Se origina como un rediseño de C++, con un enfoque más pragmático, pero no es un lenguaje puramente derivado del anterior. D ha mantenido algunas características de C++ y también está influido por otros conceptos de otros lenguajes como Java, C# y Eiffel.\n\n", "sections": [{"name": "Características", "text": "", "subsections": []}, {"name": "Ejemplos", "text": "", "subsections": []}, {"name": "Implementación", "text": "", "subsections": []}, {"name": "Herramientas de desarrollo", "text": "", "subsections": []}, {"name": "Problemas y controversias", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Diferencia_de_conjuntos", "title": "Diferencia de conjuntos", "summary": "A\nB\nEn teoría de conjuntos, la diferencia de dos conjuntos es una operación que da como resultado otro conjunto con los elementos del primer conjunto sin los elementos del segundo conjunto. Por ejemplo, la diferencia entre el conjunto de los números naturales, \n\n\n\n\nN\n\n\n\n{\\displaystyle \\mathbb {N} }\n\n, y el conjunto de los números pares sin incluir el cero, \n\n\n\nP\n\n\n{\\displaystyle P}\n\n, es el conjunto de los números que no son pares, es decir, los impares, \n\n\n\nI\n\n\n{\\displaystyle I}\n\n:\n\n\n\n\n\n\nN\n\n=\n{\n1\n,\n2\n,\n3\n,\n4\n,\n5\n,\n6\n,\n7\n,\n8\n,\n9\n,\n10\n,\n11\n,\n12\n…\n}\n\n\n{\\displaystyle \\mathbb {N} =\\{1,2,3,4,5,6,7,8,9,10,11,12\\ldots \\}}\n\n\n\n\n\n\nP\n=\n{\n2\n,\n4\n,\n6\n,\n8\n,\n10\n,\n12\n…\n}\n\n\n{\\displaystyle P=\\{2,4,6,8,10,12\\ldots \\}}\n\n\n\n\n\n\nI\n=\n{\n1\n,\n3\n,\n5\n,\n7\n,\n9\n,\n11\n,\n13\n,\n15\n,\n17\n…\n}\n\n\n{\\displaystyle I=\\{1,3,5,7,9,11,13,15,17\\ldots \\}}\n\n\nComo no hay ningún elemento del conjunto P que no sea un número natural, la diferencia P menos N no tiene ningún elemento, por lo que es el conjunto vacío. La diferencia entre dos conjuntos A y B se denota por A \\ B o A − B, por lo que: N \\ P = I, y también P − N = ∅.\n\n", "sections": [{"name": "Definición", "text": "", "subsections": []}, {"name": "Propiedades", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Bibliografía", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Diferencia_sim%C3%A9trica", "title": "Diferencia simétrica", "summary": "A\nB\nEn teoría de conjuntos, la diferencia simétrica de dos conjuntos es una operación cuyo resultado es otro conjunto que contiene a aquellos elementos que pertenecen a cada uno de los conjuntos iniciales, pero no a ambos a la vez. Por ejemplo, la diferencia simétrica del conjunto de los números pares positivos P y el conjunto de los cuadrados perfectos C es un conjunto D que contiene los cuadrados impares y los pares no cuadrados:\n\n\n\n\n\nP\n=\n{\n2\n,\n4\n,\n6\n,\n8\n,\n10\n,\n12\n,\n14\n,\n16\n,\n…\n}\n\n\n{\\displaystyle P=\\{2,4,6,8,10,12,14,16,\\ldots \\}}\n\n\n\n\n\n\nC\n=\n{\n1\n,\n4\n,\n9\n,\n16\n,\n25\n,\n…\n}\n\n\n{\\displaystyle C=\\{1,4,9,16,25,\\ldots \\}}\n\n\n\n\n\n\nD\n=\n{\n1\n,\n2\n,\n6\n,\n8\n,\n9\n,\n10\n,\n12\n,\n14\n,\n18\n,\n…\n}\n\n\n{\\displaystyle D=\\{1,2,6,8,9,10,12,14,18,\\ldots \\}}\n\n\n", "sections": [{"name": "Definición", "text": "", "subsections": []}, {"name": "Propiedades", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Django_(framework)", "title": "Django (framework)", "summary": "\n\nDjango es un framework de desarrollo web de código abierto, escrito en Python, que respeta el patrón de diseño conocido como modelo–vista–controlador (MVC). Fue desarrollado originalmente para gestionar páginas web orientadas a noticias de la World Company de Lawrence, Kansas, y fue liberada al público bajo una licencia BSD en julio de 2005; el framework fue nombrado en alusión al guitarrista de jazz gitano Django Reinhardt.\n\nEn junio de 2008 fue anunciado que la recién formada Django Software Foundation se haría cargo de Django en el futuro.\n\nLa meta fundamental de Django es facilitar la creación de sitios web complejos. Django pone énfasis en el re-uso, la conectividad y extensibilidad de componentes, el desarrollo rápido y el principio «DRY» (del inglés Don't Repeat Yourself,«No te repitas»). El lenguaje Python es usado en todos los componentes del framework, incluso en configuraciones, archivos,[1]​ y en sus modelos de datos.\n\n", "sections": [{"name": "Visión general y características", "text": "", "subsections": []}, {"name": "Arquitectura", "text": "", "subsections": []}, {"name": "Historial de versiones", "text": "", "subsections": []}, {"name": "Soporte de bases de datos", "text": "", "subsections": []}, {"name": "Soporte de servidores Web", "text": "", "subsections": []}, {"name": "Requerimientos", "text": "", "subsections": []}, {"name": "Otros aspectos", "text": "", "subsections": []}, {"name": "Django en la web", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Encapsulamiento_(inform%C3%A1tica)", "title": "Encapsulamiento (informática)", "summary": "En la Programación orientada a objetos (POO), la encapsulación se refiere a la agrupación de datos con los métodos que operan en esos datos, o la restricción del acceso directo a algunos de los componentes de un objeto.[1]​ La encapsulación se utiliza para ocultar los valores o el estado de un objeto de datos estructurados dentro de una clase, evitando el acceso directo a ellos por parte de los clientes de una manera que podría exponer detalles de Implementación ocultos o violar la invariancia de estado mantenida por los métodos.\n\nSin embargo, ocultar datos no es el alcance total de la ocultación de información. David Parnas introdujo por primera vez el concepto de ocultación de información alrededor de 1972. Argumentó que el criterio principal para la modularización del sistema debería referirse a la ocultación de decisiones críticas de diseño. Hizo hincapié en ocultar «decisiones de diseño difíciles o decisiones de diseño que probablemente cambien». Ocultar información de esa manera aísla a los clientes de requerir un conocimiento profundo del diseño para usar un módulo y de los efectos de cambiar esas decisiones.[1]​\n\n", "sections": [{"name": "Significado", "text": "", "subsections": []}, {"name": "Modificadores de acceso", "text": "", "subsections": []}, {"name": "Ejemplos", "text": "", "subsections": []}, {"name": "===============================================================================", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Estilo_de_sangrado", "title": "Estilo de sangrado", "summary": "\n\nBusca fuentes: «Estilo de sangrado» – noticias · libros · académico · imágenes\nIndentación es un anglicismo (de la palabra inglesa indentation) de uso común en informática; no es un término reconocido por la Real Academia Española (consultado en la vigesimosegunda edición). La Real Academia recomienda utilizar «sangrado». \nEste término significa mover un bloque de texto hacia la derecha insertando espacios o tabuladores, para así separarlo del margen izquierdo y distinguirlo  mejor del texto adyacente; en el ámbito de la imprenta, este concepto siempre se ha denominado sangrado o sangría.\n\nEn los lenguajes de programación de computadoras, la indentación es un tipo de notación secundaria utilizado para mejorar la legibilidad del código fuente por parte de los programadores, teniendo en cuenta que los compiladores o intérpretes raramente consideran los espacios en blanco entre las sentencias de un programa. Sin embargo, en ciertos lenguajes de programación como Haskell, Occam y Python, el sangrado se utiliza para delimitar la estructura del programa permitiendo establecer bloques de código.\n\nSon frecuentes discusiones entre programadores sobre cómo o dónde usar el sangrado, si es mejor usar espacios en blanco o tabuladores, ya que cada programador tiene su propio estilo.\n\n", "sections": [{"name": "Ejemplos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Extensi%C3%B3n_de_archivo", "title": "Extensión de archivo", "summary": "\n\nBusca fuentes: «Extensión de archivo» – noticias · libros · académico · imágenes\nEn informática, el término extensión del fichero (también, extensión del archivo) es una cadena de caracteres anexada al nombre de un archivo, habitualmente predicha por un punto. Su función principal es distinguir el contenido del archivo, de modo que el sistema operativo disponga del procedimiento necesario para ejecutarlo o interpretarlo. Sin embargo, la extensión es solamente parte del nombre del archivo y no representa ningún tipo de obligación respecto a su contenido.\n\nAlgunos sistemas operativos, especialmente los herederos de DOS como Windows, utilizan las extensiones de archivo para reconocer su formato, incluso el de archivos ejecutables. Otros sistemas operativos, como los basados en Unix, utilizan las extensiones de archivo por simple convención, y no las usan necesariamente para determinar el tipo de archivo.\n\nDado que las extensiones de archivo legado son del sistema DOS, muchas de sus actuales características fueron heredadas por limitaciones en ese sistema. Los antiguos sistemas DOS limitaban la cantidad de caracteres de la extensión de archivo a tres, por lo que muchas extensiones convencionales poseen esa cantidad de caracteres. Además, los nombres de archivo en sistemas DOS son insensibles a las mayúsculas y minúsculas, por lo que la mayoría de las extensiones de archivo pueden escribirse en minúsculas o en mayúsculas o en una combinación de ambas.\n\nPor su extensión, un mismo nombre básico puede contener archivos de distinto propósito. Como en este ejemplo de DOS:\n\nAPLICACIÓN.BAS  Archivo Fuente escrito en lenguaje BASIC.\n\nAPLICACIÓN.OBJ  Archivo objeto (necesario para su compilación).\n\nAPLICACIÓN.EXE  Programa Ejecutable.\n\nARCHIVO.XXX  Archivo de texto ASCII \"texto plano\".\n\nARCHIVO.RTF  Archivo de texto con formato.\n\nARCHIVO.DOC  Archivo de texto con formato de Microsoft Word.\n\nARCHIVO.VBS  Archivo fuente escrito en lenguaje Visual Basic.\n\nEn todos estos casos, las extensiones diferencian los nombres de los archivos y, a la vez, los identifican ante las aplicaciones que pueden manejarlos, lo que facilita la obtención de resultados.\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Tipos de extensiones", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Extensiones", "title": "Extensión", "summary": "\nEl término extensión (y otros términos derivados, como extensa, extenso, extensor) aparece en esta enciclopedia en referencia a los siguientes conceptos:\n\n", "sections": [{"name": "Filosofía, lógica y lingüística", "text": "", "subsections": []}, {"name": "Matemáticas", "text": "", "subsections": []}, {"name": "Biología y medicina", "text": "", "subsections": []}, {"name": "Música", "text": "", "subsections": []}, {"name": "Informática", "text": "", "subsections": []}, {"name": "Educación universitaria", "text": "", "subsections": []}, {"name": "Otros usos", "text": "", "subsections": []}, {"name": "Extensidad, extensitud, extensividad y extensivo", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/FSF_Award_for_the_Advancement_of_Free_Software", "title": "FSF Award for the Advancement of Free Software", "summary": "El Free Software Foundation Award for the Advancement of Free Software (\"Premio para el Avance del Software Libre de la Fundación para el Software Libre\") se otorga anualmente a una persona que ha hecho una gran contribución al progreso y desarrollo del software libre, a través de actividades que vayan de acuerdo con el espíritu del software libre y a proyectos de beneficio social.\n\n", "sections": [{"name": "Ganadores", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Factorial", "title": "Factorial", "summary": "\n\n\n\nn\n\n\n{\\displaystyle n}\n\n\n\n\n\n\nn\n!\n\n\n{\\displaystyle n!}\n\n\nEl factorial de un entero positivo n, el factorial de n o n factorial se define en principio como el producto de todos los números enteros positivos desde 1 (es decir, los números naturales) hasta n. Por ejemplo:\n\n\n\n\n\n5\n!\n=\n1\n×\n2\n×\n3\n×\n4\n×\n5\n=\n120.\n \n\n\n{\\displaystyle 5!=1\\times 2\\times 3\\times 4\\times 5=120.\\ }\n\n\nLa operación de factorial aparece en muchas áreas de las matemáticas, particularmente en combinatoria y análisis matemático.\nDe manera fundamental el factorial de n representa el número de formas distintas de ordenar n objetos distintos (elementos sin repetición). Este hecho ha sido conocido desde hace varios siglos, en el siglo XII por los estudiosos hindúes.\n\nLa definición de la función factorial también se puede extender a números no naturales manteniendo sus propiedades fundamentales, pero se requieren matemáticas avanzadas, particularmente del análisis matemático. El matemático francés Christian Kramp (1760-1826) fue la primera persona en usar la actual notación matemática n!, en 1808.[1]​\n\nLos factoriales han sido descubiertos en varias culturas antiguas, especialmente en las matemáticas indias en las obras canónicas de la literatura jainista, y por los místicos judíos en el libro talmúdico Sefer Yetzirah. La operación factorial se encuentra en muchas áreas de las matemáticas, sobre todo en combinatoria, donde su uso más básico cuenta las posibles secuencias distintas —las permutaciones— de \n\n\n\nn\n\n\n{\\displaystyle n}\n\n objetos distintos: hay  \n\n\n\nn\n!\n\n\n{\\displaystyle n!}\n\n. En análisis matemático, los factoriales se utilizan en series de potencias para la función exponencial y otras funciones, y también tienen aplicaciones en álgebra, teoría de números, teoría de la probabilidad e informática.\n\nGran parte de la matemática de la función factorial se desarrolló a partir de finales del siglo XVIII y principios del XIX.\nLa aproximación de Stirling proporciona una aproximación exacta al factorial de los grandes números, demostrando que crece más rápidamente que el crecimiento exponencial. La  fórmula de Legendre describe los exponentes de los números primos en una factorización prima de los factoriales, y puede utilizarse para contar los ceros finales de los factoriales. Daniel Bernoulli y Leonhard Euler  interpolaron la función factorial a una función continua de números complejos, excepto en los enteros negativos, la función gamma (compensada).\n\nMuchas otras funciones notables y secuencias de números están estrechamente relacionadas con los factoriales, incluyendo el coeficiente binomial, doble factorial, factorial descendente, primorial, y subfactorial. Las implementaciones de la función factorial se utilizan habitualmente como ejemplo de diferentes estilos de programación informática, y se incluyen en calculadoras científicas y bibliotecas de software de cálculo científico. Aunque calcular directamente factoriales grandes utilizando la fórmula del producto o la recurrencia no es eficiente, se conocen algoritmos más rápidos, que igualan con un factor constante el tiempo de los  algoritmos de multiplicación rápidos para números con el mismo número de dígitos.\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Definición por producto e inducción", "text": "", "subsections": []}, {"name": "Propiedades", "text": "", "subsections": []}, {"name": "Aplicaciones", "text": "", "subsections": []}, {"name": "Extensión", "text": "", "subsections": []}, {"name": "Productos similares", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias y citas", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Falcon_(lenguaje_de_programaci%C3%B3n)", "title": "Falcon (lenguaje de programación)", "summary": "[\n]\nFalcon es un lenguaje de programación interpretado de código abierto multiparadigma diseñado por Giancarlo Niccolai. Se basa en una máquina virtual de propiedad y está disponible para las plataformas Microsoft Windows, GNU/Linux, Mac, Solaris y en el futuro BSD. Se propone como una herramienta para crear aplicaciones completas y aplicaciones web en relación con apache2. \n\n", "sections": [{"name": "Hello, world!", "text": "", "subsections": []}, {"name": "Paradigmas", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Filosof%C3%ADa_de_Unix", "title": "Filosofía de Unix", "summary": "La filosofía de Unix, originada por Ken Thompson, es un conjunto de normas culturales y enfoques filosóficos para el desarrollo de software minimalista y modular. Se basa en la experiencia de los principales desarrolladores del sistema operativo Unix. Los primeros desarrolladores de Unix fueron importantes para llevar los conceptos de modularidad y reutilización a la práctica de la ingeniería de programas informáticos, lo que dio lugar a un movimiento de \"herramientas de software\". Con el tiempo, los principales desarrolladores de Unix (y de los programas que se ejecutaban en él) establecieron un conjunto de normas culturales para el desarrollo de programas informáticos; estas normas llegaron a ser tan importantes e influyentes como la propia tecnología de Unix; esto se ha denominado \"filosofía Unix\".\n\nLa filosofía de Unix hace hincapié en la construcción de código simple, corto, claro, modular y extensible que pueda ser fácilmente mantenido y reutilizado por otros desarrolladores que no sean sus creadores. La filosofía de Unix favorece la componibilidad en oposición al diseño monolítico.\n\n", "sections": [{"name": "Origen", "text": "", "subsections": []}, {"name": "El Entorno de Programación del UNIX", "text": "", "subsections": []}, {"name": "Diseño de programas en el entorno UNIX", "text": "", "subsections": []}, {"name": "Doug McIlroy sobre la programación de Unix", "text": "", "subsections": []}, {"name": "Haz una cosa y hazla bien", "text": "", "subsections": []}, {"name": "Las 17 Reglas de Unix de Eric Raymond", "text": "", "subsections": []}, {"name": "Mike Gancarz: La Filosofía de UNIX", "text": "", "subsections": []}, {"name": "\"Peor es mejor\"", "text": "", "subsections": []}, {"name": "Crítica", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Notas", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Flask", "title": "Flask", "summary": "\nFlask es un framework minimalista escrito en Python que permite crear aplicaciones web rápidamente y con un mínimo número de líneas de código. Está basado en la especificación WSGI de Werkzeug y el motor de templates Jinja2 y tiene una licencia BSD.\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Ejemplo", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Foreach", "title": "Foreach", "summary": "\n\nBusca fuentes: «Foreach» – noticias · libros · académico · imágenes\nForeach (de la palabra inglesa for each = para cada uno) es un bloque constructivo de los lenguajes de programación para recorrer los elementos de una colección. Foreach se utiliza por lo general en lugar de una norma para la declaración. A diferencia de otras construcciones de bucle, los bucles foreach por lo general no mantienen contra-indicación explícita, que esencialmente dice \"haga esto a todo en este juego\" en lugar de \"hacer esto x veces.\" Esto evita posibles errores off-by-one y hace el código más fácil de leer. En lenguajes orientados a objetos un iterador, aunque implícito, a menudo se utiliza como medio de recorrido. Este bucle, implementado a partir de las versiones de PHP4, nos ayuda a recorrer los valores de un array, lo cual puede resultar muy útil por ejemplo para efectuar una lectura rápida del mismo. Recordemos que un array es una variable que guarda un conjunto de elementos (valores) catalogados por claves.[1]​\n\nLa sintaxis en pseudocódigo es la siguiente:\n\nUn ejemplo práctico es la lectura de un array, lo cual podría hacerse del siguiente modo:  \n\n\nforeach\n \n(\n$array\nas\n$clave\n=>\n$valor\n)\n{\n   \ninstrucción\n1\n;\n  \n2\n…\n", "sections": [{"name": "Ejemplo en PHP", "text": "", "subsections": []}, {"name": "Ejemplo en Java", "text": "", "subsections": []}, {"name": "Ejemplo en C#", "text": "", "subsections": []}, {"name": "Ejemplo en LISP", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Free_Software_Foundation", "title": "Free Software Foundation", "summary": "\n\n\nLa Fundación por el Software Libre o Free Software Foundation es una organización creada en octubre de 1985 por Richard Stallman y otros entusiastas del software libre con el propósito de difundir este movimiento.\nLa Free Software Foundation (FSF) es una organización sin fines de lucro con la misión mundial de promover la libertad de los usuarios de computadoras. Defendemos los derechos de todos los usuarios de software.[1]​\nFSF centra su trabajo fundamentalmente en asuntos legales, organizativos y promocionales en beneficio de la comunidad de usuarios de software libre.\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Actividades", "text": "", "subsections": []}, {"name": "Organización", "text": "", "subsections": []}, {"name": "Críticas y detractores", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/GNU_General_Public_License", "title": "GNU General Public License", "summary": "\n \n \n \n \n\nSí\n[\n]\n\nNo\n \nLa Licencia Pública General de GNU o más conocida por su nombre en inglés GNU General Public License (o simplemente sus siglas en inglés GNU GPL) es una licencia de derecho de autor ampliamente usada en el mundo del software libre y código abierto,[6]​ y garantiza a los usuarios finales (personas, organizaciones, compañías) la libertad de usar, estudiar, compartir (copiar) y modificar el software. Su propósito es doble: declarar que el software cubierto por esta licencia es libre, y protegerlo (mediante una práctica conocida como copyleft) de intentos de apropiación que restrinjan esas libertades a nuevos usuarios cada vez que la obra es distribuida, modificada o ampliada. Esta licencia fue creada originalmente por Richard Stallman, fundador de la Free Software Foundation (FSF) para el proyecto GNU.\n\nLa Free Software Foundation pone la GPL a disposición de cualquiera que desee proteger los derechos de sus usuarios finales (usar, compartir, estudiar y modificar), y otorgar a los beneficiarios de un programa de ordenador u otro tipo de obra los derechos de la definición de software libre.[7]​ La GPL se distingue del dominio público o de otras licencias de software libre conocidas como permisivas por hacer hincapié en el copyleft, o solo permitir que las copias y derivados de una obra bajo la GPL perpetúen la misma licencia.\n\nLa mayor parte del software GNU es copyleft, pero no todo; sin embargo, todo el software GNU debe ser software libre.\n\nParte del software GNU fue escrito por el equipo de la Free Software Foundation, pero la mayor parte proviene de algunos voluntarios. La Free Software Foundation es titular del copyright de parte de ese software, otra parte está bajo el copyright de sus autores.\n\nDavid A. Wheeler sostiene que el copyleft proporcionado por la GPL fue crucial para el éxito de sistemas basados en Linux, dando a los programadores que han contribuido al núcleo la seguridad de que de su trabajo se beneficiaría todo el mundo y seguirá siendo libre, en lugar de ser explotado por compañías de software que no tendrían que dar nada de nuevo a la comunidad.[8]​\n\nLos usuarios o compañías que distribuyen sus trabajos bajo las GPL, pueden cobrar o distribuirlas gratuitamente. Esto distingue las GPL de las licencias de software que prohíben su distribución comercial. La FSF argumenta que no se debe restringir la distribución comercial del software (incluyendo la redistribución),[9]​ y en ese tenor la GPL establece explícitamente que las obras cubiertas por esta licencia se pueden vender a cualquier precio\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Términos y condiciones", "text": "", "subsections": []}, {"name": "Compatibilidad y licencias múltiples", "text": "", "subsections": []}, {"name": "Validez legal", "text": "", "subsections": []}, {"name": "Adopción", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Notas", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/GTK", "title": "GTK", "summary": "\n\nGTK (conocido hasta febrero de 2019 como GTK+)[1]​[2]​ o The GIMP Toolkit[3]​[4]​: 3  es una biblioteca de componentes gráficos multiplataforma para desarrollar interfaces gráficas de usuario (GUI).[5]​[4]​: 3  Está licenciado bajo los términos de la GNU LGPL,[5]​ por lo que permite la creación de tanto software libre como software privativo. GTK es parte del proyecto GNU,[5]​ siendo usado por proyectos tan importantes como GIMP, Inkscape, GNOME, Xfce, entre otros.\n\nJunto a Qt, es uno de los kit de herramientas de widgets más popular para el sistema operativo GNU/Linux, teniendo un amplio soporte para Wayland y XOrg. Además, se puede emplear para desarrollar aplicaciones gráficas que funcionen sobre otros sistemas Unix-like o sistemas operativos como Microsoft Windows, Mac OS, entre otros.\n\n", "sections": [{"name": "Historia y Desarrollo", "text": "", "subsections": []}, {"name": "Bibliotecas de GTK", "text": "", "subsections": []}, {"name": "Diseñadores de interfaces gráficas (GUI)", "text": "", "subsections": []}, {"name": "Uso", "text": "", "subsections": []}, {"name": "Implementaciones disponibles", "text": "", "subsections": []}, {"name": "Ejemplos", "text": "", "subsections": []}, {"name": "Estilo gráfico", "text": "", "subsections": []}, {"name": "Crítica", "text": "", "subsections": []}, {"name": "Historial de lanzamientos", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/GUI", "title": "Interfaz gráfica de usuario", "summary": "La interfaz gráfica de usuario, conocida también como GUI (del inglés graphical user interface), es un programa informático que actúa de interfaz de usuario, utilizando un conjunto de imágenes y objetos gráficos para representar la información y acciones disponibles en la interfaz. Su principal uso consiste en proporcionar un entorno visual sencillo para permitir la comunicación con el sistema operativo de una máquina o computador.\n\nHabitualmente las acciones se realizan mediante manipulación directa, para facilitar la interacción del usuario con la computadora. Surge como evolución de las interfaces de línea de comandos que se usaban para operar los primeros sistemas operativos y es pieza fundamental en un entorno gráfico. Como ejemplos de interfaz gráfica de usuario, cabe citar los entornos de escritorio Windows, el de GNU/Linux o el de Mac OS X, Aqua.\n\nEn el contexto del proceso de interacción persona-computadora, la interfaz gráfica de usuario es el artefacto tecnológico de un sistema interactivo que posibilita, a través del uso y la representación del lenguaje visual, una interacción amigable con un sistema informático.\n\n", "sections": [{"name": "Diseño de la interfaz de usuario y de interacción", "text": "", "subsections": []}, {"name": "Historia", "text": "", "subsections": []}, {"name": "Tipos de interfaces gráficas de usuario", "text": "", "subsections": []}, {"name": "Idioma", "text": "", "subsections": []}, {"name": "Interfaz gráfica de usuario tridimensional", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Bibliografía", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Generador_(inform%C3%A1tica)", "title": "Generador (informática)", "summary": "En programación, un generador es una rutina especial que se puede usar para controlar el comportamiento de un iterador en un bucle.\nUn generador es muy similar a una función que devuelve un vector, en el que un generador tiene los parámetros que se pueden llamar, y genera una secuencia de valores.\n\nLa manera más simple de conseguir una secuencia de datos es declarando un array o vector declarando manualmente cada valor. Esta práctica puede volverse tediosa y consumir mucho tiempo al desarrollador si el array o vector requiere que existan una gran cantidad de elementos dentro de él. En ese caso un generador resulta ser una manera más rápida de declarar el array o vector.\n\nOtra gran ventaja de los generadores radica en que consume una menor cantidad de recursos en memoria, por lo tanto, permite que quien lo llama comience a procesar los primeros valores inmediatamente. En resumen, un generador se asemeja a una función pero se comporta como un iterador.\n\nLos generadores pueden implementarse en construcciones de control de flujo más expresivas, como la continuación de objetos de primera clase o como co-funciones.\n\nLos generadores aparecen por primera vez en 1975 en el lenguaje CLU; y están disponibles en Python, C#, JavaScript, [Ruby] y en otros lenguajes. En CLU y C#, los generadores se llaman iteradores y en Ruby enumeradores.\n\n", "sections": [{"name": "Python", "text": "", "subsections": []}, {"name": "Ruby", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Genie_(lenguaje_de_programaci%C3%B3n)", "title": "Genie (lenguaje de programación)", "summary": "Genie es un lenguaje de programación de alto nivel, moderno, y de propósito general en desarrollo activo desde el año 2008.[1]​ Fue diseñado como un dialecto  alternativo más simple y limpio para el compilador Vala, preservando al mismo tiempo la misma funcionalidad del lenguaje Vala. La sintaxis de Genie se deriva de numerosos lenguajes modernos como Python, Boo, D y Delphi.\n\nAl igual que Vala, Genie usa el sistema de tipos GObject para crear clases e interfaces declaradas en el código fuente de Genie, sin imponer requisitos adicionales de tiempo de ejecución (es decir, a diferencia de Python, Java o Mono, este no requiere una máquina virtual).\n\nGenie permite el acceso a las bibliotecas de C, especialmente las basadas en GObject (como GTK+), sin necesidad de utilizar otro API. Durante la compilación, el código se traduce primero a código fuente y cabeceras de C, que se compilan entonces al código de máquina con cualquier compilador C disponible como GCC, lo cual permite el desarrollo de software multi-plataforma.\n\nAunque tanto Vala como Genie son desarrollados y promovidos por el proyecto Gnome, los programas desarrollados en Genie no dependen del entorno de escritorio Gnome, y usualmente requieren solo de GLib.\n\n", "sections": [{"name": "Diferencias con Vala", "text": "", "subsections": []}, {"name": "Sangría", "text": "", "subsections": []}, {"name": "Ejemplos de código", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Gesti%C3%B3n_de_memoria", "title": "Gestión de memoria", "summary": "La gestión de memoria o administración de memoria es el acto de gestionar la memoria de un dispositivo informático. El proceso de asignación de memoria a los programas que la solicitan.[1]​ \n\nLos sistemas de memoria virtual separan las direcciones de memoria utilizadas por un proceso de las direcciones físicas reales, permitiendo la separación de procesos e incrementando la cantidad efectiva de memoria de acceso aleatorio utilizando la paginación. La calidad de la gestión de la memoria es crucial para las prestaciones del sistema.\n\nEl recolector de basura es la asignación y liberación automática de los recursos de memoria para un programa. La implementación suele ser a nivel del lenguaje de programación en contraposición a la gestión manual de memoria, que asigna y libera los recursos de memoria de una computadora de forma explícita.\n\nLa administración de memoria se refiere a los distintos métodos y operaciones que se encargan de obtener la máxima utilidad de la memoria, organizando los procesos y programas que se ejecutan de manera tal que se aproveche de la mejor manera posible el espacio disponible.\n\nPara poder lograrlo, la operación principal que realiza es trasladar la información que deberá ser ejecutada por la unidad central de procesamiento o procesador, a la memoria principal. Actualmente esta administración se conoce como memoria virtual, porque no es la memoria física del procesador sino una memoria virtual que la representa. Entre algunas ventajas, esta memoria permite que el sistema cuente con una memoria más extensa teniendo la misma memoria real, por lo que esta se puede utilizar de manera más eficiente. Y por supuesto, que los programas que son utilizados no ocupen lugar innecesario.\n\nLas técnicas que existen para la carga de programas en la memoria son: partición fija, que es la división de la memoria libre en varias partes (de igual o distinto tamaño) y la partición dinámica, que son las particiones de la memoria en tamaños que pueden ser variables, según la cantidad de memoria que necesita cada proceso.\n\nEntre las principales operaciones que desarrolla la administración de memoria se encuentran la reubicación, que consiste en trasladar procesos activos dentro y fuera de la memoria principal para maximizar la utilización del procesador; la protección, mecanismos que protegen los procesos que se ejecutan de interferencias de otros procesos; uso compartido de códigos y datos, con lo que el mecanismo de protección permite que ciertos procesos de un mismo programa que comparten una tarea tengan memoria en común.\n\n", "sections": [{"name": "Requisitos", "text": "", "subsections": []}, {"name": "Gestión de memoria en DOS", "text": "", "subsections": []}, {"name": "Notas y referencias", "text": "", "subsections": []}, {"name": "Bibliografía", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Go_(lenguaje_de_programaci%C3%B3n)", "title": "Go (lenguaje de programación)", "summary": "\n[\n]\nGo es un lenguaje de programación concurrente y compilado con tipado estático inspirado en la sintaxis de C, pero con seguridad de memoria y recolección de basura. Ha sido desarrollado por Google[9]​ y sus diseñadores iniciales fueron Robert Griesemer, Rob Pike y Ken Thompson.[10]​ Actualmente está disponible en formato binario para los sistemas operativos Windows, GNU/Linux, FreeBSD  y Mac OS X, pudiendo también ser instalado en estos y en otros sistemas mediante el código fuente.[11]​[12]​ Go es un lenguaje de programación compilado, concurrente, imperativo, estructurado y orientado a objetos que de momento está disponible para diferentes tipos de sistemas Unix-like, incluidos Linux, FreeBSD, Mac OS X y Plan 9 (puesto que parte del compilador está basado en un trabajo previo sobre el sistema operativo Inferno). Las arquitecturas soportadas son i386, amd64 y ARM.\n\n", "sections": [{"name": "Nombrado", "text": "", "subsections": []}, {"name": "Características", "text": "", "subsections": []}, {"name": "Excepciones", "text": "", "subsections": []}, {"name": "Diferencias principales con C", "text": "", "subsections": []}, {"name": "Programación orientada a objetos", "text": "", "subsections": []}, {"name": "Aplicaciones", "text": "", "subsections": []}, {"name": "Ejemplos", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Gr%C3%A1ficas_tortuga", "title": "Gráficas tortuga", "summary": "Gráfica tortuga es un término usado en computación gráfica como método para programar gráficos vectoriales usando un cursor (la «tortuga») relativo a unas coordenadas cartesianas. Las gráficas tortuga son un elemento clave en el Lenguaje de programación Logo.\n\n", "sections": [{"name": "Resumen", "text": "", "subsections": []}, {"name": "Historia", "text": "", "subsections": []}, {"name": "Extensión a las tres dimensiones", "text": "", "subsections": []}, {"name": "Gráfica tortuga programada en Python", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Bibliografía", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Groovy_(lenguaje_de_programaci%C3%B3n)", "title": "Groovy (lenguaje de programación)", "summary": "\n\nGroovy es un lenguaje de programación orientado a objetos implementado sobre la plataforma Java. Tiene características similares a Python, Ruby, Perl y Smalltalk. La especificación JSR 241 se encarga de su estandarización para una futura inclusión como componente oficial de la plataforma Java. \n\nGroovy usa una sintaxis muy parecida a Java, comparte el mismo modelo de objetos, de hilos y de seguridad. Desde Groovy se puede acceder directamente a todas las API existentes en Java. El bytecode generado en el proceso de compilación es totalmente compatible con el generado por el lenguaje Java para la Java Virtual Machine (JVM), por tanto puede usarse directamente en cualquier aplicación Java. Todo lo anterior unido a que la mayor parte de código escrito en Java es totalmente válido en Groovy hacen que este lenguaje sea de muy fácil adopción para programadores Java; la curva de aprendizaje se reduce mucho en comparación con otros lenguajes que generan bytecode para la JVM, tales como Jython  o JRuby. Groovy puede usarse también de manera dinámica como un lenguaje de scripting. \n\nGroovy 1.0 apareció el 2 de enero de 2007. Después de varias versiones beta y otras tantas candidatas a release, el 7 de diciembre de 2007 apareció la versión Groovy 1.1 que finalmente fue renombrada a Groovy 1.5 con el fin de notar la gran cantidad de cambios que ha sufrido con respecto a la versión 1.0. En diciembre de 2009 se publicó la versión 1.7.\n\n", "sections": [{"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Guido_van_Rossum", "title": "Guido van Rossum", "summary": "\n \n \n \n \n \nPythonABC \nGuido van Rossum (Haarlem, Países Bajos, 31 de enero de 1956) es un informático,[1]​ conocido por ser el autor del lenguaje de programación Python. Nació y creció en los Países Bajos.\n\nEs la primera persona en obtener el título BDFL (Benevolent Dictator for Life), cuyo título es otorgado a personajes importantes en el mundo del código abierto, teniendo asignada la tarea de fijar las directrices sobre la evolución de Python, así como la de tomar decisiones finales sobre el lenguaje que todos los desarrolladores acatan. Van Rossum tiene fama de ser bastante conservador, realizando pocos cambios al lenguaje entre versiones sucesivas, intentando mantener siempre la compatibilidad con versiones anteriores. El 12 de julio de 2018, con un mensaje enviado a la lista de python-committers, anunció su retiro de los procesos de decisión.[2]​\n\nEn el año 2001 recibió el FSF Award for the Advancement of Free Software como reconocimiento por su trabajo.[3]​ En diciembre de 2005 fue contratado como desarrollador por la empresa estadounidense Google. Después de siete años en Google, a principios de diciembre de 2012, anuncia su retirada de la empresa norteamericana para incorporarse en enero de 2013 a la plantilla de la compañía Dropbox.[4]​ Desde noviembre del 2020 es parte de la División de Desarrolladores de la empresa Microsoft.\n\n", "sections": [{"name": "Biografía", "text": "", "subsections": []}, {"name": "Trabajo", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Notas y referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Haskell", "title": "Haskell", "summary": "\nHaskell (pronunciado /ˈhæskəl/)[1]​ es un lenguaje de programación estandarizado multi-propósito, funcionalmente puro, con evaluación no estricta y memorizada, y fuerte tipificación estática. Su nombre se debe al lógico estadounidense Haskell Curry, debido a su aporte al cálculo lambda, el cual tiene gran influencia en el lenguaje. En Haskell, \"una función es un ciudadano de primera clase\" del lenguaje de programación. Como lenguaje de programación funcional, el constructor de controles primario es la función. El lenguaje tiene sus orígenes en las observaciones de Haskell Curry y sus descendientes intelectuales.\n\nEn los años 1980 se constituyó un comité cuyo objetivo era crear un lenguaje funcional que reuniera las características de los múltiples lenguajes funcionales de la época, el más notable Miranda, y resolviera la confusión creada por la proliferación de los mismos.\n\nEl lenguaje evoluciona rápidamente y (ver más abajo) como los representantes actuales del estándar de facto. El último estándar oficial es: Haskell 2010, cuyas diferencias respecto al anterior estándar Haskell 98 son:\n\nNuevas características del lenguaje:\n\n\nInterfaz de funciones foráneas (FFI), que permite usar código C en un programa Haskell y código Haskell en un programa C. Un ejemplo explicativo se puede encontrar aquí\nNombres jerárquicos para los módulos, por ejemplo Data.Bool.\nGuardianes con patrones.\n\nCaracterísticas eliminadas del lenguaje:\n\n\nSintaxis de patrones (n+k). Con lo cual, la siguiente definición de la función factorial no es válida en Haskell 2010 y posteriores: fact (n+1) = (n+1) * fact n.\n\nLas características más interesantes de Haskell incluyen el soporte para tipos de datos y funciones recursivas, listas, tuplas, guardas y encaje de patrones. La combinación de las mismas pueden resultar en algunas funciones casi triviales cuya versión en lenguajes imperativos pueden llegar a resultar extremadamente tediosas de programar. Haskell es, desde 2002, uno de los lenguajes funcionales sobre los que más se ha investigado. Se han desarrollado muchas variantes:\n\nVersiones paralelas del MIT y Glasgow, ambas denominadas Parallel Haskell.\nMás versiones paralelas y distribuidas de Haskell llamadas Distributed Haskell (anteriormente Goffin) y Eden.\nUna versión con ejecución especulativa: Eager Haskell.\nVarias versiones orientadas a objetos: Haskell++, O'Haskell y Mondrian.\nUna versión educativa llamada Gofer desarrollada por Mark Jones que fue suplantada por Hugs (ver abajo).\nPara información más detallada, referirse al sitio oficial o a los enlaces al final de este artículo.\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Tipos simples predefinidos", "text": "", "subsections": []}, {"name": "Implementaciones", "text": "", "subsections": []}, {"name": "Entornos de desarrollo", "text": "", "subsections": []}, {"name": "Web Frameworks", "text": "", "subsections": []}, {"name": "Comunidad", "text": "", "subsections": []}, {"name": "Ejemplos", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Notas y referencias", "text": "", "subsections": []}, {"name": "Bibliografía", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Herencia_(inform%C3%A1tica)", "title": "Herencia (informática)", "summary": "\n\nBusca fuentes: «Herencia (informática)» – noticias · libros · académico · imágenes\nEn programación orientada a objetos, la herencia es, después de la agregación o composición, el mecanismo más utilizado para alcanzar algunos de los objetivos más preciados en el desarrollo de software como lo son la reutilización y la extensibilidad. A través de ella, los diseñadores pueden crear nuevas clases partiendo de una clase o de una jerarquía de clases preexistente (ya comprobadas y verificadas) evitando con ello el rediseño, la modificación y verificación de la parte ya implementada. La herencia facilita la creación de objetos a partir de otros ya existentes e implica que una subclase obtiene todo el comportamiento (métodos) y finalmente los atributos (variables) de su superclase.\n\nEs la relación entre una clase general y otra clase más específica.\nPor ejemplo: Si declaramos una clase párrafo derivada de una clase texto, todos los métodos y variables asociadas con la clase texto, son automáticamente heredados por la subclase párrafo.\n\nLa herencia es uno de los mecanismos de los lenguajes de programación orientada a objetos basados en clases, por medio del cual una clase se deriva de otra de manera que extiende su funcionalidad. La clase de la que se hereda se suele denominar clase base, clase padre, superclase, clase ancestro (el vocabulario que se utiliza suele depender en gran medida del lenguaje de programación).\n\nEn los lenguajes que cuentan con un sistema de tipos fuerte y estrictamente restrictivo con el tipo de datos de las variables, la herencia suele ser un requisito fundamental para poder emplear el Polimorfismo, al igual que un mecanismo que permita decidir en tiempo de ejecución qué método debe invocarse en respuesta a la recepción de un mensaje, conocido como enlace tardío o enlace dinámico.\n\n", "sections": [{"name": "Ejemplo en Java", "text": "", "subsections": []}, {"name": "Clase Abstracta", "text": "", "subsections": []}, {"name": "Herencia y ocultación de información", "text": "", "subsections": []}, {"name": "Redefinición de métodos", "text": "", "subsections": []}, {"name": "Ventajas", "text": "", "subsections": []}, {"name": "Desventajas", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Herencia_m%C3%BAltiple", "title": "Herencia múltiple", "summary": "Herencia múltiple hace referencia a la característica de los lenguajes de programación orientada a objetos en la que una clase puede heredar comportamientos y características de más de una superclase. Esto contrasta con la herencia simple, donde una clase solo puede heredar de una superclase.\n\nAlgunos lenguajes que soportan herencia múltiple en su mayor parte son: C++, Centura SQL Windows, CLOS, Eiffel, Object REXX, Perl y Python.\n\nLa herencia múltiple permite a una clase tomar funcionalidades de otras clases, como permitir a una clase llamada MusicoEstudiante heredar de una clase llamada Persona, una clase llamada Músico, y una clase llamada Trabajador. Esto puede ser abreviado como MusicoEstudiante : Persona, Músico, Trabajador.\n\n", "sections": [{"name": "Ambigüedades", "text": "", "subsections": []}, {"name": "Debate", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Historia_de_Python", "title": "Historia de Python", "summary": "Artículo principal:\nPython es uno de los lenguajes de programación dinámicos más populares que existen entre los que se encuentran Java, JavaScript, Go y C#. Aunque es considerado a menudo como un lenguaje \"scripting\", es realmente un lenguaje de propósito general. En la actualidad, Python es usado para todo, desde simples \"scripts\", hasta grandes servidores web que proveen servicio ininterrumpido 24×7. Es utilizado para la programación de interfaces gráficas y bases de datos, programación web tanto en el cliente como en el servidor (véase Django o Flask) y \"testing\" de aplicaciones. Además tiene una amplia aceptación por científicos que hacen aplicaciones para las supercomputadores más rápidas del mundo y por los niños que recién están comenzando a programar.\n\nLa historia del lenguaje de programación Python se remonta hacia finales de los 80s y principio de los 90s,[1]​ su implementación comenzó en diciembre de 1989[2]​ cuando en Navidad Guido van Rossum que trabajaba en el (CWI) (un centro de investigación holandés de carácter oficial que, entre otras cosas, actualmente alberga la oficina central del W3C) decidió empezar el proyecto como un pasatiempo dándole continuidad al lenguaje de programación ABC del que había formado parte del equipo de desarrollo en el CWI,[3]​ dicho lenguaje se enfocaba en ser fácil de usar y aprender manteniendo potencia en su desempeño pero el hardware disponible en la época de su creación hacía difícil su uso y el proyecto no trascendió como se esperaba. Van Rossum es por tanto el autor principal de Python y continúa ejerciendo un rol central decidiendo la dirección del lenguaje, en la comunidad de Python se le conoce como Benevolente Dictador Vitalicio (en inglés: Benevolent Dictator for Life, BDFL). El nombre \"Python\" viene dado por la afición de Van Rossum al grupo Monty Python.\n\nEl lenguaje de programación Python fue originalmente desarrollado para el sistema operativo Amoeba.\n\n", "sections": [{"name": "Principales influencias de otros lenguajes", "text": "", "subsections": []}, {"name": "Cronología de Python", "text": "", "subsections": []}, {"name": "Primera publicación", "text": "", "subsections": []}, {"name": "Versión 1.0", "text": "", "subsections": []}, {"name": "Versión 2.0", "text": "", "subsections": []}, {"name": "Versión 3.0", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Holand%C3%A9s", "title": "Holandés", "summary": "\nEl término holandés puede referirse a:\n\nEl natural de Holanda, o lo perteneciente o relativo a esta región de los Países Bajos.\nEl dialecto holandés hablado allí.\nAdemás, es muy frecuente usarlo para referirse a: \n\nEl natural de Países Bajos (Nederland), o lo perteneciente o relativo a este Estado europeo.\nEl idioma neerlandés, la lengua oficial de dicho Estado.\nEl pueblo neerlandés, la población nativa del mismo.", "sections": []}
{"url": "https://es.wikipedia.org/wiki/Huevo_de_pascua_(virtual)", "title": "Huevo de pascua (virtual)", "summary": "Un huevo de Pascua o huevo pascual[1]​ (en inglés Easter egg) es un mensaje o capacidad oculta contenido en películas, series de televisión, discos compactos, DVD, Blu-ray, programas informáticos o videojuegos.\nEntre los programadores, parece haber una motivación en dejar una marca personal, casi un toque artístico sobre un producto intelectual, el cual es por naturaleza estándar y funcional.\nActualmente, los huevos de Pascua tratan de entretener, buscar nuevos trabajos potenciales, pagar tributo a los ejecutivos o divertir a los programadores.[2]​\n\n", "sections": [{"name": "Origen", "text": "", "subsections": []}, {"name": "En videojuegos", "text": "", "subsections": []}, {"name": "Computación", "text": "", "subsections": []}, {"name": "Tesla", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Humorista", "title": "Humorista", "summary": "\nPor favor, edítalo y/o discute los problemas en la discusión para mejorarlo:\nNecesita ser wikificado conforme a las convenciones de estilo de Wikipedia.\nSu redacción mantiene un punto de vista regional. Por favor, amplíalo para que cubra el tema desde una perspectiva global.\nUn humorista,  es una persona que en sus obras —literarias o plásticas—, o en sus actuaciones en espectáculos públicos, cultiva el humor.[1]​ Puede ser una persona que se dedique profesionalmente a la producción de obras escritas o gráficas, o a hacer intervenciones públicas con fines humorísticos. Un humorista no es un cómico, a pesar de que hay casos en que se pueden combinar ambas profesiones. También son frecuentes los ejemplos de producciones humorísticas parciales entre otras actividades de carácter general referidas a una misma persona.\n\n", "sections": [{"name": "Humorismo literario", "text": "", "subsections": []}, {"name": "Lista genérica de humoristas notables", "text": "", "subsections": []}, {"name": "Humorismo gráfico", "text": "", "subsections": []}, {"name": "Humorismo cinematográfico", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/IDLE", "title": "IDLE", "summary": "\nIDLE (abreviatura de Integrated Development and Learning Environment, en español: «Entorno de desarrollo y aprendizaje integrado»)[1]​ es un entorno de desarrollo integrado para Python, que se incluye con la implementación predeterminada del lenguaje desde la versión 1.5.2b1.[2]​ Está empaquetado como una parte opcional del paquete de Python con muchas distribuciones de Linux.\n\nIDLE está destinado a ser un entorno de desarrollo integrado simple y enfocado para su uso por parte de usuarios principiantes, especialmente en un entorno educativo. Con ese fin, es multiplataforma y evita la sobrecarga de funcionalidades.\n\nSegún el archivo README incluido, sus principales características son:\n\nEditor de texto de múltiples ventanas con resaltado de sintaxis, autocompletado, sangría inteligente y otros.\nIntérprete de Python con resaltado de sintaxis.\nDepurador integrado con pasos, breakpoints persistentes y visualización de espacios de nombres locales y globales.[3]​\nEl autor, Guido van Rossum, explicó que IDLE significa \"Integrated DeveLopment Environment\",[4]​ y dado que van Rossum nombró al lenguaje Python en honor al grupo de comedia británico Monty Python, el nombre IDLE probablemente también fue elegido para honrar a Eric Idle, uno de los miembros fundadores de Monty Python.[5]​[6]​\n\n", "sections": [{"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/IPython", "title": "IPython", "summary": "\n\nPythonJavaScriptC\nIPython es un shell interactivo que añade funcionalidades extra al modo interactivo incluido con Python, como resaltado de líneas y errores mediante colores, una sintaxis adicional para el shell, autocompletado mediante tabulador de variables, módulos y atributos; entre otras funcionalidades. Es un componente del paquete SciPy.\n\n", "sections": [{"name": "Computación en paralelo Parallel computing", "text": "", "subsections": []}, {"name": "Notebook", "text": "", "subsections": []}, {"name": "Proyecto Jupyter", "text": "", "subsections": []}, {"name": "Otras características", "text": "", "subsections": []}, {"name": "En los medios de comunicación", "text": "", "subsections": []}, {"name": "Fin de la compatibilidad con Python 2", "text": "", "subsections": []}, {"name": "Proyecto Jupyter", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces de interés", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/ISBN", "title": "ISBN", "summary": "El ISBN (por las siglas en inglés de International Standard Book Number, en español «código Internacional normalizado para libros»)[1]​ es un identificador único para libros.[Nota 1]​ Mediante este sistema, a cada libro se le asigna una cadena numérica única internacional que sirve para identificar datos básicos del objeto tales como título, editorial, tirada, extensión, materia, país, traductor, lengua original, etc. No debe confundirse con el ISSN (International Standard Serial Number, en español «número internacional normalizado de publicaciones periódicas»),[2]​ que corresponde al de las publicaciones periódicas, como revistas y diarios.\n\n", "sections": [{"name": "Descripción", "text": "", "subsections": []}, {"name": "Sistemas similares", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Notas", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Icon", "title": "Icon", "summary": "Icon es un lenguaje de programación de muy alto nivel, especialmente recomendado para trabajar con cadenas de texto, ya que permite una programación rápida y concisa. Puede ser usado para análisis y formateo de textos, inteligencia artificial o programación de prototipos. Las últimas versiones, además, incluyen gráficos y facilidades GUI. Fue diseñado en los años 1970 por Ralph E. Griswold, y otros colaboradores en el \"Department of Computer Science\" de la Universidad de Arizona. Griswold, que lideraba el proyecto, ya tenía experiencia anterior en el diseño de lenguajes de alto nivel, ya que fue uno de los creadores de Snobol, del que tomaron algunas características.\n\n", "sections": [{"name": "Sintaxis básica", "text": "", "subsections": []}, {"name": "Evaluación de expresiones", "text": "", "subsections": []}, {"name": "Generadores", "text": "", "subsections": []}, {"name": "Exploración de cadenas", "text": "", "subsections": []}, {"name": "Estructuras", "text": "", "subsections": []}, {"name": "Facilidades gráficas", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Int%C3%A9rprete_(inform%C3%A1tica)", "title": "Intérprete (informática)", "summary": "En ciencias de la computación, intérprete o interpretador es un programa informático capaz de analizar y ejecutar otros programas. Los intérpretes se diferencian de los compiladores o de los ensambladores en que mientras estos traducen un programa desde su descripción en un lenguaje de programación al código de máquina del sistema, los intérpretes solo realizan la traducción a medida que sea necesaria, típicamente, instrucción por instrucción, y normalmente no guardan el resultado de dicha traducción.\n\nUsando un intérprete, un solo archivo fuente puede producir resultados iguales incluso en sistemas sumamente diferentes (ejemplo. una PC y una PlayStation 4). Usando un compilador, un solo archivo fuente puede producir resultados iguales solo si es compilado a distintos ejecutables específicos a cada sistema.\n\nLos programas interpretados suelen ser más lentos que los compilados debido a la necesidad de traducir el programa mientras se ejecuta, pero a cambio son más flexibles como entornos de programación y depuración (lo que se traduce, por ejemplo, en una mayor facilidad para reemplazar partes enteras del programa o añadir módulos completamente nuevos), y permiten ofrecer al programa interpretado un entorno no dependiente de la máquina donde se ejecuta el intérprete, sino del propio intérprete (lo que se conoce comúnmente como máquina virtual).\n\nPara mejorar el desempeño, algunas implementaciones de algunos lenguajes de programación pueden interpretar o compilar el código fuente original en una forma intermedia  más compacta, y después traducir eso al código de máquina (ej. Perl, Python, MATLAB, y Ruby). Algunos aceptan los archivos fuente guardados en esta representación intermedia (ej. Python, UCSD Pascal y Java).\n\nEn la actualidad, uno de los entornos más comunes de uso de los intérpretes es en los navegadores web, debido a la posibilidad que estos tienen de ejecutarse independientemente de la plataforma.\n\n", "sections": [{"name": "Intérpretes de bytecode", "text": "", "subsections": []}, {"name": "Eficiencia", "text": "", "subsections": []}, {"name": "Interpretadores de árbol de sintaxis abstracta", "text": "", "subsections": []}, {"name": "Compilación justo a tiempo", "text": "", "subsections": []}, {"name": "Ejemplos", "text": "", "subsections": []}, {"name": "Lenguaje interpretado", "text": "", "subsections": []}, {"name": "Notas y referencias", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Int%C3%A9rprete_de_comandos", "title": "Intérprete de comandos", "summary": "\nPara más información, véase la discusión.\nUn intérprete de órdenes o de comandos es un programa informático que tiene la capacidad de traducir las órdenes que introducen los usuarios, mediante un conjunto de instrucciones facilitadas por él mismo directamente al núcleo y al conjunto de herramientas que forman el sistema operativo.[1]​ Las órdenes se introducen siguiendo la sintaxis incorporada por dicho intérprete, dentro del entorno proporcionado por el emulador de terminal, mediante un inductor que espera a que le sean introducidos los comandos o instrucciones PROMPT>nombrecomando argumento/s /ruta/hacia/el/o/los/ficheros\n\nAl ingresar la orden con la tecla 'Intro', el intérprete analiza la secuencia de caracteres ingresada y, si la sintaxis de la orden es correcta, la ejecuta, recurriendo para ello a las funciones que ofrece el sistema operativo o el programa que representa, bien sea un gestor de datos de banco, una sesión de FTP, de ssh, etc. La respuesta al usuario se representa en el monitor o en forma de segundo plano. Se trabaja de manera interactiva, es decir, usuario y máquina se comunican de forma sucesiva.[2]​\n\nIncorporan características tales como control de procesos, redirección de entrada/salida, listado y lectura de ficheros, protección, comunicaciones y un lenguaje de órdenes para escribir programas por lotes o (scripts o guiones). Uno de los intérpretes más conocidos, es el Bourne Shell, el cual fue el intérprete usado en las primeras versiones de Unix y se convirtió en un estándar de facto.[3]​\n\n", "sections": [{"name": "Interfaz de línea de comandos", "text": "", "subsections": []}, {"name": "Historia", "text": "", "subsections": []}, {"name": "Funcionamiento", "text": "", "subsections": []}, {"name": "Implementaciones", "text": "", "subsections": []}, {"name": "Estándar de invocación", "text": "", "subsections": []}, {"name": "Ejemplos de interacción", "text": "", "subsections": []}, {"name": "Interfaz textual de usuario", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Inteligencia_artificial", "title": "Inteligencia artificial", "summary": "\n\nLa inteligencia artificial  (IA), en el contexto de las ciencias de la computación, es una disciplina y un conjunto de capacidades cognoscitivas e intelectuales expresadas por sistemas informáticos o combinaciones de algoritmos cuyo propósito es la creación de máquinas que imiten la inteligencia humana para realizar tareas, y que pueden mejorar conforme recopilen información.[1]​[2]​ Se hizo presente poco después de la Segunda Guerra Mundial con el desarrollo de la «prueba de Turing», mientras que la locución fue acuñada en 1956 por el informático John McCarthy en la Conferencia de Dartmouth.\n\nEn la actualidad, la inteligencia artificial abarca una gran variedad de subcampos. Éstos van desde áreas de propósito general, aprendizaje y percepción, a otras más específicas como el Reconocimiento de voz, el juego de ajedrez, la demostración de teoremas matemáticos, la escritura de poesía y el diagnóstico de enfermedades. La inteligencia artificial sintetiza y automatiza tareas que en principio son intelectuales y, por lo tanto, es potencialmente relevante para cualquier ámbito de actividades intelectuales humanas. En este sentido, es un campo genuinamente universal.[3]​\n\nLa arquitectura de las inteligencias artificiales y los procesos por los cuales aprenden, se mejoran y se implementan en algún área de interés varía según el enfoque de utilidad que se les quiera dar, pero de manera general, estos van desde la ejecución de sencillos algoritmos hasta la interconexión de complejas redes neuronales artificiales que intentan replicar los circuitos neuronales del cerebro humano y que aprenden mediante diferentes modelos de aprendizaje tales como el aprendizaje automático, el aprendizaje por refuerzo, el aprendizaje profundo y el aprendizaje supervisado.[4]​\n\nPor otro lado, el desarrollo y aplicación de la inteligencia artificial en muchos aspectos de la vida cotidiana también ha propiciado la creación de nuevos campos de estudio como la roboética y la ética de las máquinas que abordan aspectos relacionados con la ética en la inteligencia artificial y que se encargan de analizar cómo los avances en este tipo de tecnologías impactarían en diversos ámbitos de la vida, así como el manejo responsable y ético que se les debería dar a los mismos, además de establecer cuál debería ser la manera correcta de proceder de las máquinas y las reglas que deberían cumplir.[5]​\n\nEn cuanto a su clasificación, tradicionalmente se divide a la inteligencia artificial en inteligencia artificial débil, la cual es la única que existe en la actualidad y que se ocupa de realizar tareas específicas, e inteligencia artificial general, que sería una IA que excediese las capacidades humanas. Algunos expertos creen que si alguna vez se alcanza este nivel, se podría dar lugar a la aparición de una singularidad tecnológica, es decir, una entidad tecnológica superior que se mejoraría a sí misma constantemente, volviéndose incontrolable para los humanos, dando pie a teorías como el basilisco de Roko.[6]​\n\nAlgunas de las inteligencias artificiales más conocidas y utilizadas en la actualidad alrededor del mundo incluyen inteligencia artificial en el campo de la salud, asistentes virtuales como Alexa, el asistente de Google o Siri, traductores automáticos como el traductor de Google y DeepL, sistemas de recomendación como el de la plataforma digital de YouTube, motores de ajedrez y otros juegos como Stockfish y AlphaZero, chatbots como ChatGPT, creadores de arte de inteligencia artificial como Midjourney, Dall-e, Leonardo y Stable Diffusion, e incluso la conducción de vehículos autónomos como Tesla Autopilot.[7]​\n\nAsimismo la inteligencia artificial se está desarrollando en la plataforma digital cada vez más, evolucionando y creando nuevas herramientas, como la plataforma laboral que existe desde el año 2023 llamada SIVIUM, una herramienta por la cual una persona postula en forma automatizada a todas las ofertas laborales de todos los portales de trabajo, sin necesidad de estar revisando cada oferta laboral que se presente y enviar su CV uno por uno.\n\n", "sections": [{"name": "Denominación", "text": "", "subsections": []}, {"name": "Tipos", "text": "", "subsections": []}, {"name": "Escuelas de pensamiento", "text": "", "subsections": []}, {"name": "Historia", "text": "", "subsections": []}, {"name": "Implicaciones sociales, éticas y filosóficas", "text": "", "subsections": []}, {"name": "Regulación", "text": "", "subsections": []}, {"name": "Objetivos", "text": "", "subsections": []}, {"name": "Importancia de la inteligencia artificial", "text": "", "subsections": []}, {"name": "Controversias", "text": "", "subsections": []}, {"name": "Críticas", "text": "", "subsections": []}, {"name": "Normativa para su uso en el entorno educativo", "text": "", "subsections": []}, {"name": "Aprendizaje automatizado y aprendizaje profundo", "text": "", "subsections": []}, {"name": "Propiedad intelectual de la inteligencia artificial", "text": "", "subsections": []}, {"name": "En la cultura popular", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Bibliografía", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Intersecci%C3%B3n_de_conjuntos", "title": "Intersección de conjuntos", "summary": "A\nB\nA ∩ B\nEn teoría de conjuntos, la intersección de dos (o más) conjuntos es una operación que resulta en otro conjunto que contiene los elementos comunes a los conjuntos partida. Por ejemplo, dado el conjunto de los números pares P y el conjunto de los cuadrados C de números naturales, su intersección es el conjunto de los cuadrados pares.\n\n\n\n\n\nP\n=\n{\n2\n,\n4\n,\n6\n,\n8\n,\n10\n,\n…\n}\n\n\n{\\displaystyle P=\\{2,4,6,8,10,\\ldots \\}}\n\n\n\n\n\n\nC\n=\n{\n1\n,\n4\n,\n9\n,\n16\n,\n25\n,\n…\n}\n\n\n{\\displaystyle C=\\{1,4,9,16,25,\\ldots \\}}\n\n\n\n\n\n\nD\n=\n{\n4\n,\n16\n,\n36\n,\n64\n,\n…\n}\n\n\n{\\displaystyle D=\\{4,16,36,64,\\ldots \\}}\n\n\nEn otras palabras: Cómo, por ejemplo, si A = { a, b, c, d, e, f} y B = { a, e, i, o, u}, entonces la intersección de dichos conjuntos estará formada por todos los elementos que estén a la vez en los dos conjuntos, esto es: A∩B = { a, e} \n\nLa intersección de conjuntos se denota por el símbolo ∩ por lo que D = P ∩ C.\n\n", "sections": [{"name": "Definición", "text": "", "subsections": []}, {"name": "Propiedades", "text": "", "subsections": []}, {"name": "Teoría axiomática", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Literatura del tema", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/IronPython", "title": "IronPython", "summary": "\n\nIronPython es una implementación del intérprete Python (CPython) escrita totalmente en C#. El proyecto trata de seguir al pie de la letra el lenguaje Python, como implementación de Python que es. Esto hace que cualquier programa escrito en Python pueda ser interpretado con IronPython, con las ventajas añadidas de poder usar las bibliotecas de la plataforma .NET y poder compilar el código a bytecode\n\nExiste un lenguaje de programación muy similar a Python llamado Boo. Es un lenguaje claramente influenciado por Python dada la similitud de su sintaxis. Sin embargo, Boo no es realmente una implementación de Python, sino un nuevo lenguaje independiente con una sintaxis muy parecida a la de Python pero que hace uso de las API de .NET. Por tanto, los programas escritos en Python no se pueden ejecutar con el intérprete de Boo, mientras que IronPython está creado precisamente para ello.\n\n", "sections": [{"name": "Características de IronPython", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/JavaScript", "title": "JavaScript", "summary": "\nPor favor, edítalo y/o discute los problemas en la discusión para mejorarlo:\nNecesita referencias adicionales para su verificación.\nLas referencias no son claras o tienen un formato incorrecto.\n\n\n[\n]\nJavaScript (abreviado comúnmente JS) es un lenguaje de programación interpretado, dialecto del estándar ECMAScript. Se define como orientado a objetos,[2]​ basado en prototipos, imperativo, débilmente tipado y dinámico.\n\nSe utiliza principalmente del lado del cliente, implementado como parte de un navegador web permitiendo mejoras en la interfaz de usuario y páginas web dinámicas[3]​ y JavaScript del lado del servidor (Server-side JavaScript o SSJS). Su uso en aplicaciones externas a la web, por ejemplo en documentos PDF, aplicaciones de escritorio (mayoritariamente widgets) es también significativo.\n\nDesde 2012, todos los navegadores modernos soportan completamente ECMAScript 5.1, una versión de JavaScript. Los navegadores más antiguos soportan por lo menos ECMAScript 3. La sexta edición se liberó en julio de 2015.[4]​\n\nJavaScript se diseñó con una sintaxis similar a C++ y Java,[5]​[6]​ aunque adopta nombres y convenciones del lenguaje de programación Java. Sin embargo, Java y JavaScript tienen semánticas y propósitos diferentes. Su relación es puramente comercial, tras la compra del creador de Java (Sun Microsystems) de Netscape Navigator (creador de LiveScript) y el cambio de nombre del lenguaje de programación.\n\nTodos los navegadores modernos interpretan el código JavaScript integrado en las páginas web. Para interactuar con una página web se provee al lenguaje JavaScript de una implementación del Document Object Model (DOM). Javascript es el único lenguaje de programación que entienden de forma nativa los navegadores.\n\nTradicionalmente se venía utilizando en páginas web HTML para realizar operaciones y únicamente en el marco de la aplicación cliente, sin acceso a funciones del servidor. Actualmente es ampliamente utilizado para enviar y recibir información del servidor junto con ayuda de otras tecnologías como AJAX. JavaScript se interpreta en el agente de usuario al mismo tiempo que las sentencias van descargándose junto con el código HTML.\n\nDesde el lanzamiento en junio de 1997 del estándar ECMAScript 1, han existido las versiones 2, 3 y 5, que es la más usada actualmente (la 4 se abandonó[7]​). En junio de 2015 se cerró y publicó la versión ECMAScript 6.[8]​\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Características", "text": "", "subsections": []}, {"name": "Sintaxis y semántica", "text": "", "subsections": []}, {"name": "Uso en páginas web", "text": "", "subsections": []}, {"name": "Seguridad", "text": "", "subsections": []}, {"name": "Herramientas de desarrollo", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Java_(lenguaje_de_programaci%C3%B3n)", "title": "Java (lenguaje de programación)", "summary": "\nPor favor, edítalo y/o discute los problemas en la discusión para mejorarlo:\nNecesita referencias adicionales para su verificación.\nLas referencias no son claras o tienen un formato incorrecto.\nPodría ser difícil de entender para lectores interesados en el tema.\n\n\n[\n]\nJava es un lenguaje de programación y una plataforma informática que fue comercializada por primera vez en 1995 por Sun Microsystems.[2]​[3]​\n\nEl lenguaje de programación Java fue desarrollado originalmente por James Gosling, de Sun Microsystems (constituida en 1983 y posteriormente adquirida el 27 de enero de 2010 por la compañía Oracle),[4]​ y publicado en 1995 como un componente fundamental de la plataforma Java de Sun Microsystems. Su sintaxis deriva en gran medida de C y C++, pero tiene menos utilidades de bajo nivel que cualquiera de ellos. Las aplicaciones de Java son compiladas a bytecode (clase Java), que puede ejecutarse en cualquier máquina virtual Java (JVM) sin importar la arquitectura de la computadora subyacente.\n\nLa compañía Sun desarrolló la implementación de referencia original para los compiladores de Java, máquinas virtuales y librerías de clases en 1991, y las publicó por primera vez en 1995. A partir de mayo de 2007, en cumplimiento de las especificaciones del Proceso de la Comunidad Java, Sun volvió a licenciar la mayoría de sus tecnologías de Java bajo la Licencia Pública General de GNU. Otros han desarrollado también implementaciones alternas a estas tecnologías de Sun, tales como el Compilador de Java de GNU y el GNU Classpath.\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Filosofía", "text": "", "subsections": []}, {"name": "Sintaxis", "text": "", "subsections": []}, {"name": "Entornos de funcionamiento", "text": "", "subsections": []}, {"name": "Programación", "text": "", "subsections": []}, {"name": "Industria relacionada", "text": "", "subsections": []}, {"name": "Críticas", "text": "", "subsections": []}, {"name": "Recursos", "text": "", "subsections": []}, {"name": "Java en código abierto", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Bibliografía", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Jython", "title": "Jython", "summary": " Jython (Python en Java) es un lenguaje de programación de alto nivel, dinámico y orientado a objetos basado en Python e implementado íntegramente en Java. Es el sucesor de JPython. Jython al igual que Python es un proyecto de software libre. El lenguaje de programación Jython es prácticamente idéntico a la versión 2.5[1]​ de Python.\n\n", "sections": [{"name": "Ejecución", "text": "", "subsections": []}, {"name": "Lenguaje dinámico", "text": "", "subsections": []}, {"name": "Variables", "text": "", "subsections": []}, {"name": "Utilizando Java en Jython", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/LAMP", "title": "LAMP", "summary": "LAMP es el acrónimo usado para describir un sistema de infraestructura de internet que usa las siguientes herramientas:[1]​[2]​\n\nLinux, el sistema operativo; En algunos casos también se refiere a LDAP.\nApache, el servidor web;\nMySQL/MariaDB, el gestor de bases de datos;\nPHP, el lenguaje de programación.\nLa combinación de estas tecnologías es usada principalmente para definir la infraestructura de un servidor web, utilizando un paradigma de programación para el desarrollo del sistema .\n\nA pesar de que el origen de estos programas de código abierto no fue específicamente diseñado para trabajar entre sí, la combinación se popularizó debido a su bajo coste de adquisición y ubicuidad de sus componentes (ya que vienen pre-instalados en la mayoría de las distribuciones linux). Cuando son combinados, representan un conjunto de soluciones que proporcionan servidores de aplicaciones.\n\nEl término fue ampliamente promocionado por el editor de la editorial O'Reilly, Dale Dougherty, a sugerencia de David Axmark y Monty Widenius, desarrolladores de MySQL, debido a que fue la tecnología que se utilizó en Yahoo como propuesta de la Universidad Tecnológica de Nezahualcóyotl, México para ser utilizada en la Copa del Mundo de 1994 por el Profesor Luis Manuel Martínez Ramírez y que aun es la Base de las Tecnologías de las Actuales Redes Sociales más utilizadas en el Mundo; la influencia de dicha editorial en el mundo del software libre hizo que el acrónimo se popularizara rápidamente en todo el mundo.\n\n", "sections": [{"name": "Software", "text": "", "subsections": []}, {"name": "Variantes y alternativas", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Latino_(Lenguaje_de_Programaci%C3%B3n)", "title": "Latino (lenguaje de programación)", "summary": "\n[\n]\n\nLatino es un lenguaje de programación procedural con sintaxis en español de código abierto desarrollado en C, inspirado en Lua y Python.\n\nEste lenguaje fue creado por Primitivo Roman Montero en el 2015 con la versión v0.1-alpha hasta su versión v1.0 que fue lanzada en el 2017. En la actualidad, este lenguaje sigue su desarrollo bajo la dirección de Melvin Guerrero con las versiones v1.1.0 y v1.2.0 en adelante.\n\nHasta la fecha este lenguaje dispone de soporte para trabajar en sistemas operativos de 64 bits tales como MS-Windows, Mac OS, y Linux.\n\nDesarrollo web (server-side),\nConexiones de base de datos,\nCálculos matemáticas,\nSystem Scripting.\n", "sections": [{"name": "¿Y por qué un lenguaje de programación más?", "text": "", "subsections": []}, {"name": "Características del lenguaje", "text": "", "subsections": []}, {"name": "Ejemplos de código", "text": "", "subsections": []}, {"name": "Elementos del lenguaje", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Lenguaje_de_programaci%C3%B3n", "title": "Lenguaje de programación", "summary": "Un lenguaje de programación es un lenguaje formal (o artificial, es decir, un lenguaje con reglas gramaticales bien definidas) que proporciona a una persona, en este caso el programador, la capacidad y habilidad de escribir (o programar) una serie de instrucciones o secuencias de órdenes en forma de algoritmos con el fin de controlar el comportamiento físico o lógico de un sistema informático, para que de esa manera se puedan obtener diversas clases de datos o ejecutar determinadas tareas. A todo este conjunto de órdenes escritas mediante un lenguaje de programación se le denomina programa informático.[1]​[2]​[3]​[4]​\n\n", "sections": [{"name": "Características", "text": "", "subsections": []}, {"name": "Historia", "text": "", "subsections": []}, {"name": "Clasificación de los lenguajes de programación", "text": "", "subsections": []}, {"name": "Paradigma de programación", "text": "", "subsections": []}, {"name": "Clasificación por paradigmas", "text": "", "subsections": []}, {"name": "Elementos", "text": "", "subsections": []}, {"name": "Implementación", "text": "", "subsections": []}, {"name": "Dialectos", "text": "", "subsections": []}, {"name": "Técnica", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Lenguaje_de_programaci%C3%B3n_ABC", "title": "ABC (lenguaje de programación)", "summary": "ABC es un lenguaje de programación imperativo de propósito general y entorno de programación desarrollado en el Centrum Wiskunde & Informatica de Países Bajos por Leo Geurts, Lambert Meertens y Steven Pemberton. Es interactivo, estructurado, de alto nivel y está pensado para ser utilizado en lugar de BASIC, Pascal o AWK. No pretende ser un lenguaje de programación de sistemas, sino que está destinado a la enseñanza o la creación de prototipos.\n\nEl lenguaje tuvo una gran influencia en el diseño del lenguaje de programación Python; Guido van Rossum, quien desarrolló Python, trabajó anteriormente durante varios años en el sistema ABC a mediados de los años ochenta.[1]​[2]​\n\n", "sections": [{"name": "Características", "text": "", "subsections": []}, {"name": "Ejemplo", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Lenguaje_de_programaci%C3%B3n_C", "title": "C (lenguaje de programación)", "summary": "\n\nCódigo simple en C\nB (BCPL, CPL), ALGOL 68,[1]​: 201-208 \n\nC es un lenguaje de programación de propósito general[2]​: 1  originalmente desarrollado por Dennis Ritchie entre 1969 y 1972 en los Laboratorios Bell,[1]​ como evolución del anterior lenguaje B, a su vez basado en BCPL.[2]​: 1 [3]​[4]​\n\nAl igual que B, es un lenguaje orientado a la implementación de sistemas operativos; concretamente Unix. C es apreciado por la eficiencia del código que produce y es el lenguaje de programación más popular para crear softwares de sistemas y aplicaciones.\n\nSe trata de un lenguaje de tipos de datos estáticos, débilmente tipado, que dispone de las estructuras típicas de los lenguajes de alto nivel, pero, a su vez, dispone de construcciones del lenguaje que permiten un control a bajo nivel. Los compiladores suelen ofrecer extensiones al lenguaje que posibilitan mezclar código en ensamblador con código C o acceder directamente a memoria o dispositivos periféricos.\n\nLa primera estandarización del lenguaje C fue en ANSI, con el estándar X3.159-1989. El lenguaje que define este estándar fue conocido vulgarmente como ANSI C. Posteriormente, en 1990, fue ratificado como estándar ISO (ISO/IEC 9899:1990). La adopción de este estándar es muy amplia por lo que, si los programas creados lo siguen, el código es portable entre plataformas y/o arquitecturas.\n\n", "sections": [{"name": "Filosofía", "text": "", "subsections": []}, {"name": "Historia", "text": "", "subsections": []}, {"name": "Lenguajes derivados de C", "text": "", "subsections": []}, {"name": "Proceso de compilación", "text": "", "subsections": []}, {"name": "Herramientas de programación", "text": "", "subsections": []}, {"name": "Aplicabilidad", "text": "", "subsections": []}, {"name": "Bibliotecas C", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Lenguaje_de_programaci%C3%B3n_Java", "title": "Java (lenguaje de programación)", "summary": "\nPor favor, edítalo y/o discute los problemas en la discusión para mejorarlo:\nNecesita referencias adicionales para su verificación.\nLas referencias no son claras o tienen un formato incorrecto.\nPodría ser difícil de entender para lectores interesados en el tema.\n\n\n[\n]\nJava es un lenguaje de programación y una plataforma informática que fue comercializada por primera vez en 1995 por Sun Microsystems.[2]​[3]​\n\nEl lenguaje de programación Java fue desarrollado originalmente por James Gosling, de Sun Microsystems (constituida en 1983 y posteriormente adquirida el 27 de enero de 2010 por la compañía Oracle),[4]​ y publicado en 1995 como un componente fundamental de la plataforma Java de Sun Microsystems. Su sintaxis deriva en gran medida de C y C++, pero tiene menos utilidades de bajo nivel que cualquiera de ellos. Las aplicaciones de Java son compiladas a bytecode (clase Java), que puede ejecutarse en cualquier máquina virtual Java (JVM) sin importar la arquitectura de la computadora subyacente.\n\nLa compañía Sun desarrolló la implementación de referencia original para los compiladores de Java, máquinas virtuales y librerías de clases en 1991, y las publicó por primera vez en 1995. A partir de mayo de 2007, en cumplimiento de las especificaciones del Proceso de la Comunidad Java, Sun volvió a licenciar la mayoría de sus tecnologías de Java bajo la Licencia Pública General de GNU. Otros han desarrollado también implementaciones alternas a estas tecnologías de Sun, tales como el Compilador de Java de GNU y el GNU Classpath.\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Filosofía", "text": "", "subsections": []}, {"name": "Sintaxis", "text": "", "subsections": []}, {"name": "Entornos de funcionamiento", "text": "", "subsections": []}, {"name": "Programación", "text": "", "subsections": []}, {"name": "Industria relacionada", "text": "", "subsections": []}, {"name": "Críticas", "text": "", "subsections": []}, {"name": "Recursos", "text": "", "subsections": []}, {"name": "Java en código abierto", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Bibliografía", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Lenguaje_de_programaci%C3%B3n_interpretado", "title": "Intérprete (informática)", "summary": "En ciencias de la computación, intérprete o interpretador es un programa informático capaz de analizar y ejecutar otros programas. Los intérpretes se diferencian de los compiladores o de los ensambladores en que mientras estos traducen un programa desde su descripción en un lenguaje de programación al código de máquina del sistema, los intérpretes solo realizan la traducción a medida que sea necesaria, típicamente, instrucción por instrucción, y normalmente no guardan el resultado de dicha traducción.\n\nUsando un intérprete, un solo archivo fuente puede producir resultados iguales incluso en sistemas sumamente diferentes (ejemplo. una PC y una PlayStation 4). Usando un compilador, un solo archivo fuente puede producir resultados iguales solo si es compilado a distintos ejecutables específicos a cada sistema.\n\nLos programas interpretados suelen ser más lentos que los compilados debido a la necesidad de traducir el programa mientras se ejecuta, pero a cambio son más flexibles como entornos de programación y depuración (lo que se traduce, por ejemplo, en una mayor facilidad para reemplazar partes enteras del programa o añadir módulos completamente nuevos), y permiten ofrecer al programa interpretado un entorno no dependiente de la máquina donde se ejecuta el intérprete, sino del propio intérprete (lo que se conoce comúnmente como máquina virtual).\n\nPara mejorar el desempeño, algunas implementaciones de algunos lenguajes de programación pueden interpretar o compilar el código fuente original en una forma intermedia  más compacta, y después traducir eso al código de máquina (ej. Perl, Python, MATLAB, y Ruby). Algunos aceptan los archivos fuente guardados en esta representación intermedia (ej. Python, UCSD Pascal y Java).\n\nEn la actualidad, uno de los entornos más comunes de uso de los intérpretes es en los navegadores web, debido a la posibilidad que estos tienen de ejecutarse independientemente de la plataforma.\n\n", "sections": [{"name": "Intérpretes de bytecode", "text": "", "subsections": []}, {"name": "Eficiencia", "text": "", "subsections": []}, {"name": "Interpretadores de árbol de sintaxis abstracta", "text": "", "subsections": []}, {"name": "Compilación justo a tiempo", "text": "", "subsections": []}, {"name": "Ejemplos", "text": "", "subsections": []}, {"name": "Lenguaje interpretado", "text": "", "subsections": []}, {"name": "Notas y referencias", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Licencia_de_software", "title": "Licencia de software", "summary": "\n\nBusca fuentes: «Licencia de software» – noticias · libros · académico · imágenes\n[\n]\nUna licencia de software es un contrato entre el licenciante (autor/titular de los derechos de explotación/distribución) y el licenciatario[2]​ (usuario consumidor,  profesional o empresa) del programa informático, para utilizarlo cumpliendo una serie de términos y condiciones establecidas dentro de sus cláusulas,[3]​ es decir, es un conjunto de permisos que un desarrollador le puede otorgar a un usuario en los que tiene la posibilidad de distribuir, usar o modificar el producto bajo una licencia determinada. Además se suelen definir los plazos de duración, el territorio donde se aplica la licencia (ya que la licencia se soporta en las leyes particulares de cada país o región), entre otros.[4]​\n\nLas licencias de software pueden establecer entre otras cosas: la cesión de determinados derechos del propietario al usuario final sobre una o varias copias del programa informático, los límites en la responsabilidad por fallos, el plazo de cesión de los derechos, el ámbito geográfico de validez del contrato[5]​ e incluso pueden establecer determinados compromisos del usuario final hacia el propietario, tales como la no cesión del programa a terceros o la no reinstalación del programa en equipos distintos al que se instaló originalmente.\n\n", "sections": [{"name": "Partes de una licencia de software", "text": "", "subsections": []}, {"name": "Clasificación de las licencias de software en la actulidad", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Lisp", "title": "Lisp", "summary": "\n\nLisp (históricamente LISP) es una familia de lenguajes de programación de computadora de tipo multiparadigma con larga historia y una inconfundible y útil sintaxis homoicónica basada en la notación polaca.\n\nDesarrollado originalmente en 1959 por John McCarthy y sus colaboradores en el Instituto Tecnológico de Massachusetts, Lisp es el segundo lenguaje de programación de alto nivel de mayor antigüedad; apareció un año después de FORTRAN y uno antes que COBOL.\n\nAl igual que COBOL y FORTRAN, Lisp ha cambiado mucho desde sus comienzos, y han existido un gran número de dialectos en su historia. Hoy, los dialectos de Lisp más ampliamente usados son Scheme (1975), Common Lisp (1984), Emacs Lisp (1985) y Clojure (2007).\n\nLisp fue creado originalmente como una notación matemática práctica para los programas de computadora, basada en el cálculo lambda de Alonzo Church. Se convirtió rápidamente en el lenguaje de programación favorito en la investigación de la inteligencia artificial (AI). Como lenguajes de programación precursor, Lisp fue pionero en muchas ideas en ciencias de la computación, incluyendo las estructuras de datos de árbol, el manejo de almacenamiento automático, tipos dinámicos, y el compilador auto contenido.\n\nEl acrónimo LISP significa \"LISt Processor\" ('Procesamiento de listas'). Las listas encadenadas son una de las estructuras de datos importantes de Lisp, y el código fuente de Lisp en sí mismo está compuesto de listas. Como resultado, los programas de Lisp pueden manipular código fuente de Lisp como si fueran simples datos, dando lugar a sistemas de macros que permiten a los programadores crear lenguajes de dominio específico embebidos en Lisp.\n\nLa intercambiabilidad del código y los datos también da a Lisp su instantáneamente reconocible sintaxis. Todo el código del programa es escrito como expresiones S, o listas entre paréntesis. Una llamada de función o una forma sintáctica es escrita como una lista, con la función o el nombre del operador en primer lugar, y los argumentos a continuación; por ejemplo, una función f que toma tres argumentos puede ser llamada usando (f x y z).\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Dialectos importantes", "text": "", "subsections": []}, {"name": "Innovaciones del lenguaje", "text": "", "subsections": []}, {"name": "Listas", "text": "", "subsections": []}, {"name": "Orígenes de \"car\" y \"cdr\"", "text": "", "subsections": []}, {"name": "Ejemplos", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Log4j", "title": "Log4j", "summary": "\nLog4j es una biblioteca de código abierto desarrollada en Java por la Apache Software Foundation que permite a los desarrolladores de software escribir mensajes de registro, cuyo propósito es dejar constancia de una determinada transacción en tiempo de ejecución. Log4j permite filtrar los mensajes en función de su importancia. La configuración de salida y granularidad de los mensajes es realizada en tiempo de ejecución mediante el uso de archivos de configuración externos. Log4J ha sido implementado en otros lenguajes como C, C++, C#, Perl, Python, Ruby y Eiffel.\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Conceptos", "text": "", "subsections": []}, {"name": "Configuración", "text": "", "subsections": []}, {"name": "Uso", "text": "", "subsections": []}, {"name": "Vulnerabilidad «Log4Shell»", "text": "", "subsections": []}, {"name": "Proyectos similares", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/M%C3%B3dulo_(inform%C3%A1tica)", "title": "Módulo (informática)", "summary": "En programación, un módulo es una porción de un programa de ordenador. De las varias tareas que debe realizar un programa para cumplir con su función u objetivos, un módulo realizará, comúnmente, una de dichas tareas (o varias, en algún caso).\n\nEn general (no necesariamente relacionado con la programación), un módulo recibe como entrada la salida que haya proporcionado otro módulo o los datos de entrada al sistema (programa) si se trata del módulo principal de este; y proporcionará una salida que, a su vez, podrá ser utilizada como entrada de otro módulo o bien contribuirá directamente a la salida final del sistema (programa), si se retorna al módulo principal.\n\nParticularmente, en el caso de la programación, los módulos suelen estar (no necesariamente) organizados jerárquicamente en niveles, de forma que hay un módulo principal que realiza las llamadas oportunas a los módulos de nivel inferior. \n\nCuando un módulo es convocado, recibe como entrada los datos proporcionados por otro del mismo o superior nivel, el que ha hecho la llamada; luego realiza su tarea. A su vez este módulo convocado puede llamar a otro u otros módulos de nivel inferior si fuera necesario; cuando ellos finalizan sus tareas, devuelven la salida pertinente al módulo inmediato llamador, en secuencia inversa. Finalmente se continúa con la ejecución del módulo principal.\n\n", "sections": [{"name": "Características de un módulo", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Machine_learning", "title": "Aprendizaje automático", "summary": "El aprendizaje automático (AA); también llamado automatizado, computacional o de máquinas (del inglés machine learning, ML), es el subcampo de las ciencias de la computación y una rama de  la inteligencia artificial, cuyo objetivo es desarrollar técnicas que permitan que las computadoras aprendan. Se dice que un agente aprende cuando su desempeño mejora con la experiencia y mediante el uso de datos; es decir, cuando la habilidad no estaba presente en su genotipo o rasgos de nacimiento.[1]​ \"En el aprendizaje de máquinas un computador observa datos, construye un modelo basado en esos datos y utiliza ese modelo a la vez como una hipótesis acerca del mundo y una pieza de software que puede resolver problemas\".[2]​\n\nEn muchas ocasiones el campo de actuación del aprendizaje automático se solapa con el de la estadística inferencial, ya que las dos disciplinas se basan en el análisis de datos. Sin embargo, el aprendizaje automático incorpora las preocupaciones de la complejidad computacional de los problemas. Muchos problemas son de clase NP-hard, por lo que gran parte de la investigación realizada en aprendizaje automático está enfocada al diseño de soluciones factibles a esos problemas. El aprendizaje automático también está estrechamente relacionado con el reconocimiento de patrones. El aprendizaje automático puede ser visto como un intento de automatizar algunas partes del método científico mediante métodos matemáticos. Por lo tanto es un proceso de inducción del conocimiento.\n\nEl aprendizaje automático tiene una amplia gama de aplicaciones, incluyendo motores de búsqueda, diagnósticos médicos, detección de fraude en el uso de tarjetas de crédito, análisis de mercado para los diferentes sectores de actividad, clasificación de secuencias de ADN, reconocimiento del habla y del lenguaje escrito, juegos y robótica.\n\n", "sections": [{"name": "Resumen", "text": "", "subsections": []}, {"name": "Tipos de algoritmos", "text": "", "subsections": []}, {"name": "Técnicas de clasificación", "text": "", "subsections": []}, {"name": "Conocimiento", "text": "", "subsections": []}, {"name": "Distinción entre aprendizaje supervisado y no supervisado", "text": "", "subsections": []}, {"name": "Aplicaciones", "text": "", "subsections": []}, {"name": "Temas del aprendizaje automático", "text": "", "subsections": []}, {"name": "Historia y relación con otros temas", "text": "", "subsections": []}, {"name": "Software", "text": "", "subsections": []}, {"name": "Sesgos", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Bibliografía", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Manejo_de_excepciones", "title": "Manejo de excepciones", "summary": "\n\n\nBusca fuentes: «Manejo de excepciones» – noticias · libros · académico · imágenes\nEl manejo de excepciones es una técnica de programación que permite al programador controlar los errores ocasionados durante la ejecución de un programa informático. Cuando ocurre cierto tipo de error, el sistema reacciona ejecutando un fragmento de código que resuelve la situación, por ejemplo retornando un mensaje de error o devolviendo un valor por defecto.\n\n", "sections": [{"name": "Introducción", "text": "", "subsections": []}, {"name": "Ejemplos de código", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Metaclase", "title": "Metaclase", "summary": "En programación orientada a objetos, una metaclase es una clase cuyas instancias son clases. En otras palabras, como los objetos son instancias de una clase, las clases son instancias de una metaclase.\n\nNo todos los lenguajes orientados a objetos soportan metaclases. Además, los lenguajes que lo soportan tienen sus propias reglas que definen como los objetos, clases y metaclases interactúan.\n\n", "sections": [{"name": "Véase también", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Monty_Python", "title": "Monty Python", "summary": "\nGraham Chapman (†)John CleeseTerry GilliamEric IdleTerry Jones (†)Michael Palin\nMonty Python's Flying Circus (1969-1974)Se armó la gorda (1971)Los caballeros de la mesa cuadrada (1975)La vida de Brian (1979)Monty Python Live at the Hollywood Bowl (1982)El sentido de la vida (1983)Monty Python Live (Mostly) (2014)\nMonty Python (a veces conocidos como Los Pythons)[1]​[2]​ fue un grupo británico de seis humoristas que sintetizó en clave de humor la idiosincrasia británica de los años 1960 y 1970, compuesto por Graham Chapman, John Cleese, Terry Gilliam, Eric Idle, Terry Jones y Michael Palin. Del grupo únicamente Terry Gilliam no era británico sino estadounidense.\n\nLograron la fama gracias a su programa de televisión Monty Python's Flying Circus (El Circo Ambulante de Monty Python), estrenado el 5 de octubre de 1969 en la BBC y formada por 45 episodios repartidos en cuatro temporadas. El fenómeno Python se desarrolló más allá del programa de televisión adquiriendo un gran impacto: obras de teatros, películas, discos, libros, un musical e incluso lenguajes de programación.[3]​ La influencia del grupo en la comedia se ha comparado con la de los Beatles en la música.[4]​[5]​\n\nEmitido en la BBC entre 1969 y 1974, Flying Circus fue creado, escrito e interpretado por los seis miembros del grupo. Estaba estructurado como un programa de sketches, pero con una técnica narrativa innovadora (ayudada por las animaciones de Gilliam) que iba más allá de lo aceptable en estilo y contenido.[6]​[7]​ Al ser los responsables tanto de los guiones y la interpretación, los Python tenían un control creativo que les permitía experimentar formas y contenidos, deshaciéndose de las reglas de la comedia televisiva. La influencia del grupo en la comedia británica ha sido notoria durante años, y en Norteamérica ha influido desde los intérpretes de las primeras ediciones de Saturday Night Live hasta las más recientes tendencias de humor absurdo en la comedia televisiva. La palabra \"Pythonesque\" ha entrado en el léxico inglés como sinónimo de \"absurdo\" o \"surrealista\".\n\nEn una encuesta realizada en 2005 en el Reino Unido para encontrar al Cómico de cómicos, tres de los seis miembros de Monty Python fueron votados por otros cómicos y aficionados como tres de los 50 mayores cómicos de la historia: Cleese en el puesto 2, Idle en el 21, y Palin en el 30.[8]​\n\nEn 2009 el grupo recibió el premio BAFTA honorífico por su contribución al mundo de la comedia. El premio se lo entregaron en el preestreno del documental dedicado al fallecido Graham Chapman, Monty Python: casi la verdad.[9]​\n\n", "sections": [{"name": "Los orígenes", "text": "", "subsections": []}, {"name": "Monty Python's Flying Circus", "text": "", "subsections": []}, {"name": "Largometrajes", "text": "", "subsections": []}, {"name": "Teatro", "text": "", "subsections": []}, {"name": "Documentales", "text": "", "subsections": []}, {"name": "Integrantes", "text": "", "subsections": []}, {"name": "Influencia", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Multiplataforma", "title": "Multiplataforma", "summary": "\nPor favor, edítalo y/o discute el problema en la discusión para mejorarlo:\nCarece de fuentes o referencias que aparezcan en una fuente acreditada.\nEn informática, se denomina multiplataforma a un atributo conferido a programas informáticos o métodos y conceptos de cómputacion que son implementados, y operan internamente en múltiples plataformas informáticas. El software multiplataforma puede dividirse en dos grandes tipos o clases: uno requiere una compilación individual para cada plataforma que le da soporte, y el otro se puede ejecutar directamente en cualquier plataforma, sin preparación especial, por ejemplo, el software escrito en un lenguaje interpretado o bytecode precompilado portable, para los cuales los intérpretes o paquetes en tiempo de ejecución son componentes comunes o estándar de todas las plataformas.\n\nPor ejemplo, una aplicación multiplataforma puede ejecutarse sin problema alguno, tanto en Microsoft Windows en la arquitectura x86, como en Linux en la arquitectura x86 y Mac OS X, ya sea en el PowerPC o sistemas Apple Macintosh basados en x86. En general, una aplicación multiplataforma se puede ejecutar tanto en todas las plataformas existentes o como mínimo dos plataformas.[1]​\n\n", "sections": [{"name": "Plataformas", "text": "", "subsections": []}, {"name": "Multiplataforma en los videojuegos", "text": "", "subsections": []}, {"name": "Estrategias de diseño", "text": "", "subsections": []}, {"name": "Estrategias de prueba", "text": "", "subsections": []}, {"name": "Aplicaciones tradicionales", "text": "", "subsections": []}, {"name": "Software binario", "text": "", "subsections": []}, {"name": "Scripts y lenguajes interpretados", "text": "", "subsections": []}, {"name": "Videojuegos", "text": "", "subsections": []}, {"name": "Software plataforma-independiente", "text": "", "subsections": []}, {"name": "Programación multiplataforma", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/NumPy", "title": "NumPy", "summary": "\n\n[\n]\nPythonCFortran\nNumPy (pronunciado  /ˈnʌmpaɪ/ (numpai) o, a veces  /ˈnʌmpi/[3]​[4]​ (numpi)) es una biblioteca para el lenguaje de programación Python que da soporte para crear vectores y matrices grandes multidimensionales, junto con una gran colección de funciones matemáticas de alto nivel para operar con ellas. El precursor de NumPy, Numeric, fue creado originalmente por Jim Hugunin con contribuciones de varios otros desarrolladores. En 2005, Travis Oliphant creó NumPy incorporando características de la competencia Numarray en Numeric, con amplias modificaciones. NumPy es un software de código abierto y cuenta con muchos colaboradores. \n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Características", "text": "", "subsections": []}, {"name": "Ejemplos", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Otras lecturas", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Objeto_(programaci%C3%B3n)", "title": "Objeto (programación)", "summary": "\n\nBusca fuentes: «Objeto (programación)» – noticias · libros · académico · imágenes\nEn el paradigma de programación orientada a objetos (POO, o bien OOP en inglés), un objeto es un ente orientado a objetos (programa de computadoras) que consta de un estado y de un comportamiento, que a su vez constan respectivamente de datos almacenados y de tareas realizables durante el tiempo de ejecución. Un objeto puede ser creado instanciando una clase, como ocurre en la programación orientada a objetos, o mediante escritura directa de código y la replicación de otros objetos, como ocurre en la programación basada en prototipos.\n\nEstos objetos interactúan unos con otros, en contraposición a la visión tradicional en la cual un programa es una colección de subrutinas (funciones o procedimientos), o simplemente una lista de instrucciones para el computador. Cada objeto es capaz de recibir mensajes, procesar datos y enviar mensajes a otros objetos de manera similar a un servicio.\n\nEn el mundo de la programación orientada a objetos (POO), un objeto es el resultado de la instanciación de una clase.[1]​ Una clase es el anteproyecto que ofrece la funcionalidad en ella definida, pero ésta queda implementada solo al crear una instancia de la clase, en la forma de un objeto. Por ejemplo: dado un plano para construir sillas (una clase de nombre clase_silla), entonces una silla concreta, en la que podemos sentarnos, construida a partir de este plano, sería un objeto de clase_silla. Es posible crear (construir) múltiples objetos (sillas) utilizando la definición de la clase (plano) anterior. Los conceptos de clase y objetos son análogos a los de tipo de datos y variable; es decir, definida una clase podemos crear objetos de esa clase, igual que disponiendo de un determinado tipo de dato (por ejemplo el tipo entero), podemos definir variables de dicho tipo:\n\n( 'int' es un tipo de dato y 'a' y 'b' son variables de tipo entero con las que podemos operar)\n\nPara utilizar la funcionalidad definida en una clase en particular (salvo en las clases abstractas), primeramente es necesario crear un objeto de esa clase. De la misma manera, para una persona que desea sentarse, las especificaciones para construir una silla serán de poca utilidad; lo que se necesita es una silla real construida a partir de esas especificaciones. Siguiendo con la analogía anterior, también se puede decir que para hacer operaciones aritméticas, de nada sirve por sí solo el tipo entero (int); para ello necesitamos variables (o constantes) con las que operar.\n\n", "sections": [{"name": "Definición de objeto", "text": "", "subsections": []}, {"name": "Representación en las computadoras", "text": "", "subsections": []}, {"name": "Objetos en la programación orientada a objetos", "text": "", "subsections": []}, {"name": "Relaciones entre objetos", "text": "", "subsections": []}, {"name": "Objetos especializados", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Pa%C3%ADses_Bajos", "title": "Países Bajos", "summary": "\n\nNederland\nReino de los Países Bajos\n\n\n\n\n    \n    \n    \n52°19′00″N 5°33′00″E﻿ / ﻿52.316666666667, 5.55\n\n[\n]\n52°23′00″N 4°54′00″E﻿ / ﻿52.38333, 4.90000\n\n0,946\nMuy Alto\n↑ La Haya es la sede del Gobierno.\n↑ El frisón es una lengua regional hablada por más de &&&&&&&&&0450000.&&&&&0450 000 personas en la provincia de Frisia, donde es cooficial con el neerlandés.\n↑ Antes de 2002, el florín neerlandés (ƒ, NLG).\nPaíses Bajos[6]​ (PP. BB.; en neerlandés: Nederlandⓘ) es una de las cuatro naciones constituyentes que forman el Reino de los Países Bajos. Es uno de los veintisiete Estados soberanos que integran la Unión Europea. Su capital es Ámsterdam;[7]​ sin embargo, la organización y la administración del Reino radican en La Haya, sede oficial de la monarquía, así como de sus autoridades ejecutivas, legislativas y judiciales. Aruba, Curazao y San Martín son territorios de ultramar que no forman parte de la Unión Europea.\n\nLas provincias que conforman los Países Bajos están situadas en el noroeste de Europa y limitan al norte y oeste con el mar del Norte, al sur con Bélgica y al este con Alemania. Completan el territorio neerlandés las municipalidades especiales de Bonaire, San Eustaquio y Saba, situadas en el Caribe. El país constituye una de las zonas más densamente pobladas del mundo.\n\nComo su nombre indica, el territorio del país está formado por tierras (land) bajas (neder) de las que, aproximadamente, una cuarta parte están situadas al nivel del mar o por debajo de este.[8]​\n\nEl país está clasificado como «de ingresos altos» según el Banco Mundial[9]​ y es uno de los estados más desarrollados: en 2018 está situado en el décimo lugar en cuanto a desarrollo humano según el Índice de Desarrollo Humano publicado por Naciones Unidas.[10]​ Es además uno de los países con uno de los niveles más bajos de percepción de corrupción,[11]​ y es una de las democracias más consolidadas del mundo.[12]​\n\n", "sections": [{"name": "Terminología", "text": "", "subsections": []}, {"name": "Historia", "text": "", "subsections": []}, {"name": "Gobierno y política", "text": "", "subsections": []}, {"name": "Organización político-administrativa", "text": "", "subsections": []}, {"name": "Relaciones exteriores", "text": "", "subsections": []}, {"name": "Geografía", "text": "", "subsections": []}, {"name": "Economía", "text": "", "subsections": []}, {"name": "Demografía", "text": "", "subsections": []}, {"name": "Cultura", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Notas", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Bibliografía", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Palabra_reservada", "title": "Palabra reservada", "summary": "En los lenguajes informáticos, una palabra reservada es una palabra que tiene un significado gramatical especial para ese lenguaje y no puede ser utilizada como un identificador de objetos en códigos del mismo, como pueden ser las variables.\n\nPor ejemplo, en SQL, un usuario no puede ser llamado \"group\", porque la palabra group es usada para indicar que un identificador se refiere a un grupo, no a un usuario. Al tratarse de una palabra clave su uso queda restringido.\n\nOcasionalmente la especificación de un lenguaje de programación puede tener palabras reservadas que están previstas para un posible uso en futuras versiones. En Java const y goto son palabras reservadas — no tienen significado en Java, pero tampoco pueden ser usadas como identificadores. Al reservar los términos pueden ser implementados en futuras versiones de Java, si se desea, sin que el código fuente más antiguo escrito en Java deje de funcionar.\n\n", "sections": [{"name": "Palabras reservadas e independencia del lenguaje", "text": "", "subsections": []}, {"name": "Palabras reservadas en SQL", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Pandas_(software)", "title": "Pandas (software)", "summary": "\n\nPandas es una librería de Python especializada en la manipulación y el análisis de datos. Ofrece estructuras de datos y operaciones para manipular tablas numéricas y series temporales, es como el Excel de Python. Es un software libre  distribuido bajo la licencia BSD.[1]​ El nombre deriva del término \"datos de panel\", término de econometría que designa datos que combinan una dimensión temporal con otra dimensión transversal.[2]​\n\n", "sections": [{"name": "Características de la biblioteca", "text": "", "subsections": []}, {"name": "Historia", "text": "", "subsections": []}, {"name": "Ejemplos", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Paradigma_de_programaci%C3%B3n", "title": "Paradigma de programación", "summary": "Se denominan paradigmas de programación a las formas de clasificar los lenguajes de programación en función de sus características. Los idiomas se pueden clasificar en múltiples paradigmas.\n\nAlgunos paradigmas se ocupan principalmente de las implicancias para el modelo de ejecución del lenguaje, como permitir efectos secundarios o si la secuencia de operaciones está definida por el modelo de ejecución. Otros paradigmas se refieren principalmente a la forma en que se organiza el código, como agrupar un código en unidades junto con el estado que modifica el código. Sin embargo, otros se preocupan principalmente por el estilo de la sintaxis y la gramática.\n\nLos paradigmas de programación comunes incluyen:[1]​[2]​[3]​\n\nimperativo en el que el programador instruye a la máquina cómo cambiar su estado,\nprocedimental que agrupa las instrucciones en procedimientos,\norientado a objetos que agrupa las instrucciones con la parte del estado en el que operan,\ndeclarativo en el que el programador simplemente declara las propiedades del resultado deseado, pero no cómo calcularlo\nfuncional en el que el resultado deseado se declara como el valor de una serie de aplicaciones de función,\nlógico en la que el resultado deseado se declara como la respuesta a una pregunta sobre un sistema de hechos y reglas,\nmatemático en el que el resultado deseado se declara como la solución de un problema de optimización\nreactivo en el que se declara el resultado deseado con flujos de datos y la propagación del cambio\nLas técnicas simbólicas como la reflexión, que permiten que el programa se refiera a sí mismo, también pueden ser consideradas como un paradigma de programación. Sin embargo, esto es compatible con los principales paradigmas y, por lo tanto, no es un paradigma real por derecho propio.\n\nPor ejemplo, los lenguajes que caen en el paradigma imperativo tienen dos características principales: establecen el orden en el que ocurren las operaciones, con construcciones que controlan explícitamente ese orden, y permiten efectos secundarios, en los que el estado puede modificarse en un momento determinado, dentro de una unidad de código, y luego leer en un momento diferente dentro de una unidad de código diferente. La comunicación entre las unidades de código no es explícita. Mientras tanto, en la programación orientada a objetos, el código se organiza en objetos que contienen un estado que solo es modificado por el código que forma parte del objeto. La mayoría de los lenguajes orientados a objetos también son lenguajes imperativos. Por el contrario, los lenguajes que se ajustan al paradigma declarativo no indican el orden en el que ejecutar las operaciones. En su lugar, proporcionan una serie de operaciones disponibles en el sistema, junto con las condiciones en las que se permite que se ejecute cada una. La implementación del modelo de ejecución del lenguaje rastrea qué operaciones son libres de ejecutar y elige el orden en forma independiente. Más en Comparación de lenguajes de programación de múltiples paradigmas.\n\n--Lenguajes de programación procedurales--\nEl desarrollo de lenguajes procedurales dio lugar a lenguajes sirven de vocabulario relacionado con el problema a resolver. Ejemplos de estos lenguajes son:\n\nCOBOL (COmmon Business-Oriented Language) - hace servir términos como archivo, mover y copiar.\nFORTRAN (FORmula TRANslation) - hace servir terminología del lenguaje matemático.\nALGOL (ALGOritmic Language) - enfocado a ser un lenguaje apropiado para definir algoritmos, también puede servir de lenguaje matemático.\nPL/I (Programing Language One) - un híbrido comercial/científico de propósito general con soporte para usuarios.\nBASIC (Begginers All purpose Symbolic Instruction Code) - se desarrolló para permitir escribir programas a más personas.\nC - un lenguaje de propósito general.\nTodos estos lenguajes siguen un paradigma procedural. Describen, paso a paso, exactamente el proceso que debe seguirse para resolver un problema específico. La eficacia y eficiencia de cada solución dependen de la experiencia, la inventiva y la habilidad del programador.\n\n", "sections": [{"name": "Crítica", "text": "", "subsections": []}, {"name": "Historia", "text": "", "subsections": []}, {"name": "Soporte para múltiples paradigmas", "text": "", "subsections": []}, {"name": "Resumen", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Perif%C3%A9rico_de_entrada/salida", "title": "Periférico de entrada/salida", "summary": "\n\nBusca fuentes: «Periférico de entrada/salida» – noticias · libros · académico · imágenes\nEn informática, un periférico de entrada/salida o E/S (en inglés: input/output o I/O) es aquel tipo de dispositivo periférico de un computador capaz de interactuar con los elementos externos a ese sistema de forma bidireccional, es decir, que permite tanto que sea ingresada información desde un sistema externo, como emitir información a partir de ese sistema.\n\n", "sections": [{"name": "Funciones", "text": "", "subsections": []}, {"name": "Tipos", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Perl", "title": "Perl", "summary": "\n\n5.38.2[1]​ / 29 de noviembre de 2023 (5 meses y 16 días)\n\nPerl es un lenguaje de programación diseñado por Larry Wall en 1987. Perl toma características del lenguaje C, del lenguaje interpretado bourne shell (sh), AWK, sed, Lisp y, en un grado inferior, de muchos otros lenguajes de programación.\n\nEstructuralmente, Perl está basado en un estilo de bloques como los del C o AWK, y fue ampliamente adoptado por su destreza en el procesado de texto y no tener ninguna de las limitaciones de los otros lenguajes de script.\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Descripción", "text": "", "subsections": []}, {"name": "Estructura del lenguaje", "text": "", "subsections": []}, {"name": "Comparativa de funcionamiento", "text": "", "subsections": []}, {"name": "Futuro", "text": "", "subsections": []}, {"name": "Diversión con Perl", "text": "", "subsections": []}, {"name": "Comunidad Perl", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Pip_(administrador_de_paquetes)", "title": "Pip (administrador de paquetes)", "summary": "\npip es un sistema de gestión de paquetes utilizado para instalar y administrar paquetes de software escritos en Python. Muchos paquetes pueden ser encontrados en el Python Package Index (PyPI). Python 2.7.9 y posteriores (en la serie Python2), Python 3.4 y posteriores incluyen pip (pip3 para Python3) por defecto.\n\npip es un acrónimo recursivo que se puede interpretar como Pip Instalador de Paquetes o Pip Instalador de Python.[1]​\n\n", "sections": [{"name": "Interfaz línea de comando", "text": "", "subsections": []}, {"name": "Uso de servicio del alojamiento web", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Pit%C3%B3n", "title": "Pitón", "summary": "\nPitón puede referirse a:\n\nPythonidae, familia de serpientes constrictoras.\nPython, género de pitones.\nPitón reticulada, serpiente más larga del mundo.\nPitón, gran serpiente de la mitología griega.\nPitón, ciudad del Antiguo Egipto mencionada en el libro de la Biblia del Éxodo.\nPitón volcánico, resto de un volcán erosionado.\nPitón, alfarero griego del siglo V a. C.\nPitón, pintor griego del siglo IV a. C.\nPitón, sátrapa de Media, del siglo IV a. C.\nPitón, sátrapa de la India, del siglo IV a. C.\nPitón, cuerno de algunos animales.\nPitón, pito o pitorro (en vasijas, regaderas, porrones, etc.)\nPython, lenguaje de programación.\nPython, misil fabricado por Israel.\nEl nombre común de la planta Agave americana.\nEl nombre común de la planta Taraxacum officinale.\nPithon, población y comuna francesa.\n", "sections": [{"name": "Véase también", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Plone", "title": "Plone", "summary": "\n\n[\n]\nPlone es un sistema de gestión de contenidos que puede utilizarse para construir cualquier tipo de sitio web como portales, sitios webs corporativos, sitios web externos o internos, sitios de publicación de noticias, incluyendo blogs, tiendas en línea (E-commerce), como repositorio de documentos y herramienta colaborativa.[2]​\n\nPlone es un desarrollo basado en código abierto publicado bajo la GNU General Public License (GPL), basado en Zope y programado en Python. Los principales desarrollos son conducidos periódicamente durante reuniones especiales llamadas Plone Sprints. Adicionalmente está diseñado para extender sus funcionalidades por defecto por medio de módulos adicionales llamados Products. Plone también tiene respaldo legal del Consejo de la Software Freedom Law Center. Los puntos fuertes de Plone son sus flujo de trabajo flexibles y adaptables, seguridad, extensibilidad, facilidad de uso y flexibilidad.[3]​\n\nSegún estudio efectuado por Real Story Group llamado 2012 Content Technology Vendor Map[4]​  clasifican a Plone como un Document & Records Management, Sistema de gestión de contenidos y Gestión del conocimiento (Web Content & Experience Management), Software colaborativo y Software social (Collaboration & Social Software). Aparte de este estudio, existen publicaciones donde se ha analizado sus capacidades como Sistema de Gestión de Conocimiento.[5]​\n\nDebido a la su capacidad de extender su funcionalidad por defecto basado en Productos, existe experiencias realizadas por proveedores de servicios de Plone donde frecuentemente han utilizado a Plone como CRM,[6]​ como un software GIS para  cartografía en entornos web,[7]​[8]​ entre otros usos, aun cuando Plone no fue diseñado como tal para estas funcionalidades.\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Fundación Plone", "text": "", "subsections": []}, {"name": "Características", "text": "", "subsections": []}, {"name": "Comunidad", "text": "", "subsections": []}, {"name": "Distribuciones basadas en Plone", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Polimorfismo_(inform%C3%A1tica)", "title": "Polimorfismo (informática)", "summary": "En programación orientada a objetos, el polimorfismo se refiere a la propiedad por la que es posible enviar mensajes sintácticamente iguales a objetos de tipos distintos. Aunque el mensaje sea el mismo, diferentes objetos pueden responder a él de manera única y específica. Esta característica permite que, sin alterar ni tocar el código existente, se puedan incorporar nuevos comportamientos y funciones (es decir la interfaz sintáctica se mantiene inalterada pero cambia el comportamiento en función de qué objeto estamos usando en cada momento). El único requisito es que los objetos deben ser capaces de responder al mensaje que se les envía, garantizando así una flexibilidad y extensibilidad en el diseño del software.\n\n", "sections": [{"name": "Descripción", "text": "", "subsections": []}, {"name": "Clasificación", "text": "", "subsections": []}, {"name": "Ejemplo de polimorfismo", "text": "", "subsections": []}, {"name": "Polimorfismo desde una interfaz", "text": "", "subsections": []}, {"name": "Diferencias entre polimorfismo y sobrecarga", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Programaci%C3%B3n_funcional", "title": "Programación funcional", "summary": "\n\nBusca fuentes: «Programación funcional» – noticias · libros · académico · imágenes\nEn informática, la programación funcional es un paradigma de programación declarativa basado en el uso de verdaderas funciones matemáticas. En este estilo de programación las funciones son ciudadanas de primera clase, porque sus expresiones pueden ser asignadas a variables como se haría con cualquier otro valor; además de que pueden crearse funciones de orden superior.[1]​ \n\nLa programación funcional tiene sus raíces en el cálculo lambda, un sistema formal desarrollado en los años 1930 para investigar la naturaleza de las funciones, la naturaleza de la computabilidad y su relación con la recursión. Los lenguajes funcionales priorizan el uso de recursividad y aplicación de funciones de orden superior para resolver problemas que en otros lenguajes se resolverían mediante estructuras de control (por ejemplo, ciclos). Algunos lenguajes funcionales también buscan eliminar la mutabilidad o efectos secundarios; en contraste con la programación imperativa, que se basa en los cambios de estado mediante la mutación de variables. Esto significa que, en programación funcional pura, dos o más expresiones sintácticas idénticas (por ejemplo, dos llamadas a rutinas o dos evaluaciones) siempre devolverán el mismo resultado. Es decir, se tiene transparencia referencial. Lo anterior también puede ser aprovechado para diseñar estrategias de evaluación que eviten repetir el cómputo de expresiones antes vistas, o para evaluar distintas ramas de un programa en paralelo sin mayor preocupación.\n\nLos lenguajes de programación funcional, especialmente los puramente funcionales, han sido enfatizados en el ambiente académico y no tanto en el desarrollo comercial o industrial. Sin embargo, lenguajes de programación funcional como Lisp (Scheme, Common Lisp, etc.), Erlang, Rust, Objective Caml, Scala, F#, Clojure, Racket, Wolfram Language[2]​ y Haskell, también han sido utilizados en aplicaciones comerciales e industriales. También es utilizada en la industria a través de lenguajes de dominio específico como R (estadística), Mathematica (cómputo simbólico), J y K (análisis financiero). Los lenguajes de uso específico usados comúnmente como SQL y Lex/Yacc, utilizan algunos elementos de programación funcional, especialmente al procesar valores mutables. Las hojas de cálculo también pueden ser consideradas lenguajes de programación funcional.\n\nOtros lenguajes de programación no están diseñados específicamente para seguir un estilo funcional, sin embargo lo ofrecen como alternativa. Por ejemplo, Perl, JavaScript y Python fueron diseñados con capacidades de programación funcional, además de incorporar otros paradigmas. Versiones recientes de lenguajes originalmente sin capacidades funcionales, como C++ y Java, han ido incorporando algunos conceptos de la programación funcional.\n\n", "sections": [{"name": "Utilidad", "text": "", "subsections": []}, {"name": "Características", "text": "", "subsections": []}, {"name": "Ventajas de usar un paradigma funcional", "text": "", "subsections": []}, {"name": "Lenguajes funcionales", "text": "", "subsections": []}, {"name": "Uso en la industria", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Programaci%C3%B3n_imperativa", "title": "Programación imperativa", "summary": "En ciencias de la computación se denomina programación imperativa a un paradigma de programación de software que utiliza fórmulas que alteran el estado de un programa.\n\nLa programación imperativa se considera el paradigma de programación más antiguo. Según este, un programa es «una secuencia claramente definida de instrucciones para un ordenador».[1]​\n\n", "sections": [{"name": "Funcionamiento", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Programaci%C3%B3n_orientada_a_objetos", "title": "Programación orientada a objetos", "summary": "\n\nBusca fuentes: «Programación orientada a objetos» – noticias · libros · académico · imágenes\nLa programación orientada a objetos (POO) es un paradigma de programación que parte del concepto de \"objetos\" como base, los cuales contienen información en forma de campos (a veces también referidos como atributos cualidades o propiedades) y código en forma de métodos.\n\nLos objetos son capaces de interactuar y modificar los valores contenidos en sus campos o atributos (estado) a través de sus métodos (comportamiento).[1]​\n\nMuchos de los objetos prediseñados de los lenguajes de programación actuales permiten la agrupación en bibliotecas o librerías, sin embargo, muchos de estos lenguajes permiten al usuario la creación de sus propias bibliotecas.\n\nAlgunas características clave de la programación orientada a objetos son herencia, cohesión, abstracción, polimorfismo, acoplamiento y encapsulamiento.\n\nSu uso se popularizó a principios de la década de 1990. En la actualidad, existe una gran variedad de lenguajes de programación que soportan la orientación a objetos, estando la mayoría de éstos basados en el concepto de clases e instancias.\n\n", "sections": [{"name": "Introducción", "text": "", "subsections": []}, {"name": "Origen", "text": "", "subsections": []}, {"name": "Historia", "text": "", "subsections": []}, {"name": "Conceptos fundamentales", "text": "", "subsections": []}, {"name": "Características de la POO", "text": "", "subsections": []}, {"name": "Críticas", "text": "", "subsections": []}, {"name": "Resumen", "text": "", "subsections": []}, {"name": "Tipos", "text": "", "subsections": []}, {"name": "Algunos lenguajes orientados a objetos", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Notas y referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/PyGTK", "title": "PyGTK", "summary": "\nPyGTK es un binding de la biblioteca gráfica GTK para el lenguaje de programación Python. La biblioteca GTK se usa para desarrollar el entorno gráfico GNOME, así como sus aplicaciones, a la vez que algunos otros entornos gráficos. La biblioteca GTK permite el desarrollo sencillo de interfaces gráficas y su uso conjunto con Python permite el desarrollo rápido de aplicaciones gráficas potentes.\n\n", "sections": [{"name": "Ejemplos", "text": "", "subsections": []}, {"name": "Aplicaciones que usan PyGTK", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/PyPI", "title": "Índice de paquetes de Python", "summary": "El Python Package Index o PyPI es el repositorio de software oficial para aplicaciones de terceros en el lenguaje de programación \nPython. Los desarrolladores de Python pretenden que sea un catálogo exhaustivo de todos los paquetes de Python escritos en código abierto[1]​\n\nPyPI es análogo a CPAN para Perl, o PEAR para PHP. Existen diversas herramientas para administrar los módulos instalados en Python que\nutilizan PyPI como su repositorio principal, entre ellas EasyInstall, pip, y PyPM\n\nAntiguamente, durante el desarrollo y los primeros tiempos de PyPI, este repositorio era conocido como la tienda de queso (Cheeseshop),\nen referencia a un sketch del grupo Monty Python.\n\nEn 2010, el repositorio sigue siendo un solo servidor en los Países Bajos.[2]​ Todo el tráfico pasó a ser servido desde una plataforma web más moderna, Warehouse[3]​ y la antigua web se cerró al final de ese mes.[4]​ Todos los paquetes fueron migrados y sus historiales preservados.[5]​\n\nEl 16 de abril de 2018,[6]​ todo el tráfico de PyPI comenzó a ser atendido por una plataforma de sitio web más moderna: Warehouse.[7]​ El sitio web heredado se desactivó a fines de ese mes. Todos los paquetes existentes se migraron a la nueva plataforma y se conservaron sus historiales.\n\n", "sections": [{"name": "Uso de PyPI", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/PyPy", "title": "PyPy", "summary": "\nEste aviso fue puesto el 26 de febrero de 2021.\n\nPythonRPython\nPyPy es un intérprete y compilador JIT para el lenguaje Python, que se enfoca en la velocidad y eficiencia, y es 100% compatible con el intérprete original CPython. \n\n", "sections": [{"name": "Detalles y motivación", "text": "", "subsections": []}, {"name": "Estado del Proyecto", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/PyQt", "title": "PyQt", "summary": "\n\nPythonC++\nPyQt es un binding de la biblioteca gráfica Qt para el lenguaje de programación Python. La biblioteca está desarrollada por la firma británica Riverbank Computing y está disponible para Windows, GNU/Linux y Mac OS X bajo diferentes licencias.\n\nEn agosto de 2009, tras intentar negociar con Riverbank Computing la liberación de PyQt bajo licencia LGPL sin conseguirlo, Nokia,\npropietaria de Qt, libera bajo esta licencia un binding similar, llamado PySide.\n\n", "sections": [{"name": "Ejemplo simple", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/PySide", "title": "PySide", "summary": "\nPySide es una biblioteca para Python que hace de binding para las herramientas de interfaz gráfica de usuario (GUI) de Qt. Es una de las alternativas para programar GUI en Python, en vez de usar Tkinter el cual es usado por Python. Otras alternativas similares son PyGTK, PyQt y wxPython. Como Qt, PySide es software libre.\n\nPySide fue liberado bajo la licencia LGPL en agosto de 2009 por Nokia,[2]​ (expropietaria de las herramientas de Qt) después de que Nokia no alcanzara un acuerdo con los desarrolladores de PyQt, Riverbank Computing, para que esta última cambiara los términos de licencia de PyQt para incluir LGPL como licencia alternativa.\n\nPySide soporta Linux/X11, Mac OS X, MeeGo, Windows y Maemo.\n\n", "sections": [{"name": "Ejemplo Hola Mundo", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Pygame", "title": "Pygame", "summary": "Pygame es un conjunto de módulos del lenguaje Python que permiten la creación de videojuegos en dos dimensiones de una manera sencilla. Está orientado al manejo de sprites.\n\nGracias al lenguaje, se puede prototipar y desarrollar rápidamente. Esto se puede comprobar en las competiciones que se disputan en línea, donde es cada vez más usado. Los resultados pueden llegar a ser profesionales.\n\nTambién puede utilizarse para crear otros programas multimedia o interfaces gráficas de usuario. Pygame está basado en la librería SDL (2.24.2 en la versión actual)\n\nFunciona como interfaz de las bibliotecas SDL.\n\n", "sections": [{"name": "Véase también", "text": "", "subsections": []}, {"name": "Bibliografía", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Pyomo", "title": "Pyomo", "summary": "Pyomo es una colección de paquetes de software de Python para formular modelos de optimización.[1]​[2]​\n\nPyomo fue desarrollado por William Hart y Jean-Paul Watson en el Laboratorio Nacional de Sandia y por David Woodruff en Universitarios de California, Davis. Significativas extensiones fueron desarrolladas \npor John Siirola en Laboratorio nacional de Sandia y por Carl Laird \nen la Universidad Purdue. Pyomo es un proyecto de código abierto \nlibremente disponible, y está licenciado con la licencia BSD.\nPyomo es desarrollado como parte del proyecto COIN-OR. \nEs además un paquete de software de código abierto muy popular que es \nusado por gran variedad de agencias gubernamentales e instituciones \nacadémicas.\n\n", "sections": [{"name": "Características", "text": "", "subsections": []}, {"name": "Software relacionado", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Python_License", "title": "Licencia Python", "summary": "La Licencia Python (en inglés, Python License) es una licencia de software ya en desuso creada por la Corporación para las Iniciativas de Investigación (en inglés, Corporation for National Research Initiatives). Utilizada en las versiones 1.6 y 2.0 del lenguaje de programación Python, ambos liberados en el año 2000. La Licencia Python es similar a la Licencia BSD, pero aunque se trata de una Licencia de software libre, la forma que está redactada no la hace compatible con la GNU General Public License (GPL) que es utilizada por la mayoría de los proyectos incluyendo el kernel Linux. Por esta razón CNRI retiró la licencia en el 2001, a favor de la Python Software Foundation License.\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Python_Software_Foundation", "title": "Python Software Foundation", "summary": "La Python Software Foundation (PSF) es una organización sin fines de lucro creada el 6 de marzo de 2001[1]​ dedicada al lenguaje de programación Python. La misión de la fundación es fomentar el desarrollo de la comunidad Python.[2]​ Es responsable de varios procesos dentro de la comunidad, como el desarrollo de Python, la administración de los derechos intelectuales y de obtener fondos.\n\n", "sections": [{"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Python_Software_Foundation_License", "title": "Python Software Foundation License", "summary": "\n\nSí\nLa Python Software Foundation License, o PSFL por sus siglas en inglés, es una licencia de software libre permisiva, al estilo de la licencia BSD, es decir, que cumple con los requisitos OSI para ser declarada licencia de software libre; además, es compatible con la licencia GPL. A diferencia de la licencia GPL, y como la mayoría de licencias tipo BSD, la licencia PSFL no es una licencia copyleft, y permite modificaciones del código fuente, así como la creación de trabajos derivados, sin requerir que ni las modificaciones ni los trabajos derivados tengan que ser a su vez de código abierto. La licencia PSFL está dentro de las listas de licencias aprobadas tanto por la Free Software Foundation como por la Open Source Initiative.\n\nEl PSF se enfoca en empoderar y apoyar a las personas dentro de la comunidad de Python con programas de subvenciones que apoyan sprints, conferencias, reuniones, grupos de usuarios y el desarrollo de Python en todo el mundo. Python Software Foundation (El PSF) ejecuta PyCon US, la principal conferencia comunitaria de Python.[1]​ El PSF es el punto de contacto principal para las organizaciones que desean trabajar con Python, apoyar Python o patrocinar el desarrollo de Python.\n\nLas versiones más antiguas de Python se encontraban bajo la así llamada Python license, que era incompatible con la GPL. La razón aducida por la FSF para esta incompatibilidad es que en la licencia se estipulaba que “esta licencia de Python se rige por las leyes del Estado de Virginia, en los Estados Unidos de América, mientras que la GPL no admite esto”.[2]​\n\nEn 2001, el año en el que el creador de Python, Guido van Rossum, cambió la licencia para arreglar esta incompatibilidad, fue galardonado con el premio \"FSF Award for the Advancement of Free Software\".[3]​\n\n", "sections": [{"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Pythonidae", "title": "Pythonidae", "summary": "\n \n\nFitzinger, 1826\nVéase texto.\n\nLos pitónidos o pitones (Pythonidae) son una familia de serpientes constrictoras propias del paleotrópico. Otras fuentes consideran a este grupo una subfamilia de la familia de las boas (Boidae) (subfamilia Pythoninae).[1]​ Las pitones se pueden distinguir de las boas en que tienen dientes en el premaxilar, un pequeño hueso en la parte frontal de la mandíbula superior. La mayoría de las boas dan a luz crías vivas, mientras que las pitones ponen huevos. Algunas variedades pueden llegar a ser muy largas: hasta ocho metros. Ciertas especies de boas de arena (subfamilia Ericinae) son llamadas erróneamente pitones.\n\n", "sections": [{"name": "Lista de géneros", "text": "", "subsections": []}, {"name": "Comportamiento", "text": "", "subsections": []}, {"name": "Reproducción", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Qt_(biblioteca)", "title": "Qt (biblioteca)", "summary": "\n\n[\n]\nQt Company (2014-presente)Qt Project (2011–presente)\nQt MessageQt User InterfaceQt Translation source fileQt Assistant Documentation ProfileQt Assistant Content FileQt Resource CollectionQt Jambi User Interface\nQt es un framework multiplataforma orientado a objetos ampliamente usado para desarrollar programas (software) que utilicen interfaz gráfica de usuario, así como también diferentes tipos de herramientas para la línea de comandos y consolas para servidores que no necesitan una interfaz gráfica de usuario.\n\nQt es desarrollada como un software libre y de código abierto a través de Qt Project, donde participa tanto la comunidad, como desarrolladores de Nokia, Digia y otras empresas.[3]​ Anteriormente, era desarrollado por la división de software de Qt de Nokia, que entró en vigor después de la adquisición por parte de Nokia de la empresa noruega Trolltech, el productor original de Qt, el 17 de junio de 2008.[4]​ Qt es distribuida bajo los términos de GNU Lesser General Public License y otras. Por otro lado, Digia está a cargo de las licencias comerciales de Qt desde marzo de 2011.\n\nQt es utilizada en KDE Plasma, entorno de escritorio para sistemas como GNU/Linux o FreeBSD, entre otros.\n\n", "sections": [{"name": "Propósitos y características", "text": "", "subsections": []}, {"name": "Historia", "text": "", "subsections": []}, {"name": "Plataformas", "text": "", "subsections": []}, {"name": "Bindings", "text": "", "subsections": []}, {"name": "Ejemplo de programación", "text": "", "subsections": []}, {"name": "Usos", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/RPython", "title": "PyPy", "summary": "\nEste aviso fue puesto el 26 de febrero de 2021.\n\nPythonRPython\nPyPy es un intérprete y compilador JIT para el lenguaje Python, que se enfoca en la velocidad y eficiencia, y es 100% compatible con el intérprete original CPython. \n\n", "sections": [{"name": "Detalles y motivación", "text": "", "subsections": []}, {"name": "Estado del Proyecto", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Recolecci%C3%B3n_de_basura", "title": "Recolector de basura", "summary": "Un recolector de basura (del inglés garbage collector) es un mecanismo implícito de gestión de memoria implementado en algunos lenguajes de programación de tipo interpretado o semiinterpretado.\n\n", "sections": [{"name": "Breve reseña histórica", "text": "", "subsections": []}, {"name": "Contexto", "text": "", "subsections": []}, {"name": "Funcionamiento", "text": "", "subsections": []}, {"name": "Ventajas y desventajas", "text": "", "subsections": []}, {"name": "Implementación", "text": "", "subsections": []}, {"name": "Ejemplos de lenguajes con recolector de basura", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Reflexi%C3%B3n_(inform%C3%A1tica)", "title": "Reflexión (informática)", "summary": "En informática, reflexión (o reflexión computacional) es la capacidad que tiene un programa para observar y opcionalmente modificar su estructura de alto nivel.\n\nNormalmente, la reflexión es dinámica o en tiempo de ejecución, aunque algunos lenguajes de programación permiten reflexión estática o en tiempo de compilación. Es más común en lenguajes de programación de alto nivel ejecutándose sobre una máquina virtual, como Smalltalk o Java, y menos común en lenguajes como C.\n\nEn un sentido más amplio, la reflexión es una actividad computacional que razona sobre su propia computación.\n\nCuando el código fuente de un programa se compila, normalmente se pierde la información sobre la estructura del programa conforme se genera el código de bajo nivel (normalmente lenguaje ensamblador). Si un sistema permite reflexión, se preserva la estructura como metadatos en el código generado. Dependiendo de la implementación, el código con reflexión tiende a ser más lento que el que no lo tiene.\n\nEn los lenguajes que no distinguen entre tiempo de ejecución y tiempo de compilación (como las distintas variantes de Lisp), no hay diferencia entre compilación o interpretación de código y reflexión.\n\n", "sections": [{"name": "Implementación", "text": "", "subsections": []}, {"name": "Ejemplos", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Ruby", "title": "Ruby", "summary": "\n[\n]\nRuby es un lenguaje de programación interpretado, reflexivo y orientado a objetos, creado por el programador japonés Yukihiro \"Matz\" Matsumoto, quien comenzó a trabajar en Ruby en 1993, y lo presentó públicamente en 1995. Combina una sintaxis inspirada en Python y Perl con características de programación orientada a objetos similares a Smalltalk. Comparte también funcionalidad con otros lenguajes de programación como Lisp, Lua, Dylan y CLU. Ruby es un lenguaje de programación interpretado en una sola pasada y su implementación oficial es distribuida bajo una licencia de software libre.\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Filosofía", "text": "", "subsections": []}, {"name": "Semántica", "text": "", "subsections": []}, {"name": "Características", "text": "", "subsections": []}, {"name": "Sintaxis", "text": "", "subsections": []}, {"name": "Licencia", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Scheme", "title": "Scheme", "summary": "\n\nBusca fuentes: «Scheme» – noticias · libros · académico · imágenes\n\nScheme es un lenguaje de programación funcional (si bien impuro pues sus estructuras de datos no son inmutables) y un dialecto de Lisp. Fue desarrollado por Guy L. Steele y Gerald Jay Sussman en la década de los setenta e introducido en el mundo académico a través de una serie de artículos conocidos como los Lambda Papers de Sussman y Steele.\n\nLa filosofía de Scheme es minimalista. Su objetivo no es acumular un gran número de funcionalidades, sino evitar las debilidades y restricciones que hacen necesaria su adición. Así, Scheme proporciona el mínimo número posible de nociones primitivas, construyendo todo lo demás a partir de un reducido número de abstracciones. Por ejemplo, el mecanismo principal para el control de flujo son las llamadas recursivas.\n\nScheme fue el primer dialecto de Lisp que usó ámbito estático, también conocido como ámbito léxico, (en lugar de dinámico) de forma exclusiva. También fue uno de los primeros lenguajes de programación con continuaciones explícitas, un mecanismo para guardar y usar el estado entero de un programa en un momento determinado. Scheme ofrece también gestión automática de memoria (recolección de basura).\n\nLas listas son la estructura de datos básica del lenguaje, que también ofrece arrays entre sus tipos predefinidos. Debido a su especificación minimalista, no hay sintaxis explícita para crear registros o estructuras, o para programación orientada a objetos, pero muchas implementaciones ofrecen dichas funcionalidades.\n\nScheme se llamaba originalmente \"Schemer\", siguiendo la tradición de los lenguajes Planner y Conniver. Su nombre actual se debe a que sus autores usaban el sistema operativo ITS, que limitaba la longitud de los nombres de fichero a 6 caracteres.\n\n", "sections": [{"name": "Ventajas de Scheme", "text": "", "subsections": []}, {"name": "Desventajas de Scheme", "text": "", "subsections": []}, {"name": "Estándares", "text": "", "subsections": []}, {"name": "Elementos del lenguaje", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/SciPy", "title": "SciPy", "summary": "\n\nPythonCFortranC++Cython\nSciPy es una biblioteca libre y de código abierto para Python. Se compone de herramientas y algoritmos matemáticos. Se creó a partir de la colección original de Travis Oliphant, que se componía de módulos de extensión para Python y fue lanzada en 1999 bajo el nombre de Multipack, llamada así por los paquetes netlib que reunían a ODEPACK, QUADPACK, y MINPACK.\n\nSciPy contiene módulos para optimización, álgebra lineal, integración, interpolación, funciones especiales, FFT, procesamiento de señales y de imagen, resolución de ODEs y otras tareas para la ciencia e ingeniería.\n\nSciPy se basa en el objeto de matriz NumPy y es parte del conjunto NumPy, que incluye herramientas como Matplotlib, Pandas y SymPy, y un conjunto en expansión de bibliotecas de computación científica. Este conjunto está dirigido al mismo tipo de usuarios que los de aplicaciones como MATLAB, GNU Octave, y Scilab. A veces también se hace referencia a este conjunto de herramientas y bibliotecas como SciPy.[1]​\n\nSciPy también es un conjunto de conferencias para usuarios y desarrolladores de estas herramientas: SciPy, en los Estados Unidos; EuroSciPy, en Europa; y SciPy.in, en la India.[2]​ La empresa Enthought originó la conferencia SciPy en Estados Unidos y continuó patrocinando muchas de las conferencias internacionales, así como el alojamiento del sitio web de SciPy.\n\n", "sections": [{"name": "Estructuras de datos", "text": "", "subsections": []}, {"name": "Historia", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Sentencia_condicional", "title": "Sentencia condicional", "summary": "\n\nBusca fuentes: «Sentencia condicional» – noticias · libros · académico · imágenes\nLos tipos más conocidos de sentencias condicionales son el SI..ENTONCES (if..then), el SI..ENTONCES..SI NO (if..then..else) y el SEGÚN (case o switch), aunque también podríamos mencionar al manejo de excepciones como una alternativa más moderna para evitar el \"anidamiento\" de carne condicionales.\n\nLas sentencias condicionales constituyen, junto con los bucles, los pilares de la programación estructurada, y su uso es una evolución de una sentencia en lenguaje ensamblador que ejecutaba la siguiente línea o no en función del valor de una condición.\n\n", "sections": [{"name": "Lanzamiento de errores", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Servidor_web", "title": "Servidor web", "summary": "Un servidor web o servidor HTTP es un programa informático que procesa una aplicación del lado del servidor, realizando conexiones bidireccionales o unidireccionales y síncronas o asíncronas con el cliente y generando o cediendo una respuesta en cualquier lenguaje o aplicación del lado del cliente. El código recibido por el cliente es renderizado por un navegador web. Para la transmisión de todos estos datos suele utilizarse algún protocolo. Generalmente se usa el protocolo HTTP para estas comunicaciones, perteneciente a la capa de aplicación del modelo OSI. El término también se emplea para referirse a la computadora donde se ejecutan esas tareas.\n\n", "sections": [{"name": "Arquitectura", "text": "", "subsections": []}, {"name": "Funcionamiento", "text": "", "subsections": []}, {"name": "Aplicación del lado del servidor", "text": "", "subsections": []}, {"name": "Servidor web local", "text": "", "subsections": []}, {"name": "Software", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Simple_API_for_XML", "title": "Simple API for XML", "summary": "SAX son las siglas de \"Simple API for XML\", originalmente una API únicamente para el lenguaje de programación Java que después se convirtió en la API estándar de facto para usar XML en JAVA. Existen versiones de SAX no sólo para JAVA, sino también para otros lenguajes de programación (como Python).\n\n\n", "sections": [{"name": "Analizador o parser SAX", "text": "", "subsections": []}, {"name": "Ventaja y desventajas", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Sistema_de_tipos", "title": "Sistema de tipos", "summary": "\n\nBusca fuentes: «Sistema de tipos» – noticias · libros · académico · imágenes\nEn ciencias de la computación, un sistema de tipos define cómo un lenguaje de programación clasifica los valores y las expresiones en tipos, cómo se pueden manipular estos tipos y cómo interactúan. Un tipo de dato indica un conjunto de valores que tienen el mismo significado genérico o propósito (aunque algunos tipos, como los tipos de datos abstractos y tipos de datos función tal vez no representen valores en el programa que se está ejecutando). Los sistemas de tipificación varían significativamente entre lenguajes, siendo quizás las más importantes variaciones las que estén en sus propias implementaciones de la sintáctica en tiempo de compilación y la operativa en tiempo de ejecución.\n\nUn compilador puede usar el tipo estático de un valor para optimizar el almacenamiento que necesita y la elección de los algoritmos para las operaciones sobre ese valor. Por ejemplo, en muchos compiladores de C el tipo de dato \"flotante\" se representa en 32 bits, de acuerdo con la especificación IEEE para los números de coma flotante de simple precisión. Entonces, C usa operaciones específicas de coma flotante sobre estos valores (suma de coma flotante, multiplicación, etc.).\n\nEl rango del tipo de dato limita y la forma de su evaluación afecta en el \"tipado\" del lenguaje. Además, un lenguaje de programación puede asociar una operación concreta con diferentes algoritmos para cada tipo de dato en el caso del polimorfismo. En matemáticas y lógica, la teoría de tipos es el estudio de los sistemas de tipos, aunque los sistemas de tipos de datos concretos de los lenguajes de programación se originaron a partir de los problemas técnicos de las arquitecturas del ordenador, implementación del compilador y diseño del lenguaje.\n\n", "sections": [{"name": "Básicos", "text": "", "subsections": []}, {"name": "Chequeo de tipificación", "text": "", "subsections": []}, {"name": "Controversia", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Sistema_operativo", "title": "Sistema operativo", "summary": "Un sistema operativo (SO) es el conjunto de programas de un sistema informático que gestiona los recursos del hardware y provee servicios a los programas de aplicación de software. Estos programas se ejecutan en modo privilegiado respecto de los restantes.[1]​\n\nUno de los propósitos del sistema operativo que gestiona el núcleo intermediario consiste en gestionar los recursos de localización y protección de acceso del hardware, hecho que alivia a los programadores de aplicaciones de tener que tratar con estos detalles. La mayoría de los aparatos electrónicos que utilizan microprocesadores para funcionar, llevan incorporado un sistema operativo (teléfonos móviles, reproductores de DVD, computadoras, enrutadores, etc.). En cuyo caso, son manejados mediante una interfaz gráfica de usuario, un gestor de ventanas o un entorno de escritorio, si es un celular, mediante una consola o control remoto si es un DVD y, mediante una línea de comandos o navegador web si es un enrutador.\n\nEl sistema operativo de escritorio dominante es Microsoft Windows con una cuota de mercado de alrededor del 75,88%. macOS de Apple Inc. ocupa el segundo lugar (13,23%), y las variedades de GNU/Linux están colectivamente en tercer lugar (1,57%).[2]​ En el sector móvil (incluidos teléfonos inteligentes y tabletas), la participación de Android es de hasta un 70% en el año 2017.[3]​ Las distribuciones Linux son dominantes en los sectores de servidores y supercomputación.[4]​ Existen otras clases especializadas de sistemas operativos, como los sistemas integrados y en tiempo real, para muchas aplicaciones.\n\n", "sections": [{"name": "Funciones principales", "text": "", "subsections": []}, {"name": "Antecedentes", "text": "", "subsections": []}, {"name": "Llamadas al sistema", "text": "", "subsections": []}, {"name": "Componentes", "text": "", "subsections": []}, {"name": "Clasificación", "text": "", "subsections": []}, {"name": "Denominaciones erróneas", "text": "", "subsections": []}, {"name": "Sistemas operativos para PC", "text": "", "subsections": []}, {"name": "Sistemas operativos para dispositivos móviles", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Notas", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Bibliografía", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Smalltalk", "title": "Smalltalk", "summary": "\nSmalltalk es un lenguaje reflexivo de programación, orientado a objetos y con tipado dinámico. Por sus características, Smalltalk puede ser considerado también como un entorno de objetos, donde incluso el propio sistema es un objeto. Metafóricamente, se puede considerar que un Smalltalk es un mundo virtual donde viven objetos que se comunican entre sí, mediante el envío de mensajes.\n\nUn sistema Smalltalk está compuesto por:\n\nUna Máquina virtual\nUn archivo llamado \"Imagen\", que contiene a todos los objetos del sistema.\nUn lenguaje de programación (también conocido como Smalltalk).\nUna enorme biblioteca de \"objetos reusables\".\nY generalmente, un entorno de desarrollo que además puede funcionar como un sistema en tiempo de ejecución.\nSmalltalk obtuvo el segundo lugar para \"lenguaje de programación más querido\" en las encuestas para desarrolladores de Stack Overflow en 2017.[1]​\n\n", "sections": [{"name": "Historia", "text": "", "subsections": []}, {"name": "Terminología", "text": "", "subsections": []}, {"name": "Características", "text": "", "subsections": []}, {"name": "El entorno Smalltalk", "text": "", "subsections": []}, {"name": "Sintaxis", "text": "", "subsections": []}, {"name": "Recolección de basura", "text": "", "subsections": []}, {"name": "Reflexión computacional", "text": "", "subsections": []}, {"name": "Ejemplos de Smalltalk", "text": "", "subsections": []}, {"name": "Bibliografía", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Software", "title": "Software", "summary": "Se conoce como software (pronunciación en inglés: /ˈsɔftˌwɛr/),[1]​ logicial o soporte lógico al sistema formal de un sistema informático, que comprende el conjunto de los componentes lógicos necesarios que hace posible la realización de tareas específicas, en contraposición a los componentes físicos que son llamados hardware. La interacción entre el software y el hardware hace operativo un ordenador (u otro dispositivo), es decir, el software envía instrucciones que el hardware ejecuta, haciendo posible su funcionamiento.\n\nLos componentes lógicos incluyen, entre muchos otros, las aplicaciones informáticas, tales como el procesador de texto, que permite al usuario realizar todas las tareas concernientes a la edición de textos; el llamado software de sistema, tal como el sistema operativo, que básicamente permite al resto de los programas funcionar adecuadamente, facilitando también la interacción entre los componentes físicos y el resto de las aplicaciones, y proporcionando una interfaz con el usuario.[2]​\n\nEl software, en su gran mayoría, está escrito en lenguajes de programación de alto nivel, ya que son más fáciles y eficientes para que los programadores los usen, porque son más cercanos al lenguaje natural respecto del lenguaje de máquina.[3]​ Los lenguajes de alto nivel se traducen a lenguaje de máquina utilizando un compilador o un intérprete, o bien una combinación de ambos. El software también puede estar escrito en lenguaje ensamblador, que es de bajo nivel y tiene una alta correspondencia con las instrucciones de lenguaje máquina; se traduce al lenguaje de la máquina utilizando un ensamblador.\n\nEl anglicismo software es el más ampliamente difundido al referirse a este concepto, especialmente en la jerga técnica, en tanto que el término sinónimo «logicial», derivado del término francés logiciel, es utilizado mayormente en países y zonas de influencia francesa.\n\n", "sections": [{"name": "Etimología", "text": "", "subsections": []}, {"name": "Definición de software", "text": "", "subsections": []}, {"name": "Clasificación del software", "text": "", "subsections": []}, {"name": "Proceso de creación del software", "text": "", "subsections": []}, {"name": "Carácter evolutivo del software", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Bibliografía", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Squid_(programa)", "title": "Squid (programa)", "summary": "\nCC++\nSquid es un servidor proxy para web con caché. Es una de las aplicaciones más populares y de referencia para esta función, es un desarrollo en software libre publicado bajo licencia GPL. Entre sus utilidades está la de mejorar el rendimiento de las conexiones de empresas y particulares a Internet guardando en caché peticiones recurrentes a servidores web y DNS, acelerar el acceso a un servidor web determinado o añadir seguridad realizando filtrados de tráfico.\n\nAunque orientado principalmente a HTTP y HTTPS soporta también otros protocolos como FTP e incluso Gopher. Implementa cifrado SSL/TLS tanto en la conexión al servidor web como a los navegadores y cualquier cliente web que lo soporte.\n\nSquid es una aplicación muy consolidada en Internet. En desarrollo desde los años 1990, se le considera muy completo y robusto y es el software de referencia como servidor proxy-caché de web. Como muchas aplicaciones de software libre está incluido en distribuciones GNU/Linux pero se puede ejecutar también en entornos tipo Unix y hay algunas versiones para MS Windows.\n\n", "sections": [{"name": "Características", "text": "", "subsections": []}, {"name": "Proxy Web", "text": "", "subsections": []}, {"name": "Compatibilidad", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Subrutina", "title": "Subrutina", "summary": "En informática, una subrutina o subprograma (también llamada procedimiento, función, rutina o método), como idea general, se presenta como un subalgoritmo que forma parte del algoritmo principal, el cual permite resolver una tarea específica. Algunos lenguajes de programación, como Visual Basic .NET o Fortran, utilizan el nombre función para referirse a subrutinas que devuelven un valor.\n\n", "sections": [{"name": "Concepto de subrutina", "text": "", "subsections": []}, {"name": "Elementos de la declaración de una subrutina", "text": "", "subsections": []}, {"name": "Ejemplos", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Tcl/Tk", "title": "Tcl", "summary": "\n\n[\n]\nTcl (pronunciado /tí.quel/, originado del acrónimo en inglés \"Tool Command Language\" o \"lenguaje de herramientas de comando\", actualmente se escribe como \"Tcl\" en lugar de \"TCL\"), es un lenguaje de script creado por John Ousterhout, que ha sido concebido con una sintaxis sencilla para facilitarse su aprendizaje, sin detrimento de la funcionalidad y expresividad.\n\nSe utiliza principalmente para el desarrollo rápido de prototipos, aplicaciones \"script\", interfaces gráficas y pruebas. La combinación de Tcl con Tk (del inglés Tool Kit) es conocida como Tcl/Tk, y se utiliza para la creación de interfaces gráficas.\n\n", "sections": [{"name": "Características", "text": "", "subsections": []}, {"name": "Antecedentes", "text": "", "subsections": []}, {"name": "Sintaxis y semántica fundamental", "text": "", "subsections": []}, {"name": "Ejemplos", "text": "", "subsections": []}, {"name": "Desarrollo y ejecución", "text": "", "subsections": []}, {"name": "Programación orientada a objetos", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Tim_Peters", "title": "Tim Peters", "summary": " \nTim Peters es un desarrollador de software estadounidense conocido por la creación del algoritmo de ordenación híbrido Timsort y por sus importantes contribuciones al lenguaje de programación Python y su implementación original CPython. Como usuario de CPython antes de la versión 1.0, formó parte del grupo de los primeros usuarios que contribuyeron al diseño detallado del lenguaje en sus primeras etapas.[1]​[2]​\n\nMás tarde creó el algoritmo Timsort (basado en un trabajo anterior sobre el uso de la búsqueda \"al galope\")[3]​ que se ha utilizado en Python desde la versión 2.3 [cita requerida], así como en otras plataformas informáticas[4]​[5]​[6]​ ampliamente utilizadas, incluido el motor V8 JavaScript que impulsa los navegadores web Google Chrome y Chromium, así como Node.js.[7]​[8]​ También ha aportado los módulos doctest y timeit a la biblioteca estándar de Python.[9]​\n\nPeters también escribió el Zen de Python, pensado como una declaración de la filosofía de diseño de Python, que se incorporó a la literatura oficial de Python como Propuesta de Mejora 20 de Python y en el intérprete de Python como un easter egg.[10]​ Contribuyó con el capítulo sobre algoritmos al libro de cocina de Python. De 2001 a 2014 fue miembro activo de la junta directiva de la Python Software Foundation. Peters fue un influyente colaborador de las listas de correo de Python.[11]​ También es un contribuyente de alto rango en Stack Overflow, sobre todo por las respuestas relacionadas con Python.[12]​[13]​\n\nEntre los anteriores empleadores de Peters se encuentra Kendall Square Research. Tim Peters recibió el premio al servicio distinguido de la Python Software Foundation en 2017.\n\n", "sections": [{"name": "Ve también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Tipado_din%C3%A1mico", "title": "Tipado dinámico", "summary": "Un lenguaje de programación es dinámicamente tipado si una variable puede tomar valores de distintos tipos. La mayoría de lenguajes de tipado dinámico son lenguajes interpretados, como Python o Ruby. Un lenguaje que no es dinámicamente tipado se dice que es de tipado estático, o estáticamente tipado. Esta separación se suele confundir con la diferencia entre lenguajes fuertemente tipados y lenguajes débilmente o no tipados.\nEsta característica estuvo en el lenguaje de programación \"SmallTalk\".\n\n\n\n", "sections": [{"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Tipado_fuerte", "title": "Tipado fuerte", "summary": "\n\nBusca fuentes: «Tipado fuerte» – noticias · libros · académico · imágenes\nUn lenguaje de programación es fuertemente tipado si no se permiten violaciones de los tipos de datos, es decir, dado el valor de una variable de un tipo concreto, no se puede usar como si fuera de otro tipo distinto a menos que se haga una conversión. No hay una única definición de este término. Un lenguaje que se dice que no está tipado se refiere a que no está fuertemente tipado.\n\n", "sections": [{"name": "Explicación detallada", "text": "", "subsections": []}, {"name": "Confusión común del concepto", "text": "", "subsections": []}, {"name": "Lenguajes no tipados", "text": "", "subsections": []}, {"name": "Ejemplos de lenguajes fuertemente tipados", "text": "", "subsections": []}, {"name": "Ejemplos de lenguajes no tipados", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Tk", "title": "Tk", "summary": "\n\nTk es una aplicación libre multiplataforma y un conjunto de controles (widget toolkit). Es una biblioteca de elementos básicos para construir una interfaz gráfica de usuario (GUI).\n\nTk fue desarrollado por John Ousterhout como una extensión para el lenguaje de guiones (script) Tcl. También llamado \"bindings\", Tk puede ser usado por otros lenguajes como Perl, Python, y Ruby. Hay dos formas de usar Tk desde Perl: \tel módulo Tcl::Tk Perl que usa Tcl como un puente (este acercamiento proporciona más flexibilidad), y Perl/Tk tiene solo (solamente las extensiones adoptadas de Tcl/Tk disponibles). Python y Ruby también usan Tcl como puente para Tk.\n\nTk ha sido portado para correr en la mayoría de las variantes de Linux, Apple Macintosh, Unix, y Windows. Desde el Tcl/Tk 8, ofrece  \"native look and feel\" (por ejemplo, los menús y botones son mostrados de forma “nativa” en cualquier plataforma). También, hay varias extensiones que proveen externamente arrastrar y soltar (drag-and-drop), ventanas no-rectangulares y controles originales.\n\nLa más inusual característica de Tk son sus controles canvas y texto, los cuales proveen capacidades no halladas en casi ningún conjunto de controles similares.\n\nAl igual que Tcl, Tk soporta Unicode dentro del Plano Multilenguaje Básico pero este todavía no ha sido extendido para manejar Unicode de 32-bit.\n\n", "sections": [{"name": "Véase también", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Tkinter", "title": "Tkinter", "summary": "Tkinter es un binding de la biblioteca gráfica Tcl/Tk para el lenguaje de programación Python. Se considera un estándar de interfaz gráfica de usuario (GUI) para Python y está incluido por defecto con la instalación para Microsoft Windows.\n\nHoy en día, hay otras alternativas disponibles como wxPython, PySimpleGUI, PyQt, PySide y PyGTK que cumplen con todos los estándares de componente visual.\n\n", "sections": [{"name": "Ejemplo", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos (en inglés)", "text": "", "subsections": []}, {"name": "Enlaces externos (en español)", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Uni%C3%B3n_de_conjuntos", "title": "Unión de conjuntos", "summary": "A\nB\nA ∪ B\nEn la teoría de conjuntos, la unión de dos (o más) conjuntos es una operación que resulta en otro conjunto, cuyos elementos son los mismos de los conjuntos iniciales. Por ejemplo, el conjunto de los números naturales es la unión del conjunto de los números pares positivos P y el conjunto de los números impares positivos I:\n\n\n\n\n\nP\n=\n{\n2\n,\n4\n,\n6\n,\n…\n}\n\n\n{\\displaystyle P=\\{2,4,6,\\ldots \\}}\n\n\n\n\n\n\nI\n=\n{\n1\n,\n3\n,\n5\n,\n…\n}\n\n\n{\\displaystyle I=\\{1,3,5,\\ldots \\}}\n\n\n\n\n\n\n\nN\n\n=\n{\n1\n,\n2\n,\n3\n,\n4\n,\n…\n}\n\n\n{\\displaystyle \\mathbb {N} =\\{1,2,3,4,\\ldots \\}}\n\n\nLa unión de conjuntos se denota por el símbolo \n\n\n\n∪\n\n\n{\\displaystyle \\cup }\n\n , de modo que por ejemplo:\n\n\n\n\n\n\nN\n\n=\nP\n∪\nI\n\n\n{\\displaystyle \\mathbb {N} =P\\cup I}\n\n\n", "sections": [{"name": "Definición", "text": "", "subsections": []}, {"name": "Propiedades", "text": "", "subsections": []}, {"name": "Axioma de la unión", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Variable_(programaci%C3%B3n)", "title": "Variable (programación)", "summary": "En programación, una variable está formada por un espacio en el sistema de almacenaje (memoria principal de un ordenador) y un nombre simbólico (un identificador) que está asociado a dicho espacio. Ese espacio contiene una cantidad de información conocida o desconocida, es decir un valor. El nombre de la variable es la forma usual de referirse al valor almacenado: esta separación entre nombre y contenido permite que el nombre sea usado independientemente de la información exacta que representa. El identificador, en el código fuente de la computadora puede estar ligado a un valor durante el tiempo de ejecución y el valor de la variable puede por lo tanto cambiar durante el curso de la ejecución del programa. El concepto de variables en computación puede no corresponder directamente al concepto de variables en matemática. El valor de una variable en computación no es necesariamente parte de una ecuación o [[Fórmula (expresión)|fórmula como en matemáticas. En computación una variable puede ser utilizada en un proceso repetitivo: puede asignársele un valor en un sitio, ser luego utilizada en otro, y más adelante reasignársele un nuevo valor para más tarde utilizarla de la misma manera. Procedimientos de este tipo son conocidos con el nombre de iteración. En programación de computadoras, a las variables, frecuentemente se le asignan nombres largos para hacerlos relativamente descriptivas para su uso, mientras que las variables en matemáticas a menudo tienen nombres escuetos, formados por uno o dos caracteres para hacer breve en su transcripción y manipulación.\n\nEl espacio en el sistema de almacenaje puede ser referido por diferentes identificadores. Esta situación es conocida entre los angloparlantes como \"aliasing\", y podría traducirse como \"sobre nombramiento\" para los hispanoparlantes. Asignarle un valor a una variable utilizando uno de los identificadores cambiará el valor al que se puede acceder a través de los otros identificadores.\n\nEn el proceso de compilación de un programa, los compiladores deben transformar el código escrito por el programador en código ejecutable. Así, las variables que son nombradas por el programador con un nombre simbólico, como por ejemplo \"x\", deben ser reemplazadas por la ubicación real de los datos en la memoria del ordenador. \n\nEsto significa que el compilador debe asignar una dirección de memoria específica para cada variable utilizada en el programa, y luego reemplazar el nombre simbólico utilizado por el programador por esta dirección de memoria real. De esta manera, cuando el programa comienza a ejecutarse, el ordenador puede encontrar y manipular los datos almacenados en la memoria utilizando estas direcciones de memoria reales. \n\nMientras que el nombre, tipo y ubicación de una variable permanecen fijos, los datos almacenados en la ubicación pueden ser cambiados durante la ejecución del programa.\n\nLas variables no pueden almacenar declaraciones (como \"for\" o \"if\") o funciones que no devuelvan datos. En el caso contrario, devolverán error.\n\nLas variables pueden ser de longitud:\n\nFija.- Cuando el tamaño de la misma no variará a lo largo de la ejecución del programa. Todas las variables, sean del tipo de dato que sean tienen longitud fija, salvo algunas excepciones — como las colecciones de otras variables (arrays) o las cadenas.\nVariable.- Cuando el tamaño de la misma puede variar a lo largo de la ejecución. Típicamente colecciones de datos en su mayoría.\n", "sections": [{"name": "Tipos de datos", "text": "", "subsections": []}, {"name": "Variables y paso de parámetros a subalgoritmos", "text": "", "subsections": []}, {"name": "Almacenamiento de variables en memoria", "text": "", "subsections": []}, {"name": "Ámbito", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Vector_(inform%C3%A1tica)", "title": "Vector (informática)", "summary": "En programación, se le denomina vector, formación, matriz[1]​[2]​ (en inglés array, del cual surge la mala traducción arreglo),[3]​ a una zona de almacenamiento contiguo que contiene una serie de elementos del mismo tipo, los elementos de la matriz.[4]​ Desde el punto de vista lógico una matriz se puede ver como un conjunto de elementos ordenados en fila (o filas y columnas si tuviera dos dimensiones).\n\nEn principio, se puede considerar que todas las matrices son de una dimensión, la dimensión principal, pero los elementos de dicha fila pueden ser a su vez matrices (un proceso que puede ser recursivo), lo que nos permite hablar de la existencia de matrices multidimensionales, aunque las más fáciles de imaginar son las de una, dos y tres dimensiones.\n\nDefinición objetiva\nUn vector (matriz) es una colección ordenada de datos (tanto primitivos u objetos dependiendo del lenguaje). Los vectores (matrices) se emplean para almacenar múltiples valores en una sola variable, frente a las variables que sólo pueden almacenar un valor (por cada variable).\n\nEstas estructuras de datos son adecuadas para situaciones en las que el acceso a los datos se realice de forma aleatoria e impredecible. Por el contrario, si los elementos pueden estar ordenados y se va a utilizar acceso secuencial sería más adecuado utilizar una lista, ya que esta estructura puede cambiar de tamaño fácilmente durante la ejecución de un programa, siendo esta última una estructura dinámica (al no tener un tamaño definido).[5]​[6]​[7]​[8]​\n\n", "sections": [{"name": "Índices", "text": "", "subsections": []}, {"name": "Notación", "text": "", "subsections": []}, {"name": "Forma de acceso", "text": "", "subsections": []}, {"name": "Vectores dinámicos y estáticos", "text": "", "subsections": []}, {"name": "Vectores multidimensionales", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Virginia", "title": "Virginia", "summary": "Commonwealth of Virginia\n\n\nEn inglés: \"The Old Dominion\"  (En español: \"El Antiguo Dominio\")\n\n37°30′N 79°00′O﻿ / ﻿37.5, -79\n • Población\n226 610\n\n[\n]\n (2021)\nMuy alto\nVA\nVirginia, oficialmente Mancomunidad de Virginia (en inglés Commonwealth of Virginia), es uno de los cincuenta estados que, junto con Washington D. C., forman los Estados Unidos de América. Su capital es Richmond y su ciudad más poblada, Virginia Beach.\n\nEstá ubicado en la región Sur del país, división Atlántico Sur, limitando al noroeste con Virginia Occidental, al noreste con el río Potomac que lo separa de Maryland y Washington D. C., al sur con Carolina del Norte, al suroeste con Tennessee y al oeste con Kentucky. Fue admitido en la Unión el 25 de junio de 1788, como el estado número 10.\n\nRecibe su nombre por la reina Isabel I de Inglaterra, quien, al no haber contraído nunca matrimonio, era conocida como «la reina virgen». El estado es conocido por el apodo de «Viejo Dominio» (Old Dominion) y a veces por el de «Madre de Presidentes», por ser el lugar de nacimiento de ocho presidentes estadounidenses (incluidos cuatro de los cinco primeros).\n\nLas raíces de la Virginia moderna se remontan a la fundación de la Colonia de Virginia en 1607 por la Compañía de Virginia de Londres. La agricultura, el colonialismo y la esclavitud desempeñaron papeles significativos en su economía y su política durante los primeros tiempos. Fue la primera colonia inglesa en el Nuevo Mundo y una de las trece colonias que participarían en la Guerra de Independencia, y posteriormente se convirtió en el corazón de la Confederación en la Guerra Civil estadounidense.\n\nLa capital de la Mancomunidad es Richmond, mientras que Virginia Beach es la ciudad más populosa y el condado de Fairfax es la subdivisión política con mayor población. De acuerdo con el Censo de los Estados Unidos de 2010, la población del estado era de 8 001 024 habitantes.[5]​ Aunque tradicionalmente conservadora e históricamente parte del Sur, la moderna Virginia es un estado políticamente competitivo para los dos principales partidos políticos nacionales.[6]​\n\nVirginia tiene una economía con varios asentamientos importantes, que incluyen El Pentágono del Departamento de Defensa y diversas agencias federales en el Norte del estado, bases militares en Hampton Roads, así como una producción agrícola significativa. El llamado «Triángulo Histórico» incluye los populares destinos turísticos de la historia estadounidense de Jamestown, Yorktown y el museo vivo de Colonial Williamsburg.[7]​ El crecimiento del sector tecnológico ha hecho de los chips la principal exportación del estado, con la industria basada en la solidez de sus escuelas públicas y de sus universidades.[8]​\n\n", "sections": [{"name": "Geografía", "text": "", "subsections": []}, {"name": "Historia", "text": "", "subsections": []}, {"name": "Demografía", "text": "", "subsections": []}, {"name": "Economía", "text": "", "subsections": []}, {"name": "Cultura", "text": "", "subsections": []}, {"name": "Medios de comunicación", "text": "", "subsections": []}, {"name": "Educación", "text": "", "subsections": []}, {"name": "Sanidad", "text": "", "subsections": []}, {"name": "Ley y gobierno", "text": "", "subsections": []}, {"name": "Política", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Windows_10", "title": "Windows 10", "summary": "\n\n[\n]\nRama 22H2, Versión 22H2 (10.0.19045.4412)\n14 de mayo de 2024 (2 días)[2]​\n\nRama 21H2, Versión 21H2 (10.0.19044.4412)\n\nCanal Insider Release Preview (10.0.19045.3391)\n\nWindows Portable Executable file format, 64-bitNew ExecutableWindows Portable Executable file format, 32-bit\nEstándar: hasta el 14 de octubre de 2025, sujeto a cada versión y actualización de características lanzada[5]​[6]​\nWindows 10 es un sistema operativo desarrollado por Microsoft como parte de la familia de sistemas operativos Windows NT.[7]​ Fue dado a conocer oficialmente en septiembre de 2014, seguido por una breve presentación de demostración en la conferencia Build 2014. Entró en fase beta de prueba en octubre de 2014 y fue lanzado al público en general el 29 de julio de 2015.[8]​\n\nPara animar su adopción, Microsoft anunció su descarga gratuita por un año desde su fecha de lanzamiento, para los usuarios que contasen con copias genuinas de Windows 7 (SP1) o Windows 8.1 Update. En julio de 2015 se habilitó una herramienta que permitía reservar esta actualización; dicha herramienta notificaba a cada usuario el momento en el que estaría lista la descarga de la actualización para su dispositivo, para así instalar la compilación 10240, la primera versión estable liberada.[9]​ Los participantes en el programa Windows Insider podían recibir una licencia de Windows 10, pero con ciertas condiciones, entre ellas que su sistema operativo instalado (7, 8, u 8.1) fuese legítimo.[10]​\n\nEsta edición introdujo una arquitectura de aplicaciones «universales». Desarrolladas con la interfaz Continuum y, posteriormente, con la interfaz Fluent Design, estas aplicaciones pueden ser diseñadas para ejecutarse en todas las familias de productos de Microsoft con un código casi idéntico (incluyendo computadoras personales, tabletas, teléfonos inteligentes, sistemas integrados, Xbox One, Surface Hub y HoloLens). La interfaz de usuario fue revisada para realizar transiciones entre una interfaz orientada al ratón y una interfaz orientada a la pantalla táctil basadas en dispositivos de entrada disponibles (particularmente en tabletas). Ambas interfaces incluyen un menú Inicio actualizado que comprende un diseño mezclado de Windows 7 con el diseño metro de Windows 8. También se introduce la Vista de Tareas, un sistema de escritorio virtual, el navegador web Microsoft Edge y otras aplicaciones nuevas o actualizadas, un soporte integrado para iniciar sesión a través de huella digital o reconocimiento facial llamado Windows Hello, nuevas características de seguridad para entornos empresariales, DirectX 12 y WDDM 2.0 para mejorar las capacidades gráficas del sistema operativo para los videojuegos.\n\nMicrosoft describió a Windows 10 tanto un sistema operativo como un servicio que puede recibir actualizaciones en curso para sus características y funcionalidades, además con la habilidad en los entornos empresariales para recibir actualizaciones no críticas en un ritmo más lento, o un soporte a largo plazo que solo recibe actualizaciones críticas, tales como parches de seguridad, en el curso de vida de cinco años de soporte general. Terry Myerson, vicepresidente ejecutivo de Windows and Devices Group de Windows, demostró que las metas de este modelo fue reducir la fragmentación en toda la plataforma de Windows, como Microsoft pretendía tener Windows 10 instalado en al menos mil millones de dispositivos en los dos o tres años después de su lanzamiento.[11]​\n\nWindows 10 recibió reseñas generalmente positivas en el día de su lanzamiento. Los críticos elogiaron la decisión de Microsoft de retirar la interfaz de usuario introducido por Windows 8 (incluyendo las aplicaciones a pantalla completa y la pantalla Inicio)[12]​ en un entorno no táctil para proporcionar una interfaz más orientado al escritorio en la misma línea de las versiones anteriores de Windows, aunque la interfaz de usuario de orientación táctil fue criticada por contener regresiones hacia la interfaz de Windows 8. Los críticos también elogiaron las mejoras para el software promocional de Windows 10 sobre 8.1, la integración de Xbox Live, así como la funcionalidad y capacidades de Cortana y la sustitución de Internet Explorer con Microsoft Edge (aunque el navegador fue criticado por encontrarse aún, en estado de desarrollo).[13]​[14]​\n\nLa mayor parte de la crítica cayó sobre las limitaciones en el usuario para controlar algunas operaciones. En este caso, Windows Update instala las actualizaciones automáticamente. Se reportó una actualización errónea, con el código KB3081424 lanzada en agosto de 2015, que provocaba un error en el registro, esto pudo ser prevenido fácilmente por el usuario, pero al no estar disponible dicha función, provocó molestias entre los usuarios afectados.[15]​ Desde la RTM lanzada en 2015 hasta la versión 1809 de octubre de 2018, solo los usuarios de las ediciones Pro y Enterprise podían pausar la instalación de esta y otras actualizaciones; sin embargo, en la versión 1903 de mayo de 2019 la opción para pausarlas llegó a los usuarios de la edición Home. Preocupaciones por la privacidad también fueron mencionadas por críticos y defensores al ver que los ajustes por defecto permiten el envío de información sobre el usuario a Microsoft y sus socios.\n\nWindows 10 muestra publicidad en varias aplicaciones como el explorador de archivos y la pantalla de bloqueo, algo que mucha gente considera inaceptable.[16]​[17]​ Esto no aplica en ciertos países, puesto que no existe publicidad en el explorador de archivos ni en la pantalla de bloqueo, sin embargo, Microsoft Edge promociona los servicios Microsoft y a sí mismo.\n\nEl 31 de enero de 2023 Microsoft retiró del mercado a Windows 10, dejando de vender licencias de producto en las ediciones Home y Professional en su sitio oficial y la Microsoft Store, además el 28 de abril de 2023 la empresa anunció que la rama 22H2 es la última versión del sistema por lo que ya no recibirá nuevas características, y no será mejorado (debido a rumores de una posible versión 23H2), ahora solo recibirá actualizaciones de parches de bugs y seguridad hasta el 14 de octubre de 2025, acallando los rumores de futuras actualizaciones de características del sistema. Esto fue anunciado por la empresa en su página y en su cuenta oficial de Twitter.[18]​\n\nEl día 5 de diciembre de 2023, Microsoft anunció a través de su blog de noticias de empresas que Windows 10 tendría actualizaciones de seguridad extendidas (ESU), este programa, al igual que Windows 7 y Windows Server 2012 R2 (con dicho programa aun en curso desde el fin de soporte de dicho sistema) da a las empresas un \"periodo de gracia\" (es decir, una prórroga) para migrar sus ordenadores a la nueva versión de windows, este programa incluye tanto actualizaciones de seguridad como actualizaciones de los net framework compatibles, dicho soporte es de pago de manera anual, siendo el segundo y el tercer año más caro y siempre tiene un periodo de 3 años, al igual que Windows 7, que finalizó su soporte extendido en enero de 2023, con lo cual alargaria el soporte de pago de los tres años adicionales a 2028[19]​\n\nEste soporte extendido ha mostrado estos cambios siguiendo el modelo del primer ESU en Windows 7. Anteriormente estaba dirigido a las empresas, pero ahora todo el mundo puede optar al soporte extendido de Windows 10[20]​\n\n", "sections": [{"name": "Desarrollo", "text": "", "subsections": []}, {"name": "Características", "text": "", "subsections": []}, {"name": "Aplicaciones y características eliminadas", "text": "", "subsections": []}, {"name": "Herramientas sin soporte", "text": "", "subsections": []}, {"name": "Ediciones y precio", "text": "", "subsections": []}, {"name": "Actualizaciones y soporte", "text": "", "subsections": []}, {"name": "Historial de versiones", "text": "", "subsections": []}, {"name": "Requisitos del sistema", "text": "", "subsections": []}, {"name": "Recepción crítica", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/WxPython", "title": "wxPython", "summary": "\nwxPython es un binding de la biblioteca gráfica wxWidgets para el lenguaje de programación Python. La biblioteca wxWidgets se caracteriza por ser multiplataforma, por lo que su uso junto a Python permite el desarrollo rápido de aplicaciones gráficas multiplataforma.\n\n", "sections": [{"name": "Licencia", "text": "", "subsections": []}, {"name": "Historia", "text": "", "subsections": []}, {"name": "Project Phoenix", "text": "", "subsections": []}, {"name": "Ejemplo", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/WxWidgets", "title": "wxWidgets", "summary": "\nLas wxWidgets son unas  bibliotecas multiplataforma y libres, para el desarrollo de interfaces gráficas programadas en lenguaje C++. Están publicadas bajo una licencia LGPL, similar a la GPL con la excepción de que el código binario producido por el usuario a partir de ellas, puede ser propietario, permitiendo desarrollar aplicaciones empresariales sin coste de licencias.\n\nLas wxWidgets proporcionan una interfaz gráfica basada en las bibliotecas ya existentes en el sistema (nativas), con lo que se integran de forma óptima y resultan muy portables entre distintos sistemas operativos. Están disponibles para Windows, MacOS, GTK+, Motif, OpenVMS y OS/2. \n\nTambién pueden ser utilizadas desde otros lenguajes de programación, aparte del C++: Java, JavaScript, Perl, Python, Smalltalk, Ruby, Erlang.\n\n", "sections": [{"name": "Breve historia", "text": "", "subsections": []}, {"name": "Licencia", "text": "", "subsections": []}, {"name": "Soporte oficial", "text": "", "subsections": []}, {"name": "Implementaciones", "text": "", "subsections": []}, {"name": "IDE y RAD para wxWidgets", "text": "", "subsections": []}, {"name": "Aplicaciones desarrolladas con wxWidgets", "text": "", "subsections": []}, {"name": "Véase también", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Zen_de_Python", "title": "Zen de Python", "summary": "\n\nBusca fuentes: «Zen de Python» – noticias · libros · académico · imágenes\nEl Zen de Python es una colección de 20 principios de software que influyen en el diseño del Lenguaje de Programación Python, de los cuales 19 fueron escritos por Tim Peters[1]​ en junio de 1999.[2]​ El texto es distribuido como dominio público.\n\nEl Zen de Python está escrito como la entrada informativa número 20 de las Propuestas de Mejoras de Python (PEP, Python Enhancement Proposals), y se puede encontrar en el sitio oficial de Python.[3]​ También se incluye como un huevo de pascua en el intérprete de Python, mostrandosé al ingresar la instrucción import this.[4]​\n\n", "sections": [{"name": "Principios[5]​", "text": "", "subsections": []}, {"name": "Referencias", "text": "", "subsections": []}, {"name": "Enlaces externos", "text": "", "subsections": []}]}
